{
  "FFlagAXDisableHiddenCatalogCategoryPills": {
    "mechanism": "Disables the display of certain hidden categories in the catalog.",
    "purpose": "Players will see a cleaner catalog without hidden categories."
  },
  "FStringLuaOTATag": {
    "mechanism": "Introduces a new tagging system for Lua scripts.",
    "purpose": "Helps developers organize and manage their scripts more effectively."
  },
  "FFlagReconnectToSameServer": {
    "mechanism": "Allows players to reconnect to the same game server after disconnecting.",
    "purpose": "Players can return to their game without losing progress or their place."
  },
  "DFFlagEnableGameJoinChatTimeoutEvent_Staged": {
    "mechanism": "Implements a timeout event for chat when joining games.",
    "purpose": "Improves chat reliability for players when they join games."
  },
  "FFlagStudioTasksFutureShareMutexes": {
    "mechanism": "Enables better management of shared resources in Studio tasks.",
    "purpose": "Enhances performance and stability for developers using Roblox Studio."
  },
  "FFlagAXMigrateItemOwnerShipPageToAutofocus": {
    "mechanism": "Automatically focuses on the item ownership page when accessed.",
    "purpose": "Makes it easier for players to see and manage their owned items quickly."
  },
  "FFlagCorrectGuiStateMouseDownAndroid": {
    "mechanism": "Fixes how the GUI responds to mouse down events on Android devices.",
    "purpose": "Improves the user interface interaction for Android players, making it smoother."
  },
  "FFlagVoiceConnectionApiSendSdpParsingErrorTelemetry_Staged": {
    "mechanism": "Tracks and reports errors related to voice connection setup.",
    "purpose": "Helps improve voice chat reliability by identifying and fixing issues."
  },
  "FFlagEnableSocialSelfProfileViewExposureEvents_Staged": {
    "mechanism": "Enables tracking when players view their own profiles in social features.",
    "purpose": "Enhances social features by understanding player engagement with their profiles."
  },
  "FFlagSelfieConsentDialogDontUsePortal": {
    "mechanism": "Removes the use of a portal for the selfie consent dialog.",
    "purpose": "Simplifies the process for players to give consent for taking selfies."
  },
  "FFlagAXCategoryPillColorAnimation": {
    "mechanism": "Enables animated color transitions for category pills in the UI.",
    "purpose": "Makes the interface more visually appealing and engaging for players."
  },
  "FFlagVoiceAddWebrtClosedTransitionEnabled_Staged": {
    "mechanism": "Implements a smoother transition for voice chat when connecting and disconnecting.",
    "purpose": "Enhances the voice chat experience by reducing abrupt changes."
  },
  "FFlagAXEnableItemDetailsTryOnPage2": {
    "mechanism": "Allows players to try on items directly from the details page of the second item.",
    "purpose": "Improves the shopping experience by making it easier to preview items before buying."
  },
  "FStringTextureTranscodeFidelityETC": {
    "mechanism": "Adjusts the quality of texture compression for better visual fidelity.",
    "purpose": "Provides players with higher-quality graphics and textures in games."
  },
  "DFIntBadgeServiceMaximumBadgeGetCount_PlaceFilter": {
    "mechanism": "Sets a limit on the number of badges that can be retrieved based on place filters.",
    "purpose": "Optimizes badge retrieval for players, ensuring they see relevant badges without overload."
  },
  "FFlagNewBindToMessageError_Staged": {
    "mechanism": "Improves error handling for message binding in scripts.",
    "purpose": "Reduces confusion for developers by providing clearer error messages."
  },
  "DFIntRobloxTelemetryLoadTestStartThrottleHundredthsPercent_PlaceFilter": {
    "mechanism": "Adjusts the frequency of telemetry data collection based on place filters.",
    "purpose": "Enhances performance by optimizing data collection, leading to smoother gameplay."
  },
  "FFlagLuaAppFocusFixTopBanner_Staged": {
    "mechanism": "Fixes focus issues with the top banner in Lua applications.",
    "purpose": "Improves user experience by ensuring the top banner is properly interactive."
  },
  "FFlagPlaceVersionHistoryMetadataRCC_Staged": {
    "mechanism": "Adds metadata to version history for places in the Roblox Cloud.",
    "purpose": "Helps developers track changes more effectively, making it easier to manage updates."
  },
  "DFFlagProductInfoBatchingEnabled_PlaceFilter": {
    "mechanism": "Enables batching of product information requests for places.",
    "purpose": "Improves loading times for product info, enhancing the shopping experience for players."
  },
  "FFlagRbxthumbForAlbumArt": {
    "mechanism": "Uses a new method to generate thumbnails for album art.",
    "purpose": "Improves the visual quality of album art displayed in Roblox."
  },
  "FFlagUIEditorActionURI": {
    "mechanism": "Enables a new way to handle actions in the UI editor via URIs.",
    "purpose": "Makes it easier for developers to create and manage UI elements."
  },
  "DFFlagRbxStorageRemoveOldCacheSkipEmpty": {
    "mechanism": "Removes old cached data from storage, skipping empty files.",
    "purpose": "Frees up storage space, improving game performance."
  },
  "DFFlagFixImageContentInvalid": {
    "mechanism": "Fixes issues with invalid image content being displayed.",
    "purpose": "Ensures that images load correctly, enhancing the user experience."
  },
  "FFlagSduiComponentSkipParseLocalProps": {
    "mechanism": "Optimizes the processing of local properties in UI components.",
    "purpose": "Increases the speed and efficiency of UI rendering."
  },
  "FFlagCallVoiceLeaveOnNetworkDisconnect2": {
    "mechanism": "Automatically disconnects voice chat when the network connection drops.",
    "purpose": "Ensures players don't remain in voice chat if they lose their internet connection."
  },
  "FFlagAXMarketplaceCategoryPillTooltip": {
    "mechanism": "Displays tooltips when hovering over marketplace category pills.",
    "purpose": "Helps players understand what each category represents before clicking."
  },
  "FFlagEnableConfirmButtonIconOnPlaystation": {
    "mechanism": "Adds a confirm button icon specific to PlayStation controllers.",
    "purpose": "Improves user experience for PlayStation players by showing the correct button to press."
  },
  "FFlagAXCatalogReactPerfIXPEnabledV3": {
    "mechanism": "Optimizes the performance of the catalog using React technology.",
    "purpose": "Makes browsing the catalog faster and smoother for players."
  },
  "DFStringLoadTestingUniverseId_Staged": {
    "mechanism": "Loads a specific universe ID for testing purposes.",
    "purpose": "Allows developers to test features in a controlled environment before public release."
  },
  "FFlagAppChatEnableHandheldScalingFixes": {
    "mechanism": "Adjusts chat interface scaling for handheld devices.",
    "purpose": "Improves readability and usability of chat on mobile devices."
  },
  "DFFlagEnableUpdateClientFeatureTimeoutListener2_Staged": {
    "mechanism": "Implements a listener for client feature updates with a timeout.",
    "purpose": "Enhances the reliability of feature updates, ensuring players receive them in a timely manner."
  },
  "FFlagEnableAudioSpeechToText_PlaceFilter": {
    "mechanism": "Enables filtering of speech-to-text audio based on the game environment.",
    "purpose": "Allows players to communicate more effectively by filtering out irrelevant audio in specific game areas."
  },
  "FFlagSTM6819Enabled": {
    "mechanism": "Activates a specific system update or feature set.",
    "purpose": "Introduces new functionalities or improvements to enhance player experience."
  },
  "FFlagCustomDspBaseSupportsSidechain": {
    "mechanism": "Adds support for sidechain audio processing in custom DSP.",
    "purpose": "Enables more advanced audio effects, improving the sound quality and experience in games."
  },
  "FStringEngineVoiceSdpCompressionIxpLayer_IXP": {
    "mechanism": "Compresses voice data for more efficient transmission.",
    "purpose": "Improves voice chat quality and reduces lag during conversations."
  },
  "FFlagLuaAppFocusFixTopBanner": {
    "mechanism": "Adjusts how the app handles focus on top banners.",
    "purpose": "Ensures better visibility and interaction with important notifications."
  },
  "FFlagPlaceVersionHistoryMetadataRCC": {
    "mechanism": "Enhances how version history is stored and accessed.",
    "purpose": "Allows players to see and revert to previous versions of places easily."
  },
  "FFlagStudioFixStandalonePluginUnloadingAsync3_Staged": {
    "mechanism": "Improves the unloading process for standalone plugins.",
    "purpose": "Reduces errors and crashes when using plugins in Roblox Studio."
  },
  "DFFlagFixImageContentInvalid_Staged": {
    "mechanism": "Corrects issues with invalid image content loading.",
    "purpose": "Ensures that images display correctly and consistently in games."
  },
  "DFFlagRemoveTemporaryScreenshotFilePresave": {
    "mechanism": "Removes the temporary files created before saving screenshots.",
    "purpose": "Reduces clutter and improves performance when taking screenshots."
  },
  "FFlagFixHapticWaveformReplication": {
    "mechanism": "Fixes how haptic feedback is sent to devices.",
    "purpose": "Enhances the tactile experience for players using compatible devices."
  },
  "FFlagSongbirdPopoverSubmenu2_Staged": {
    "mechanism": "Introduces a new submenu for the Songbird feature.",
    "purpose": "Improves navigation and usability for players using the Songbird feature."
  },
  "FFlagEnableFAECancellationAnalytics": {
    "mechanism": "Tracks when players cancel FAE (Feature Access Experience) actions.",
    "purpose": "Helps developers understand player behavior and improve user experiences."
  },
  "DFFlagLoadTestingEnabled3_Staged": {
    "mechanism": "Enables advanced load testing features for developers.",
    "purpose": "Ensures smoother gameplay by allowing developers to test how their games perform under heavy loads."
  },
  "FFlagEnableFAECancellationAnalytics_Staged": {
    "mechanism": "Tracks when players cancel actions in the game.",
    "purpose": "Helps developers understand player behavior to improve game experiences."
  },
  "FFlagAXMigrateQuickButtonsToGlobalAutoFocus": {
    "mechanism": "Moves quick action buttons to a centralized focus system.",
    "purpose": "Makes it easier for players to access important buttons quickly."
  },
  "FFlagSolverV2RefactorReplicationStateUpdate": {
    "mechanism": "Improves how game state updates are shared between players.",
    "purpose": "Enhances game performance and reduces lag during multiplayer sessions."
  },
  "FFlagProductInfoBatchingCoalescingEnabled_Staged": {
    "mechanism": "Groups product information requests to reduce server load.",
    "purpose": "Speeds up the loading of product details for players in the game."
  },
  "UseApplicationLifecycleCallbacks": {
    "mechanism": "N/A (invalid)",
    "purpose": "N/A (invalid)"
  },
  "FFlagEnableAutomaticGainControlForAudioDeviceInput": {
    "mechanism": "Automatically adjusts audio input levels for better sound quality.",
    "purpose": "Ensures players' voices are heard clearly during voice chats."
  },
  "FFlagAXRemoveTryOnManagerAvatarScreen": {
    "mechanism": "Removes the old system for trying on avatar items.",
    "purpose": "Streamlines the avatar customization process for a smoother experience."
  },
  "FFlagAXSendLegacyWidgetImpressions_Staged": {
    "mechanism": "Sends data about how often old widgets are viewed.",
    "purpose": "Helps developers understand widget usage to improve user interfaces."
  },
  "FFlagLuaAppAddSchemaFieldsToGameClicks": {
    "mechanism": "Adds new data fields to track player interactions with games.",
    "purpose": "Provides developers with better insights into player behavior."
  },
  "FFlagAXMigrateResellersCardToAutofocus": {
    "mechanism": "Changes how the reseller card is displayed to focus on it automatically.",
    "purpose": "Enhances visibility of reseller items for easier access by players."
  },
  "FIntServerTriggeredModalTrafficPercent": {
    "mechanism": "Controls the percentage of server-triggered modals shown to players.",
    "purpose": "Improves player engagement by managing how often they see pop-up messages."
  },
  "FFlagSlimServiceEnableUploadsInNonEditMode_Staged": {
    "mechanism": "Allows users to upload assets even when not in edit mode.",
    "purpose": "Enables players to share their creations more easily and flexibly."
  },
  "FFlagPurchasePromptPriceShouldUseProductInfoPrice2": {
    "mechanism": "Updates the purchase prompt to display the correct product price.",
    "purpose": "Ensures players see accurate pricing when making purchases."
  },
  "FFlagEnableNoiseReductionForAudioDeviceInput": {
    "mechanism": "Implements noise reduction technology for audio input devices.",
    "purpose": "Enhances voice chat quality by reducing background noise for clearer communication."
  },
  "DFIntAcousticSimulationForegroundCost": {
    "mechanism": "Sets the resource cost for running acoustic simulations in the game.",
    "purpose": "Optimizes game performance by managing how sound effects are processed."
  },
  "FFlagStudioFixStandalonePluginUnloadingAsync3": {
    "mechanism": "Improves the process of unloading plugins in Studio to be asynchronous.",
    "purpose": "Reduces delays and improves the overall experience when managing plugins."
  },
  "FFlagAppChatFixPaddingWhenScaling": {
    "mechanism": "Adjusts the chat interface padding dynamically when the app is resized.",
    "purpose": "Ensures that chat messages are displayed properly without awkward spacing."
  },
  "DFFlagVoiceChatSendHttpErrorsTelemetry": {
    "mechanism": "Tracks and sends data about HTTP errors related to voice chat.",
    "purpose": "Helps improve voice chat reliability by identifying and fixing issues."
  },
  "FFlagLuauRefineDistributesOverUnions": {
    "mechanism": "Enhances the Luau programming language to better handle union types.",
    "purpose": "Makes coding easier and more efficient for developers using unions in their scripts."
  },
  "DFIntTextChatMessageClientReceivedThrottlePermyriad_Staged": {
    "mechanism": "Limits the rate at which text chat messages are processed on the client side.",
    "purpose": "Prevents spam and ensures a smoother chat experience for players."
  },
  "FFlagVoiceConnectionApiSendSdpParsingErrorTelemetry": {
    "mechanism": "Sends data about errors in parsing connection information for voice chat.",
    "purpose": "Helps improve voice chat reliability by tracking and fixing issues."
  },
  "DFFlagWriteFlagCacheAfterFlagFetch": {
    "mechanism": "Stores flag values in a cache after retrieving them.",
    "purpose": "Improves performance by reducing the need to repeatedly fetch the same flag data."
  },
  "FFlagAXCatalogCategoryPillsShowAllCategory": {
    "mechanism": "Displays all categories in a pill format on the catalog page.",
    "purpose": "Makes it easier for players to explore and find items across all categories."
  },
  "FFlagFCSkeletonIgnoreUnusedPartsCheckFaceControls": {
    "mechanism": "Skips checks for unused parts in character face controls.",
    "purpose": "Enhances performance by reducing unnecessary checks during character animations."
  },
  "FFlagUIBloxTruncateExperienceTileMetadataTextFooter": {
    "mechanism": "Shortens the text displayed in the footer of experience tiles.",
    "purpose": "Improves visual clarity and aesthetics by preventing text overflow."
  },
  "DFStringLoadTestArguments_PlaceFilter": {
    "mechanism": "Filters place data during load tests based on specific criteria.",
    "purpose": "Improves the accuracy of load testing by focusing on relevant places."
  },
  "DFFlagVoiceSdpCompressionSendProtoParseErrorTelemetry_Staged": {
    "mechanism": "Collects data on errors related to voice communication protocols.",
    "purpose": "Enhances voice chat reliability by identifying and fixing issues."
  },
  "DFFlagVideoSandboxPreviewVideos_Staged": {
    "mechanism": "Allows users to preview videos in a controlled environment before full release.",
    "purpose": "Enables creators to test and refine video content before it goes live."
  },
  "FFlagUIBloxFixModalBottomSheetSelectable": {
    "mechanism": "Fixes selection issues in modal bottom sheets within the UI framework.",
    "purpose": "Improves user experience by ensuring modal options can be selected correctly."
  },
  "FFlagFixDisplaySizeEnum": {
    "mechanism": "Corrects the enumeration of display sizes for better compatibility.",
    "purpose": "Ensures games display correctly on various screen sizes, enhancing playability."
  },
  "DFFlagVideoWinHwEncoderDeleteIfNoPool_Staged": {
    "mechanism": "Removes the hardware encoder if there are no active video streams.",
    "purpose": "Improves system performance by freeing up resources."
  },
  "FFlagFoundationPseudoChildSelectors": {
    "mechanism": "Enables new CSS-like selectors for easier UI element targeting.",
    "purpose": "Makes it simpler for developers to style and manage game interfaces."
  },
  "FFlagRemoveRespawnShortcutFromRespawnConfirmation": {
    "mechanism": "Disables the shortcut key for respawning during confirmation.",
    "purpose": "Prevents accidental respawns, giving players more control over their actions."
  },
  "DFIntLoadTestStartTimeUnix_PlaceFilter": {
    "mechanism": "Sets a specific start time for load tests based on Unix time.",
    "purpose": "Helps developers test game performance more accurately."
  },
  "FFlagAXCatalogCategoryPillsIXP": {
    "mechanism": "Introduces new category pills in the catalog interface.",
    "purpose": "Enhances the browsing experience for players looking for items."
  },
  "DFIntProductInfoBatchingMaxSize_PlaceFilter": {
    "mechanism": "Limits the number of product info requests that can be processed at once.",
    "purpose": "Improves performance by reducing server load when fetching product information."
  },
  "DFIntDataStoreOrderedGetFixedRequestLimit_PlaceFilter": {
    "mechanism": "Sets a maximum limit on the number of data store requests that can be made in a single operation.",
    "purpose": "Enhances stability and efficiency when retrieving player data."
  },
  "FStringIxpNewLayersForRegistration": {
    "mechanism": "Introduces new layers in the registration process for user accounts.",
    "purpose": "Streamlines account creation and improves user experience."
  },
  "FFlagUITextureRendererUseNewRenderPath": {
    "mechanism": "Switches to a new method for rendering textures in the user interface.",
    "purpose": "Provides better visual quality and performance in UI elements."
  },
  "FFlagUKOSALegacyReportMenu_Staged": {
    "mechanism": "Updates the reporting menu for users in the UK to a new staged version.",
    "purpose": "Offers a more user-friendly interface for reporting issues."
  },
  "DFIntLoadTestParticipationPerMillionUsers_PlaceFilter": {
    "mechanism": "Limits load testing to specific places based on user participation.",
    "purpose": "Ensures that only certain games are tested for performance, improving overall game stability."
  },
  "FFlagAXCatalogReactPerfIXPEnabledV3_Staged": {
    "mechanism": "Implements a new version of the catalog using React for better performance.",
    "purpose": "Provides a faster and smoother experience when browsing items in the catalog."
  },
  "DFFlagCLI169073": {
    "mechanism": "Enables a specific feature or fix in the command line interface.",
    "purpose": "Improves developer tools, making it easier for creators to manage their games."
  },
  "DFIntAssetProviderCdnBytesThrottleHundrethsPercent2": {
    "mechanism": "Throttles the amount of data sent from the asset provider to manage bandwidth.",
    "purpose": "Reduces lag and improves loading times for players by optimizing data delivery."
  },
  "FFlagMediaPlaybackStopsWhenJoiningExperience_Staged": {
    "mechanism": "Stops media playback when a player joins a game.",
    "purpose": "Enhances the player's experience by preventing distractions from media while loading into a game."
  },
  "FFlagProductInfoBatchingCoalescingEnabled_PlaceFilter": {
    "mechanism": "Groups product info requests to reduce server load.",
    "purpose": "Improves performance by making game loading faster for players."
  },
  "FFlagEnableAppNavGamepadRemoval": {
    "mechanism": "Removes gamepad navigation from the app interface.",
    "purpose": "Simplifies navigation for players using touch or keyboard controls."
  },
  "DFFlagSkipSavingEmptyCapture": {
    "mechanism": "Prevents saving empty game captures to reduce clutter.",
    "purpose": "Saves storage space and keeps players' game captures organized."
  },
  "FFlagLuaAppRecommendedGamesCollectionCarousel": {
    "mechanism": "Introduces a carousel for displaying recommended games.",
    "purpose": "Helps players discover new games easily through a visually appealing format."
  },
  "FFlagMicroprofilerBigButtons": {
    "mechanism": "Changes the size of buttons in the microprofiler tool.",
    "purpose": "Enhances usability for developers analyzing game performance."
  },
  "DFFlagProductInfoBatchingEnabled2_PlaceFilter": {
    "mechanism": "Groups product info requests by place to reduce server load.",
    "purpose": "Improves performance and speed when accessing product information in different game places."
  },
  "FFlagAXUnifiedLoggingValidation1": {
    "mechanism": "Standardizes how logs are validated across systems.",
    "purpose": "Enhances the reliability of game data tracking for better debugging and analytics."
  },
  "DFFlagVoiceSdpCompressionRemoteEventFieldReceivesUnexpectedValue": {
    "mechanism": "Addresses issues with unexpected data in voice communication events.",
    "purpose": "Ensures smoother and more reliable voice chat experiences for players."
  },
  "FFlagNetworkInterface_Staged": {
    "mechanism": "Implements a new network interface in stages for testing.",
    "purpose": "Allows for gradual improvements in network performance and stability for players."
  },
  "FFlagAXBackgroundSceneManagerRevamp3_Staged": {
    "mechanism": "Revamps the management of background scenes for better resource handling.",
    "purpose": "Enhances game performance and visual quality by optimizing how scenes are loaded and managed."
  },
  "DFStringFlagRepoGitHashDynamicString": {
    "mechanism": "Enables dynamic retrieval of Git hash strings for versioning.",
    "purpose": "Improves version tracking for developers, ensuring players have the latest features."
  },
  "FFlagAppChatConversationOverlayRefactor": {
    "mechanism": "Updates the chat overlay system for better performance and usability.",
    "purpose": "Enhances the chat experience, making it easier for players to communicate."
  },
  "FFlagLuauOccursCheckInCommit": {
    "mechanism": "Adds a check in the Luau programming language to ensure certain conditions are met during commits.",
    "purpose": "Increases code reliability, leading to a smoother gameplay experience for players."
  },
  "FFlagLuauCompileVectorLerp": {
    "mechanism": "Optimizes the compilation of vector interpolation functions in Luau.",
    "purpose": "Improves performance of animations and movements in games, resulting in a more fluid experience."
  },
  "DFFlagVideoWinHwEncoderDeleteIfNoPool": {
    "mechanism": "Removes unused hardware encoders when no video pool is available.",
    "purpose": "Reduces resource usage, leading to better performance and stability in video features for players."
  },
  "FFlagProductInfoBatchingCoalescingEnabled": {
    "mechanism": "Groups multiple product info requests into a single request to reduce server load.",
    "purpose": "Improves loading times for product information, making the shopping experience smoother for players."
  },
  "FFlagAXCategoryPillScrollToStart": {
    "mechanism": "Adjusts the scrolling behavior of category pills to start from the beginning when selected.",
    "purpose": "Enhances navigation by ensuring players see the first items in a category when they click on it."
  },
  "FFlagRbxthumbForAlbumArt_Staged": {
    "mechanism": "Updates the way album art thumbnails are generated and displayed.",
    "purpose": "Provides better quality and more visually appealing album art for players to enjoy."
  },
  "DFFlagSkipSavingEmptyCapture_Staged": {
    "mechanism": "Prevents saving empty capture data to reduce unnecessary storage use.",
    "purpose": "Saves space and improves performance by not saving useless data, benefiting players indirectly."
  },
  "FFlagLuauVectorLerp": {
    "mechanism": "Introduces a new method for smoothly transitioning between vector values.",
    "purpose": "Allows for smoother animations and movements in games, enhancing the overall gameplay experience."
  },
  "FFlagFixDisplaySizeEnum_Staged": {
    "mechanism": "Adjusts how display sizes are defined in the system.",
    "purpose": "Ensures that display sizes are more accurately represented, improving visual consistency."
  },
  "DFIntVoiceChatHttpErrorsTelemetryThrottleHundredthsPercent_Staged": {
    "mechanism": "Limits the frequency of telemetry data sent for voice chat errors.",
    "purpose": "Reduces server load and improves performance by managing error reporting more efficiently."
  },
  "FFlagSduiSupportArrayParsing": {
    "mechanism": "Enables the system to handle arrays in SDUI (Scripted Data User Interface).",
    "purpose": "Allows developers to create more complex and interactive user interfaces."
  },
  "FFlagColorPickerUseGridLayout": {
    "mechanism": "Changes the layout of the color picker to a grid format.",
    "purpose": "Makes it easier for players to select colors by providing a more organized view."
  },
  "FFlagExtendedLightRangesFixDirtyCrash": {
    "mechanism": "Fixes issues related to light range settings that could cause crashes.",
    "purpose": "Improves game stability by preventing crashes related to lighting configurations."
  },
  "FFlagEnableProfilePlatformDualCta_v5_IXP": {
    "mechanism": "Enables dual call-to-action buttons on user profiles.",
    "purpose": "Allows players to easily access two different actions, improving user experience."
  },
  "FFlagAddFriendsConsistentFocusActions": {
    "mechanism": "Standardizes the way players can focus on friend-related actions.",
    "purpose": "Makes it easier for players to manage and interact with their friends."
  },
  "FFlagSduiSupportArrayParsing_Staged": {
    "mechanism": "Implements support for parsing array data in the new UI system.",
    "purpose": "Enhances the user interface by allowing more complex data to be displayed correctly."
  },
  "FFlagEnableProfilePlatformDualCta_v5": {
    "mechanism": "Activates a new version of dual call-to-action buttons on profiles.",
    "purpose": "Improves navigation options for players on user profiles."
  },
  "FFlagAXMigrateItemDetailsFullToAutoFocus": {
    "mechanism": "Migrates item detail views to automatically focus on key information.",
    "purpose": "Helps players quickly find important details about items they are interested in."
  },
  "FFlagAXMigrateEmoteMenuFromRoactGamepad_Staged": {
    "mechanism": "Migrates the emote menu to a new system for gamepad users.",
    "purpose": "Improves the emote menu experience for players using game controllers."
  },
  "FFlagStudioUseUIThread": {
    "mechanism": "Switches the Studio interface to use a dedicated UI thread for rendering.",
    "purpose": "Enhances performance and responsiveness of the Roblox Studio interface."
  },
  "DFFlagUseVisBugChecks_PlaceFilter": {
    "mechanism": "Enables visual bug checks for filtering places.",
    "purpose": "Helps ensure that players can find and access high-quality games without visual issues."
  },
  "DFStringDataStoreRdbShadowTrafficRolloutConfig_PlaceFilter": {
    "mechanism": "Configures how data is managed in the background for place filtering.",
    "purpose": "Improves the reliability of data storage for games, enhancing player experience."
  },
  "FFlagInitializeAutocompleteOnlyIfEnabledV3": {
    "mechanism": "Activates autocomplete features in the editor only if the feature is turned on.",
    "purpose": "Streamlines the coding process for developers by providing suggestions only when needed."
  },
  "FFlagAXFixFocusNavigationShiftingWidgetList": {
    "mechanism": "Fixes focus navigation issues in widget lists for better accessibility.",
    "purpose": "Improves navigation for players using assistive technologies."
  },
  "FFlagLuaAppsServerTriggeredModals_Staged": {
    "mechanism": "Allows servers to trigger modal pop-ups in Lua apps.",
    "purpose": "Enables dynamic interactions and notifications for players during gameplay."
  },
  "DFFlagVoiceSdpCompressionSendSizeTelemetry": {
    "mechanism": "Collects data on the size of compressed voice data sent.",
    "purpose": "Helps improve voice chat quality and performance for players."
  },
  "FFlagLuaAppAddSortDataToSocialCarouselClicks": {
    "mechanism": "Adds sorting data to clicks on social carousel items in Lua apps.",
    "purpose": "Enhances user experience by organizing social interactions better."
  },
  "DFFlagEditableMeshFastClusterSkipLoD_Staged": {
    "mechanism": "Optimizes rendering of editable meshes by skipping certain detail levels.",
    "purpose": "Improves performance and loading times for players using complex models."
  },
  "DFStringLoadTestingUniverseId": {
    "mechanism": "Enables loading of specific test universes for performance evaluation.",
    "purpose": "Allows developers to test their games in a controlled environment to improve performance."
  },
  "FFlagAXEnableCategoryPills4": {
    "mechanism": "Activates a new design for category navigation in the user interface.",
    "purpose": "Makes it easier for players to find and explore different game categories."
  },
  "FFlagAddTopBarScrim": {
    "mechanism": "Adds a visual overlay to the top bar of the game interface.",
    "purpose": "Enhances the visibility of the top bar, improving user experience."
  },
  "FFlagFCSkeletonIgnoreUnusedPartsCheckFaceControls_Staged": {
    "mechanism": "Modifies how unused parts are handled in character models during face control checks.",
    "purpose": "Improves character animations by ignoring unnecessary parts, leading to smoother movements."
  },
  "FFlagAppChatEnableHandheldScalingFixes_Staged": {
    "mechanism": "Implements fixes for scaling issues in chat on handheld devices.",
    "purpose": "Ensures chat is displayed correctly on mobile devices, making communication easier for players."
  },
  "FFlagFixLockCenterMouseClickAndScroll_Staged": {
    "mechanism": "Fixes the mouse lock feature to properly handle clicks and scrolling.",
    "purpose": "Improves player control and interaction while in mouse lock mode."
  },
  "FFlagPerfDataOnTelemetryV2": {
    "mechanism": "Enhances performance data collection for better analysis.",
    "purpose": "Provides players with a smoother experience by identifying and fixing performance issues."
  },
  "FStringFlipTimeStampFastString": {
    "mechanism": "Optimizes how timestamps are processed in strings.",
    "purpose": "Increases the speed of displaying time-related information for players."
  },
  "FFlagAXCategoryPillPositionAnimation": {
    "mechanism": "Adds animations for category pill positioning in the UI.",
    "purpose": "Makes the user interface more visually appealing and engaging for players."
  },
  "FFlagFFlagIconHostSetZIndexToDefault": {
    "mechanism": "Resets the z-index of icon hosts to a default value.",
    "purpose": "Ensures icons are displayed correctly and consistently in the game interface."
  },
  "FFlagFixEmoteWarningSize": {
    "mechanism": "Adjusts the size of warning messages related to emotes.",
    "purpose": "Ensures players see clear and appropriately sized warnings when using emotes."
  },
  "FFlagIsrMainMetrics": {
    "mechanism": "Implements a new system for tracking main performance metrics.",
    "purpose": "Improves the overall performance and stability of the game for players."
  },
  "FFlagCachelessPluginLoading2": {
    "mechanism": "Loads plugins without relying on cached data.",
    "purpose": "Reduces loading times and improves the reliability of plugins for developers and players."
  },
  "FStringEngineVoiceSdpCompressionIxpLayer": {
    "mechanism": "Enhances voice communication by compressing audio data.",
    "purpose": "Provides clearer and more efficient voice chat for players."
  },
  "DFFlagAndroidDebugHeapTelemetry": {
    "mechanism": "Collects detailed memory usage data for debugging on Android devices.",
    "purpose": "Helps developers optimize the game on Android, leading to a smoother experience for players."
  },
  "FFlagFlyweightTrackId_Staged": {
    "mechanism": "Optimizes how track IDs are managed in the game engine.",
    "purpose": "Improves performance and reduces memory usage during gameplay."
  },
  "FFlagCleanUpMouseWrapMode": {
    "mechanism": "Refines how the mouse cursor behaves when it reaches the edges of the screen.",
    "purpose": "Enhances user experience by preventing the mouse from getting stuck at screen edges."
  },
  "FFlagAXEnableCategoryPills4_Staged": {
    "mechanism": "Introduces a new way to categorize items in the user interface.",
    "purpose": "Makes it easier for players to find and organize their items."
  },
  "DFFlagVideoSandboxPreviewVideos": {
    "mechanism": "Allows videos to be previewed in a controlled environment.",
    "purpose": "Enables players to test and view videos before they are published."
  },
  "FFlagAXFixManageOutfitPageFocusLostBehind": {
    "mechanism": "Addresses focus issues on the outfit management page.",
    "purpose": "Ensures players can easily navigate and manage their outfits without losing focus."
  },
  "DFFlagAudioSpeechToTextRequireVoiceChat2": {
    "mechanism": "Enables speech-to-text functionality only for users with voice chat enabled.",
    "purpose": "Allows players to convert spoken words into text messages while using voice chat."
  },
  "FFlagAXCategoryPillColorAnimationInstantOff_Staged": {
    "mechanism": "Changes the animation for category pill colors to instantly turn off instead of fading.",
    "purpose": "Improves visual responsiveness when interacting with category options in the UI."
  },
  "FFlagAXMigrateEmoteMenuFromRoactGamepad": {
    "mechanism": "Moves the emote menu functionality to a new framework for better gamepad support.",
    "purpose": "Enhances the experience of using emotes for players using game controllers."
  },
  "DFFlagMoveOctreeChecks": {
    "mechanism": "Adjusts how the game checks for object collisions using an octree structure.",
    "purpose": "Improves game performance by optimizing how objects interact with each other."
  },
  "FFlagCallVoiceLeaveOnNetworkDisconnect2_Staged": {
    "mechanism": "Automatically disconnects voice chat when the player's network connection drops.",
    "purpose": "Prevents players from being stuck in voice chat if they lose internet connection."
  },
  "FFlagRemoveiOS13DeprecatedCode": {
    "mechanism": "Removes old code that is no longer needed for iOS 13 devices.",
    "purpose": "Improves app performance and stability on iOS devices."
  },
  "FFlagVoiceChatClientRewrite_OneFlagToRuleThemAll_Client2": {
    "mechanism": "Rewrites the voice chat system for better functionality and reliability.",
    "purpose": "Enhances the voice chat experience for players, making it clearer and more stable."
  },
  "FFlagFixDisplaySizeVR2": {
    "mechanism": "Adjusts the display settings for virtual reality to ensure proper sizing.",
    "purpose": "Provides a better visual experience for VR users, making games more immersive."
  },
  "FFlagFlyweightTrackId": {
    "mechanism": "Optimizes how track IDs are managed to reduce memory usage.",
    "purpose": "Improves game performance by using resources more efficiently."
  },
  "FFlagVideoWinEncodeSampleTracking": {
    "mechanism": "Implements tracking for video encoding samples on Windows.",
    "purpose": "Enhances video quality and reliability for players watching or sharing content."
  },
  "FFlagAXExternalItemDetailsOverlay": {
    "mechanism": "Enables a new overlay for displaying item details from external sources.",
    "purpose": "Provides players with a better view of item information without leaving the game."
  },
  "DFFlagWriteFlagCacheAfterDynamicFetch": {
    "mechanism": "Caches flag data after it is dynamically retrieved to improve performance.",
    "purpose": "Speeds up access to flag information, enhancing game responsiveness."
  },
  "DFIntRobloxTelemetryLoadTestEndThrottleHundredthsPercent_PlaceFilter": {
    "mechanism": "Adjusts the telemetry load test settings based on place filters.",
    "purpose": "Improves data accuracy and performance during load testing for developers."
  },
  "FFlagEngineVoiceSdpCompressionIxpEnabled_Staged": {
    "mechanism": "Enables compression for voice data in the engine using SDP.",
    "purpose": "Reduces bandwidth usage for voice chat, making it clearer and more efficient."
  },
  "FFlagMicroprofilerBigButtons_Staged": {
    "mechanism": "Changes the size of buttons in the microprofiler for easier interaction.",
    "purpose": "Makes it simpler for developers to use profiling tools to optimize game performance."
  },
  "FFlagSTM6819Enabled_Staged": {
    "mechanism": "Enables a new system for managing game data more efficiently.",
    "purpose": "Improves game performance and reduces loading times for players."
  },
  "FFlagSelfieConsentDontMountUnused": {
    "mechanism": "Prevents unnecessary loading of selfie features that aren't used.",
    "purpose": "Saves device resources, leading to smoother gameplay."
  },
  "FFlagAndroidTrimMemoryCounters": {
    "mechanism": "Tracks memory usage on Android devices more accurately.",
    "purpose": "Helps optimize game performance on mobile, reducing crashes."
  },
  "FFlagAXMigrateCommunityAvatarEntryButtonToLocalRef": {
    "mechanism": "Changes how the community avatar button is referenced in the code.",
    "purpose": "Enhances the speed and reliability of accessing community avatars."
  },
  "DFFlagRemoveTemporaryScreenshotFilePresave_Staged": {
    "mechanism": "Eliminates the need to save temporary screenshot files before finalizing.",
    "purpose": "Reduces storage use and speeds up the screenshot process for players."
  },
  "DFIntJoinLimitWin32x64": {
    "mechanism": "Limits the number of players joining a game on 64-bit Windows systems.",
    "purpose": "Ensures smoother gameplay by preventing server overload."
  },
  "FFlagConvertVariantToCorrectType": {
    "mechanism": "Automatically changes data types to match expected formats.",
    "purpose": "Improves game stability by reducing errors related to data mismatches."
  },
  "FFlagVideoGamePreviewSessionTracking": {
    "mechanism": "Tracks player sessions during video game previews.",
    "purpose": "Helps developers gather feedback on gameplay experiences before full release."
  },
  "FFlagVoiceChatEnableSdpCompressionMaster3_Staged": {
    "mechanism": "Implements compression for voice chat data to reduce bandwidth usage.",
    "purpose": "Enhances voice chat quality while using less internet data."
  },
  "FFlagVideoEncoderScopedOutputBuffer": {
    "mechanism": "Uses a specific output buffer for video encoding to optimize performance.",
    "purpose": "Delivers smoother video streaming and recording experiences for players."
  },
  "FFlagProfilePlatformEnableClickToCopyUsername_Staged": {
    "mechanism": "Enables a feature that allows users to click on usernames to copy them to the clipboard.",
    "purpose": "Makes it easier for players to share usernames without manually typing them out."
  },
  "FFlagUnsyncBreakpointsInClonedScripts": {
    "mechanism": "Allows breakpoints in scripts to remain active even when the script is cloned.",
    "purpose": "Improves debugging for developers by ensuring breakpoints work in cloned versions of scripts."
  },
  "FFlagFFlagFixLayeredSorting": {
    "mechanism": "Adjusts the rendering order of layered clothing items to display them correctly.",
    "purpose": "Enhances the visual appearance of avatars by ensuring clothing layers are shown in the right order."
  },
  "FFlagReverbAbsorptionFieldFileFormat": {
    "mechanism": "Introduces a new file format for managing sound reverb effects in game environments.",
    "purpose": "Improves sound quality and immersion in games by allowing better control over how sounds behave in different spaces."
  },
  "FFlagLuaAppsServerTriggeredModals": {
    "mechanism": "Enables server-side scripts to trigger modal dialogs in Lua applications.",
    "purpose": "Allows developers to create interactive pop-up messages that enhance user experience during gameplay."
  },
  "DFIntTextChatMessageClientReceivedThrottlePermyriad": {
    "mechanism": "Limits the number of chat messages received by the client to reduce spam.",
    "purpose": "Helps players see important messages without being overwhelmed by too many chat notifications."
  },
  "FFlagAddDismissTopBarFocus": {
    "mechanism": "Allows players to easily remove focus from the top bar UI.",
    "purpose": "Makes it simpler for players to interact with the game without distractions from the top bar."
  },
  "FFlagUpdateViewportOnUse3DPanelsChanged": {
    "mechanism": "Updates the game view when 3D panels are used or modified.",
    "purpose": "Improves the visual experience by ensuring the game view reflects changes in 3D panels instantly."
  },
  "FFlagAXDisableGamepadPanning": {
    "mechanism": "Disables the ability to pan the camera using a gamepad.",
    "purpose": "Provides a more stable camera control experience for players using gamepads."
  },
  "FFlagReverbAbsorptionField": {
    "mechanism": "Introduces a new audio feature that affects how sound behaves in different areas.",
    "purpose": "Enhances the audio experience by making sounds feel more realistic based on the environment."
  },
  "FFlagStudioActionsMultiplePayloads_Staged": {
    "mechanism": "Allows multiple actions to be sent at once in the studio.",
    "purpose": "Improves efficiency for developers by reducing the number of individual actions needed."
  },
  "DFFlagEnableContextForGenerateList_Staged": {
    "mechanism": "Adds context information when generating lists in the studio.",
    "purpose": "Helps developers understand and manage their assets better."
  },
  "FFlagPassTextAlignmentRelevancyInfo": {
    "mechanism": "Sends information about text alignment settings to the system.",
    "purpose": "Ensures text displays correctly according to user preferences."
  },
  "FFlagEnableAppChatFocusableFixes2": {
    "mechanism": "Implements fixes to make chat more responsive and easier to use.",
    "purpose": "Enhances the chat experience for players, making it more user-friendly."
  },
  "FFlagAXDisableCategoryPillsOnCatalogSearch": {
    "mechanism": "Removes category filters from the catalog search interface.",
    "purpose": "Simplifies the search process for players looking for items."
  },
  "DFFlagEnableContextForGenerateList": {
    "mechanism": "Enables context-aware generation of lists in the system.",
    "purpose": "Improves the accuracy and relevance of generated lists for players."
  },
  "DFFlagBacktraceAPIQueryParamFix": {
    "mechanism": "Fixes issues with query parameters in API backtracing.",
    "purpose": "Enhances the reliability of data retrieval for better gameplay experiences."
  },
  "FFlagVoiceAddWebrtClosedTransitionEnabled": {
    "mechanism": "Implements a smoother transition for WebRTC voice features.",
    "purpose": "Provides players with a more seamless voice chat experience."
  },
  "FFlagLuaAppAddSortDataToPymkCarouselClicks": {
    "mechanism": "Adds sorting functionality to the data for 'People You May Know' carousel clicks.",
    "purpose": "Helps players find and connect with friends more easily."
  },
  "FFlagAXFixBuyActionBarNotAppearing2": {
    "mechanism": "Fixes the issue where the buy action bar does not show up.",
    "purpose": "Ensures players can easily access purchase options when needed."
  },
  "FFlagAppChatIllustrationsUpdate": {
    "mechanism": "Updates chat to include illustrations or images.",
    "purpose": "Enhances chat experience by allowing users to share visuals."
  },
  "FFlagEnableCVSUrlForOtaPatch": {
    "mechanism": "Enables a specific URL for over-the-air updates.",
    "purpose": "Improves the update process for smoother game performance."
  },
  "FFlagCoreComponentManagerEmitAssetDMKeyTelemetry": {
    "mechanism": "Tracks and reports data related to asset management.",
    "purpose": "Helps developers understand asset usage better for optimization."
  },
  "DFFlagISRDoNotCrashCanSkipNewInstanceCheckIfPropNull": {
    "mechanism": "Prevents crashes by skipping checks when certain properties are null.",
    "purpose": "Increases game stability and reduces unexpected shutdowns."
  },
  "DFFlagWriteFlagCacheAfterDynamicFetch_Staged": {
    "mechanism": "Caches flags after they are dynamically fetched.",
    "purpose": "Improves performance by reducing the need to repeatedly fetch data."
  },
  "FFlagAXQuickButtonsFrameShouldAlwaysExist": {
    "mechanism": "Ensures the quick buttons frame is always present in the user interface.",
    "purpose": "Players can always access quick action buttons without them disappearing."
  },
  "FFlagAXCategoryPillInstantFadeOut": {
    "mechanism": "Changes the visual effect of category pills to fade out immediately.",
    "purpose": "Players experience a smoother and quicker transition when categories are removed."
  },
  "FFlagOnlyVisibleFramesAllowModal": {
    "mechanism": "Restricts modal dialogs to only appear on visible frames.",
    "purpose": "Players won't see modal dialogs on frames that aren't currently visible, improving usability."
  },
  "FFlagUseClientSettingAPI_IXP": {
    "mechanism": "Implements a new API for managing client settings more efficiently.",
    "purpose": "Players benefit from improved performance and more personalized settings."
  },
  "FFlagLuauVectorLerp_Staged": {
    "mechanism": "Introduces a staged approach to vector interpolation in the Luau scripting language.",
    "purpose": "Players enjoy smoother animations and movements in games due to better handling of vector changes."
  },
  "FFlagFCDecrementVertexCount_Staged": {
    "mechanism": "N/A (invalid)",
    "purpose": "N/A (invalid)"
  },
  "FFlagAXCategoryPillPadding": {
    "mechanism": "N/A (invalid)",
    "purpose": "N/A (invalid)"
  },
  "FFlagVoiceChatClientRewrite_OneFlagToRuleThemAll_Client2_Staged": {
    "mechanism": "N/A (invalid)",
    "purpose": "N/A (invalid)"
  },
  "DFStringAllowedPublicFlags": {
    "mechanism": "N/A (invalid)",
    "purpose": "N/A (invalid)"
  },
  "DFIntProductIdProductInfoCacheLifetimeSeconds_PlaceFilter": {
    "mechanism": "N/A (invalid)",
    "purpose": "N/A (invalid)"
  },
  "FFlagLrMainMetrics_Staged": {
    "mechanism": "Enables tracking of main metrics for performance analysis.",
    "purpose": "Helps improve game performance by analyzing key metrics."
  },
  "DFFlagEnableGenerateRecommendationItemListFromRcc2": {
    "mechanism": "Activates a system to create personalized item recommendations.",
    "purpose": "Provides players with tailored suggestions for items they might like."
  },
  "FFlagStudioTasksFutureShareMutexes_Staged": {
    "mechanism": "Implements a locking system for sharing tasks in development.",
    "purpose": "Enhances collaboration by preventing conflicts when multiple developers work together."
  },
  "DFFlagEnableGenerateRecommendationItemListFromRcc2_Staged": {
    "mechanism": "Further refines the item recommendation system for better accuracy.",
    "purpose": "Improves the relevance of item suggestions for players."
  },
  "AndroidAddActivityManagerMemoryClassifications": {
    "mechanism": "N/A (invalid)",
    "purpose": "N/A (invalid)"
  },
  "FFlagEngineVoiceChatClientRewriteIxpEnabled_IXP": {
    "mechanism": "Updates the voice chat client to improve performance and reliability.",
    "purpose": "Enhances the voice chat experience for players, making it clearer and more stable."
  },
  "FFlagCreateConnectionInternalEarlierServer": {
    "mechanism": "Establishes server connections more efficiently during game startup.",
    "purpose": "Reduces waiting time for players when joining games, leading to faster gameplay access."
  },
  "FFlagDisableGalleryStopGap": {
    "mechanism": "Removes temporary measures in the gallery feature to streamline functionality.",
    "purpose": "Improves the overall user experience in the gallery, making it easier to browse and find content."
  },
  "DFFlagEnableGameJoinChatTimeoutEvent": {
    "mechanism": "Introduces a timeout event for chat when joining games, allowing for better handling of chat connectivity.",
    "purpose": "Ensures players have a smoother chat experience when entering games, reducing issues with delayed messages."
  },
  "DFFlagLoadTestingEnabled3_PlaceFilter": {
    "mechanism": "Implements a filtering system for places during load testing to optimize performance.",
    "purpose": "Helps developers test their games more effectively, leading to better game quality for players."
  },
  "FFlagCapturesAddSavePromptVideoLog": {
    "mechanism": "Adds a video log when saving captures.",
    "purpose": "Helps players by providing a record of their captures for easier troubleshooting."
  },
  "FFlagStudioActionsMultiplePayloads": {
    "mechanism": "Allows multiple actions to be processed at once in the studio.",
    "purpose": "Improves efficiency for developers by speeding up their workflow."
  },
  "DFStringLoadTestName_PlaceFilter": {
    "mechanism": "Filters places based on a test name during loading.",
    "purpose": "Enhances the loading process by allowing players to find specific places more easily."
  },
  "FFlagRefactorIsTopBarFocused": {
    "mechanism": "Changes how the top bar focus is managed in the interface.",
    "purpose": "Improves user experience by making navigation more intuitive."
  },
  "FFlagStudioUseUIThread_Staged": {
    "mechanism": "Switches to using the UI thread for certain studio operations.",
    "purpose": "Enhances performance and responsiveness in the studio for developers."
  },
  "FFlagEngineVoiceSdpCompressionIxpEnabled_IXP": {
    "mechanism": "Enables compression for voice data during transmission.",
    "purpose": "Improves voice chat quality and reduces lag for players."
  },
  "FFlagLuaAppFixSearchTextBoxWidth": {
    "mechanism": "Adjusts the width of the search text box in the app.",
    "purpose": "Makes it easier for players to see and enter search queries."
  },
  "FFlagFixBlurryImages": {
    "mechanism": "Enhances image rendering to prevent blurriness.",
    "purpose": "Provides clearer and sharper images for a better visual experience."
  },
  "DFFlagISRBlockStaleCFrameImprovements": {
    "mechanism": "Improves handling of outdated position data in scripts.",
    "purpose": "Ensures smoother gameplay by reducing glitches related to object positioning."
  },
  "FFlagShowSocialContextToastToAll": {
    "mechanism": "Displays social notifications to all players in a game.",
    "purpose": "Keeps players informed about social interactions, enhancing community engagement."
  },
  "FFlagIncreaseEffectiveLightGridRadius": {
    "mechanism": "Increases the area where light affects objects in the game.",
    "purpose": "Improves lighting effects, making environments look more realistic."
  },
  "FFlagShowSocialContextToastToAll_Staged": {
    "mechanism": "Displays notifications about social interactions to all players.",
    "purpose": "Keeps players informed about their friends' activities in real-time."
  },
  "FFlagReCacheIconsOnThemeChange": {
    "mechanism": "Updates and refreshes icons when the game's theme changes.",
    "purpose": "Ensures that icons match the current visual style, enhancing the user experience."
  },
  "FFlagAXMIgrateItemDetailsModalToAutofocus": {
    "mechanism": "Automatically focuses on the item details when opened.",
    "purpose": "Makes it easier for players to interact with item details without extra clicks."
  },
  "FFlagBuyActionBarShouldNotUnrenderInFullscreenMode": {
    "mechanism": "Keeps the buy action bar visible even in fullscreen mode.",
    "purpose": "Allows players to make purchases without losing access to the action bar while playing."
  },
  "FFlagLrMainMetrics": {
    "mechanism": "Enables tracking of player engagement metrics for better analytics.",
    "purpose": "Helps improve game experiences by understanding how players interact with the platform."
  },
  "FFlagProfilePlatformEnableClickToCopyUsername": {
    "mechanism": "Adds a feature to easily copy usernames with a click.",
    "purpose": "Makes it simpler for players to share their usernames with friends."
  },
  "DFFlagVoiceSdpCompressionRemoteEventFieldReceivesUnexpectedValue_Staged": {
    "mechanism": "Addresses issues with voice communication data handling.",
    "purpose": "Improves the reliability of voice chat for smoother communication between players."
  },
  "FFlagAddSwitchTabHintsToIEM2": {
    "mechanism": "Introduces hints for switching between tabs in the interface.",
    "purpose": "Enhances user experience by guiding players on how to navigate the interface more effectively."
  },
  "FFlagFixIsrDeferredPropResize": {
    "mechanism": "Corrects resizing issues with certain interface elements.",
    "purpose": "Ensures that game elements display correctly, improving overall visual quality for players."
  },
  "FFlagDisableEtcFallback": {
    "mechanism": "Disables a fallback mechanism for certain features.",
    "purpose": "Improves performance by ensuring only the best features are used."
  },
  "FFlagProfilePlatformEnableChipSocialRow_v6_IXP": {
    "mechanism": "Enables a new social feature in player profiles.",
    "purpose": "Allows players to see and connect with friends more easily."
  },
  "FFlagLuauTypeCheckerVectorLerp": {
    "mechanism": "Enhances the type-checking for vector interpolation in scripts.",
    "purpose": "Helps developers write better code, leading to smoother gameplay experiences."
  },
  "FFlagExtendLightRangeTo120HideRolloutPropertyAndEnable": {
    "mechanism": "Increases the range of light sources in the game.",
    "purpose": "Enhances visual quality by allowing for better lighting effects."
  },
  "FFlagPassTextAlignmentRelevancyInfo_Staged": {
    "mechanism": "Improves how text alignment information is processed.",
    "purpose": "Ensures text displays correctly, enhancing readability for players."
  },
  "FFlagVideoEncoderScopedOutputBuffer_Staged": {
    "mechanism": "Improves video encoding by using a more efficient output buffer.",
    "purpose": "Enhances video quality and performance during gameplay recordings."
  },
  "FFlagNetworkInterface": {
    "mechanism": "Introduces a new network communication method for better data handling.",
    "purpose": "Provides a smoother online experience with reduced lag and improved connectivity."
  },
  "DFFlagSolverV2CleanupPendingModelStreamingModeModels": {
    "mechanism": "Cleans up unused models in the streaming process to optimize performance.",
    "purpose": "Reduces loading times and improves game performance by managing resources better."
  },
  "FFlagEnableSocialSelfProfileViewExposureEvents": {
    "mechanism": "Tracks when players view their own profiles for analytics.",
    "purpose": "Helps developers understand player engagement with profiles, leading to better social features."
  },
  "FFlagLuauNoConstraintGenRecursionLimitIce": {
    "mechanism": "Removes limits on recursion in the Luau scripting language for constraints.",
    "purpose": "Allows developers to create more complex and flexible scripts without hitting limits."
  },
  "DFIntDataStoreFixedRequestLimit_PlaceFilter": {
    "mechanism": "Adjusts the request limit for data stores based on specific places.",
    "purpose": "Improves data management for games by allowing more efficient data retrieval."
  },
  "FFlagSlimServiceEnableUploadsInNonEditMode": {
    "mechanism": "Allows users to upload assets even when not in editing mode.",
    "purpose": "Enables players to share their creations more easily without needing to be in edit mode."
  },
  "FFlagUITextureRendererUseNewRenderPath_Staged": {
    "mechanism": "Implements a new method for rendering textures in the user interface.",
    "purpose": "Enhances the visual quality and performance of UI elements for a better player experience."
  },
  "FFlagInternalExportHandleMisnamedR15Bones": {
    "mechanism": "Fixes issues with incorrectly named bones in R15 character models during export.",
    "purpose": "Ensures smoother character animations and compatibility for developers using R15 models."
  },
  "FFlagAXUseDefaultFocusHandlerInFocusedWidgetTopContent": {
    "mechanism": "Utilizes a standard method for managing focus in top-level content of widgets.",
    "purpose": "Improves navigation and accessibility for players using widgets in the game."
  },
  "FFlagLuaAppShowAgeRatingWithPlayButtonOnTileHoverWithHiddenMetadata": {
    "mechanism": "Displays age rating and play button when hovering over a game tile in the Lua app.",
    "purpose": "Helps players quickly see the age rating of a game before deciding to play."
  },
  "FFlagEnableAdOpportunityTracker4_PlaceFilter": {
    "mechanism": "Implements a tracking system for ad opportunities filtered by game places.",
    "purpose": "Allows developers to better understand ad performance and optimize their games for revenue."
  },
  "FStringTutorialUpsellPlaceId": {
    "mechanism": "Links a specific place ID to a tutorial upsell feature.",
    "purpose": "Encourages new players to explore additional content or features through tutorials."
  },
  "DFFlagEditableMeshFastClusterSkipLoD": {
    "mechanism": "Improves performance by skipping Level of Detail (LoD) calculations for editable meshes.",
    "purpose": "Enhances game performance and rendering speed for developers using editable meshes."
  },
  "FStringEngineVoiceSdpCompressionIxpLayer_Staged": {
    "mechanism": "Applies compression settings for voice data in the engine's communication layer.",
    "purpose": "Improves voice chat quality and reduces data usage for players during in-game communication."
  },
  "FFlagAXOutlineSubcategoryPill": {
    "mechanism": "Adds a visual outline to subcategory pills in the UI.",
    "purpose": "Improves navigation by making subcategories more distinct and easier to identify."
  },
  "DFFlagEnableCancelTouchesOnGameViewControllerDisappear": {
    "mechanism": "Allows touch inputs to be canceled when the game view is closed.",
    "purpose": "Prevents unintended actions when players close the game view, enhancing user experience."
  },
  "FFlagChatIntegrationFixShortcut": {
    "mechanism": "Fixes a shortcut key for chat integration.",
    "purpose": "Ensures players can easily access chat features without issues."
  },
  "FFlagRemoveLeaveShortcutFromLeaveConfirm": {
    "mechanism": "Removes the shortcut option to leave during the confirmation dialog.",
    "purpose": "Reduces accidental game exits by requiring players to confirm their choice more deliberately."
  },
  "DFIntVoiceChatHttpErrorsTelemetryThrottleHundredthsPercent": {
    "mechanism": "Limits the frequency of telemetry data sent for voice chat HTTP errors.",
    "purpose": "Improves performance by reducing the amount of error data sent, ensuring smoother gameplay."
  },
  "FFlagAXAddStyleToItemCardPriceLine": {
    "mechanism": "Adds a new style to the price display on item cards.",
    "purpose": "Makes item prices more visually appealing and easier to read."
  },
  "DFIntJoinLimitWin32x64_Staged": {
    "mechanism": "Increases the maximum number of players that can join a game on Windows 64-bit.",
    "purpose": "Allows more players to join a game at the same time, enhancing multiplayer experiences."
  },
  "FFlagFallbackGenericAbuseReporting": {
    "mechanism": "Implements a fallback system for reporting abuse in games.",
    "purpose": "Improves the ability to report inappropriate behavior, making the platform safer."
  },
  "FFlagFCDecrementVertexCount": {
    "mechanism": "Reduces the number of vertices in 3D models during rendering.",
    "purpose": "Improves game performance by making it run smoother on various devices."
  },
  "DFFlagISRAdjustMtu": {
    "mechanism": "Adjusts the maximum transmission unit (MTU) for network connections.",
    "purpose": "Enhances network performance, leading to a better online gaming experience."
  },
  "DFStringAllowedPublicFlags_Staged": {
    "mechanism": "Allows certain string flags to be used in public settings.",
    "purpose": "Enables developers to create more customizable and flexible game features."
  },
  "FFlagLuaAppEdpBackendV2HydrateLegacyIxp4": {
    "mechanism": "Updates the backend system for Lua applications to improve data handling.",
    "purpose": "Enhances the performance and reliability of games using Lua scripts."
  },
  "FFlagFixLockCenterMouseClickAndScroll": {
    "mechanism": "Fixes issues with mouse click and scroll locking in the game interface.",
    "purpose": "Improves player control and navigation within the game."
  },
  "DFFlagInferredCrashReportToBacktraceRegister": {
    "mechanism": "Integrates crash reporting with a backtrace system for better error tracking.",
    "purpose": "Helps developers quickly identify and fix game crashes, leading to a smoother experience."
  },
  "DFIntTextChatCommandClientSentThrottlePermyriad": {
    "mechanism": "Limits the rate at which chat commands can be sent by players.",
    "purpose": "Prevents spam and ensures a cleaner chat experience for all players."
  },
  "FFlagFixTexturePackLoadingRetries_Staged": {
    "mechanism": "Improves the retry logic for loading texture packs.",
    "purpose": "Ensures texture packs load more reliably, enhancing visual quality."
  },
  "DFFlagISRPerfPass": {
    "mechanism": "Optimizes the performance of the in-game rendering system.",
    "purpose": "Provides smoother gameplay and better graphics performance."
  },
  "FFlagLuauNoConstraintGenRecursionLimitIce_Staged": {
    "mechanism": "Removes limits on recursive function calls in the Luau scripting language.",
    "purpose": "Allows developers to create more complex scripts without hitting limits."
  },
  "DFFlagWriteTombstoneAfterDynamicFetch_Staged": {
    "mechanism": "Writes error logs after fetching dynamic data.",
    "purpose": "Helps developers diagnose issues more effectively, leading to better game stability."
  },
  "FFlagAXCategoryPillAnimationsUserMotionSettings": {
    "mechanism": "Enables animations for UI elements based on user movement settings.",
    "purpose": "Creates a more dynamic and engaging user interface experience."
  },
  "FFlagMediaPlaybackStopsWhenJoiningExperience": {
    "mechanism": "Stops any media playback when a player joins a game.",
    "purpose": "Prevents audio or video from playing unexpectedly when entering a new experience."
  },
  "FFlagVoiceChatClientRewrite_OneFlagToRuleThemAll_Client2_IXP": {
    "mechanism": "Implements a comprehensive update to the voice chat system for better performance.",
    "purpose": "Improves the overall voice chat experience for players, making it more reliable and efficient."
  },
  "FFlagRemoveUpdatePromptChild": {
    "mechanism": "Removes the child prompt that asks players to update the client.",
    "purpose": "Reduces interruptions for players by not prompting them to update while in-game."
  },
  "DFFlagVoiceChatSendHttpErrorsTelemetry_Staged": {
    "mechanism": "Collects data on HTTP errors related to voice chat for analysis.",
    "purpose": "Helps developers identify and fix voice chat issues, improving the service for players."
  },
  "DFFlagEnableUpdateClientFeatureTimeoutListener2": {
    "mechanism": "Adds a timeout listener for client updates to manage delays.",
    "purpose": "Ensures players are informed if an update takes too long, enhancing user experience."
  },
  "FFlagProfilePlatformEnableEditAvatar_IXP": {
    "mechanism": "Allows users to edit their avatars directly on the profile page.",
    "purpose": "Players can customize their avatars more easily without navigating away from their profile."
  },
  "DFFlagLoadTestingEnabled3": {
    "mechanism": "Enables testing of new features in a controlled environment.",
    "purpose": "Players may experience improved features and performance as new updates are tested."
  },
  "FFlagRemoveUpdatePromptChild_Staged": {
    "mechanism": "Removes the prompt that asks children to update the game.",
    "purpose": "Reduces interruptions for younger players, allowing for a smoother gaming experience."
  },
  "FFlagEnableProfilePlatformDualCta_v5_Staged": {
    "mechanism": "Introduces two call-to-action buttons on the profile page.",
    "purpose": "Players have more options to engage with profiles, enhancing social interactions."
  },
  "FFlagAppChatFixPaddingWhenScaling_Staged": {
    "mechanism": "Adjusts the chat interface padding when the app is resized.",
    "purpose": "Improves the chat display for players, making conversations easier to read and manage."
  },
  "DFStringFlipTimeStampDynamicString": {
    "mechanism": "Changes how timestamps are formatted in dynamic strings.",
    "purpose": "Improves the readability of time-related information for players."
  },
  "DFFlagVoiceSdpCompressionSendSizeTelemetry_Staged": {
    "mechanism": "Tracks the size of voice data being sent for compression.",
    "purpose": "Enhances voice chat quality by optimizing data usage."
  },
  "DFIntDataStoreOrderedSetFixedRequestLimit_PlaceFilter": {
    "mechanism": "Sets a limit on requests for data storage based on place filters.",
    "purpose": "Ensures smoother gameplay by managing data requests efficiently."
  },
  "FFlagAXSendLegacyWidgetImpressions": {
    "mechanism": "Sends data about widget interactions in a legacy format.",
    "purpose": "Helps developers understand how players interact with widgets."
  },
  "FFlagSongbirdPopoverSubmenu2": {
    "mechanism": "Introduces a new submenu in the Songbird interface.",
    "purpose": "Provides players with easier access to additional features and settings."
  },
  "FFlagFixTexturePackLoadingRetries": {
    "mechanism": "Improves the retry logic for loading texture packs when they fail initially.",
    "purpose": "Ensures players can successfully load their texture packs without repeated failures."
  },
  "FFlagAXAddOverlayFocusHandlerToPurchaseLookPrompt": {
    "mechanism": "Adds a focus handler to the overlay that appears during purchase prompts.",
    "purpose": "Enhances user experience by making it easier to navigate purchase options."
  },
  "FFlagEnableCVSUrlForOtaPatch_Staged": {
    "mechanism": "Enables the use of a specific URL for downloading over-the-air patches.",
    "purpose": "Allows players to receive updates more efficiently and reliably."
  },
  "FFlagISREarlyFilterAnimatedJoints": {
    "mechanism": "Implements an early filtering system for animated joints in the game.",
    "purpose": "Improves performance and visual quality of animations for players."
  },
  "FIntOcclusionSolverInitialMaxSearchIterations": {
    "mechanism": "Sets a limit on the number of iterations the occlusion solver can perform initially.",
    "purpose": "Optimizes game performance by balancing visual fidelity and processing time."
  },
  "FFlagAXCategoryPillScrollToStart_Staged": {
    "mechanism": "Adjusts the scroll position of category pills to start at the beginning.",
    "purpose": "Improves navigation by ensuring players see the first category immediately."
  },
  "FFlagNativeDialogManager_Staged": {
    "mechanism": "Introduces a new system for managing dialog boxes natively within the platform.",
    "purpose": "Enhances user experience by making dialog interactions smoother and more consistent."
  },
  "FFlagNewBindToMessageError": {
    "mechanism": "Implements a new method for handling errors when binding to messages.",
    "purpose": "Provides clearer error messages to players, helping them understand issues better."
  },
  "FFlagMigrateEmptyResultsViewToFoundation": {
    "mechanism": "Migrates the display of empty results to a new foundational framework.",
    "purpose": "Offers a cleaner and more modern look when no results are found, improving aesthetics."
  },
  "FFlagReconnectToSameServer_Staged": {
    "mechanism": "Allows players to reconnect to the same game server after disconnection.",
    "purpose": "Reduces frustration by letting players continue their game without losing progress."
  },
  "FFlagLuauTypeCheckerVectorLerp_Staged": {
    "mechanism": "Enhances the type-checking system for vector lerp functions in Luau.",
    "purpose": "Improves script reliability by catching errors earlier, making it easier for developers to create smooth animations."
  },
  "FFlagNativeDialogManager": {
    "mechanism": "Introduces a new system for managing dialog boxes natively within Roblox.",
    "purpose": "Provides a more consistent and user-friendly experience when interacting with pop-up dialogs in games."
  },
  "FFlagPerformanceTelemetryHandleSpuriousWake": {
    "mechanism": "Optimizes how the system handles unnecessary wake-up calls for performance monitoring.",
    "purpose": "Enhances game performance by reducing lag and improving responsiveness during gameplay."
  },
  "FFlagAXCategoryPillColorAnimationInstantOff": {
    "mechanism": "Allows instant removal of color animations on category pills in the UI.",
    "purpose": "Makes the user interface feel more dynamic and responsive, improving the overall experience for players."
  },
  "FFlagAXMigrateCenteredModalViewToAutoFocus": {
    "mechanism": "Shifts the handling of centered modal views to automatically focus on the main content.",
    "purpose": "Streamlines user interactions by ensuring players can easily access important information without extra clicks."
  },
  "FFlagLuaAppSupportEmptyStringFooterMetadata": {
    "mechanism": "Enables support for empty string metadata in Lua applications.",
    "purpose": "Allows developers to create apps that can handle empty metadata without errors."
  },
  "FIntServerTriggeredModalTrafficPercent_Staged": {
    "mechanism": "Controls the percentage of users who see server-triggered modals.",
    "purpose": "Helps test new modal features with a small group of players before a wider release."
  },
  "FFlagRemoveiOS13DeprecatedCode_Staged": {
    "mechanism": "Removes outdated code that is no longer needed for iOS 13 compatibility.",
    "purpose": "Improves app performance and stability on newer iOS versions."
  },
  "DFStringLoadTestingUniverseId_PlaceFilter": {
    "mechanism": "Filters load testing data based on specific universe IDs.",
    "purpose": "Allows developers to analyze performance metrics for particular games more effectively."
  },
  "FFlagAXSavePreviousPageFromQuickMenu": {
    "mechanism": "Enables saving the last visited page in the quick menu.",
    "purpose": "Makes it easier for players to return to their previous location in the menu."
  },
  "FFlagDisableRejoinGroupIdDoubleRead": {
    "mechanism": "Prevents the system from checking the group ID twice when a player rejoins a game.",
    "purpose": "Reduces unnecessary delays and improves the speed of rejoining games."
  },
  "FFlagFixKeyboardFocusInfiniteLoop_Staged": {
    "mechanism": "Addresses a bug that caused the keyboard focus to get stuck in a loop.",
    "purpose": "Ensures smoother keyboard interactions and prevents players from being unable to type."
  },
  "DFIntISRInstanceBlockTimeoutWorldSteps": {
    "mechanism": "Sets a timeout for how long the system waits for certain actions to complete in the game world.",
    "purpose": "Helps maintain game performance by preventing long delays that could disrupt gameplay."
  },
  "FFlagEnableSpatialUIScalingFix": {
    "mechanism": "Adjusts the scaling of user interface elements based on the player's camera perspective.",
    "purpose": "Improves the visibility and usability of UI elements, making them easier to interact with."
  },
  "FFlagFixDisplaySizeVR2_Staged": {
    "mechanism": "Corrects the display size settings for virtual reality experiences.",
    "purpose": "Enhances the visual experience in VR, making it more comfortable and immersive for players."
  },
  "FFlagVideoGamePreviewSessionTracking_Staged": {
    "mechanism": "Tracks player sessions during video game previews for analysis.",
    "purpose": "Improves the experience by understanding player engagement in previews."
  },
  "FFlagAXCatalogCategoryPillsIXP_Staged": {
    "mechanism": "Introduces new UI elements for catalog categories.",
    "purpose": "Enhances navigation and discovery of items in the catalog."
  },
  "DFFlagVoiceSdpCompressionSendProtoParseErrorTelemetry": {
    "mechanism": "Collects data on errors related to voice communication protocols.",
    "purpose": "Helps improve voice chat reliability by identifying and fixing issues."
  },
  "DFIntTextChatCommandClientSentThrottlePermyriad_Staged": {
    "mechanism": "Limits the rate of chat commands sent by players.",
    "purpose": "Prevents spam and ensures a smoother chat experience."
  },
  "FFlagLuauCompileVectorLerp_Staged": {
    "mechanism": "Optimizes the compilation of vector interpolation functions.",
    "purpose": "Enhances performance for developers using vector math in games."
  },
  "FStringFlagRepoGitHashFastString": {
    "mechanism": "Stores a fast string reference to the Git hash for version control.",
    "purpose": "Improves performance by quickly identifying the current version of the code."
  },
  "FFlagFixToggleMenuIconForTheFive_Staged": {
    "mechanism": "Corrects the icon display in the toggle menu for a specific feature.",
    "purpose": "Enhances user experience by ensuring the correct icons are shown, making navigation easier."
  },
  "FFlagCommunicationsFixLastInputMode": {
    "mechanism": "Addresses issues with how the last input mode is tracked during gameplay.",
    "purpose": "Ensures smoother gameplay by accurately remembering the player's last control method."
  },
  "FStringLuaOTATag_Staged": {
    "mechanism": "Tags the Lua scripts for Over-The-Air updates.",
    "purpose": "Facilitates easier updates to scripts, providing players with the latest features and fixes."
  },
  "FFlagVoiceChatEnableSdpCompressionMaster3_IXP": {
    "mechanism": "Enables compression for voice chat data to reduce bandwidth usage.",
    "purpose": "Improves voice chat quality and reduces lag, making communication clearer and more reliable."
  },
  "FFlagFixKeyboardFocusInfiniteLoop": {
    "mechanism": "Fixes a bug where keyboard focus could get stuck in a loop, preventing input.",
    "purpose": "Ensures players can type and interact without issues."
  },
  "FFlagUKOSALegacyReportMenu": {
    "mechanism": "Reverts to an older version of the report menu for users in the UK.",
    "purpose": "Provides a familiar and reliable reporting experience for UK players."
  },
  "FFlagEnableClientSettingAPIInProduction_IXP": {
    "mechanism": "Activates a new API for client settings in the live game environment.",
    "purpose": "Allows players to customize their game settings more easily."
  },
  "FFlagFixEmoteWarningSize_Staged": {
    "mechanism": "Adjusts the size of warnings related to emotes to be more appropriate.",
    "purpose": "Improves the visibility and clarity of emote warnings for players."
  },
  "DFFlagAndroidOomScoreTelemetry": {
    "mechanism": "Collects data on out-of-memory issues specifically for Android devices.",
    "purpose": "Helps improve game performance and stability for Android players."
  },
  "DFFlagEnableCancelTouchesOnGameViewControllerDisappear_Staged": {
    "mechanism": "Allows touch events to be canceled when the game view controller is closed.",
    "purpose": "Prevents unintended actions when players exit the game view."
  },
  "FixIsolatedGmaSdkCleanDisconnect": {
    "mechanism": "N/A (invalid)",
    "purpose": "N/A (invalid)"
  },
  "FFlagAddFriendsEmptyStateUpdate": {
    "mechanism": "Updates the interface when there are no friends to display.",
    "purpose": "Provides a clearer message to players about their friend list status."
  },
  "DFFlagWriteTombstoneAfterDynamicFetch": {
    "mechanism": "Records a 'tombstone' after fetching dynamic data to ensure proper data handling.",
    "purpose": "Enhances data reliability and prevents issues with missing information."
  },
  "FFlagAXUnifiedLoggingValidation1_Staged": {
    "mechanism": "Implements a unified logging system for better tracking and validation.",
    "purpose": "Improves error tracking and helps developers fix issues faster, leading to a smoother gameplay experience."
  },
  "FFlagIsrMainMetrics_Staged": {
    "mechanism": "Enables a new system for tracking player interactions and game performance metrics.",
    "purpose": "Improves game analytics to help developers create better experiences for players."
  }
}