{
  "DFFlagClientScriptTimeout_Staged": {
    "mechanism": "Sets a limit on how long client scripts can run before being stopped.",
    "purpose": "Improves game performance by preventing scripts from running too long and causing lag."
  },
  "DFFlagUseModelInsteadOfItsParent_Staged": {
    "mechanism": "Changes how models are referenced in the game, using the model itself instead of its parent object.",
    "purpose": "Enhances the flexibility of game development by allowing easier manipulation of models."
  },
  "DFFlagEnableContentTypeInRegister": {
    "mechanism": "Allows developers to specify content types when registering new assets.",
    "purpose": "Helps developers organize and manage their assets better, improving the overall game experience."
  },
  "FFlagLuauIndividualRecursionLimits_Staged": {
    "mechanism": "Implements specific limits on how many times functions can call themselves in scripts.",
    "purpose": "Prevents scripts from crashing due to excessive recursion, ensuring smoother gameplay."
  },
  "FFlagExplorerFilterActionContext_Staged": {
    "mechanism": "Adds a filtering option in the Explorer tool for better organization of game objects.",
    "purpose": "Makes it easier for developers to find and manage objects in their game, streamlining the development process."
  },
  "FFlagPluginGuiPointerEvents_Staged": {
    "mechanism": "Enables pointer event handling for plugin GUIs in a staged environment.",
    "purpose": "Improves interaction with plugin interfaces, making them more responsive to user actions."
  },
  "FFlagAvatarGenerationFailedEvents_Staged": {
    "mechanism": "Tracks and reports failures in avatar generation processes.",
    "purpose": "Helps developers identify and fix issues with avatar creation, enhancing player experience."
  },
  "FFlagVoiceGenerateAndRunOperationsScopedTelemetryEnabled_Staged": {
    "mechanism": "Enables detailed tracking of voice generation and operation processes.",
    "purpose": "Provides insights into voice features, improving reliability and performance for players."
  },
  "DFFlagNoCallstackAppendTarget": {
    "mechanism": "Disables appending target information to call stacks in error reporting.",
    "purpose": "Simplifies error messages, making it easier for developers to debug issues without extra data."
  },
  "FFlagComponentManagerAddSupportStopSubtree2": {
    "mechanism": "Enhances the component manager to better handle stopping subtrees of components.",
    "purpose": "Improves performance and resource management in games, leading to smoother gameplay for players."
  },
  "FFlagAXAvatarTileNoDefaultOutfitInfo": {
    "mechanism": "Removes default outfit information from avatar tiles in the UI.",
    "purpose": "Provides a cleaner look by not showing default outfits, making it easier for players to see custom avatars."
  },
  "FFlagRemoveGcInterval_Staged": {
    "mechanism": "Adjusts the garbage collection interval for better memory management.",
    "purpose": "Improves game performance by reducing lag and ensuring smoother gameplay."
  },
  "FFlagCapturesCloseGalleryTooltipWhenCarouselOpen_Staged": {
    "mechanism": "Allows tooltips to remain visible even when the image carousel is open.",
    "purpose": "Enhances user experience by providing consistent information while browsing images."
  },
  "FFlagPlayerFeedbackPromptEnabled": {
    "mechanism": "Enables prompts for players to give feedback during gameplay.",
    "purpose": "Encourages players to share their thoughts, helping developers improve the game."
  },
  "DFFlagUseModelInsteadOfItsParent": {
    "mechanism": "Changes the rendering process to use the model directly instead of its parent object.",
    "purpose": "Improves visual fidelity and performance by optimizing how models are displayed in the game."
  },
  "FFlagWebBrowserWinExecuteJavaScriptNullGuard_Staged": {
    "mechanism": "Adds a safety check to prevent errors when executing JavaScript in the web browser.",
    "purpose": "Improves stability and prevents crashes when using web features in Roblox."
  },
  "FFlagStreamJobRefactorSetCollection": {
    "mechanism": "Refactors how streaming jobs are organized and managed in the system.",
    "purpose": "Enhances performance and efficiency of content loading for players."
  },
  "FFlagHelpPageMountVR3_IXP": {
    "mechanism": "Updates the help page to support new VR features and improvements.",
    "purpose": "Provides better guidance and support for players using virtual reality."
  },
  "FFlagNewMemoryTarget_Staged": {
    "mechanism": "Implements a new method for managing memory usage in the game.",
    "purpose": "Optimizes game performance and reduces lag for players."
  },
  "DFFlagPMDHeaderGeomTypeReading": {
    "mechanism": "Changes how geometry types are read in the game engine.",
    "purpose": "Improves the accuracy and efficiency of rendering game objects."
  },
  "DFFlagDCDReadLegacyWithDecoder": {
    "mechanism": "Allows the system to read older data formats using a specific decoder.",
    "purpose": "Ensures compatibility with older game data for a smoother experience."
  },
  "FFlagAvatarGenerationFailedEvents": {
    "mechanism": "Triggers events when avatar generation fails.",
    "purpose": "Helps developers identify and fix issues with avatar creation."
  },
  "FFlagEnableBacktraceMetricKitReporter3": {
    "mechanism": "Enables a tool to collect detailed error reports.",
    "purpose": "Improves game stability by helping developers track down bugs."
  },
  "FFlagTopBarSignalizeScreenSize2_IXP": {
    "mechanism": "Adjusts the top bar based on the screen size.",
    "purpose": "Enhances user interface for better visibility on different devices."
  },
  "FFlagLuaAppHandleMouseCursor2_Staged": {
    "mechanism": "Improves how the game handles mouse cursor interactions.",
    "purpose": "Provides a more responsive and accurate cursor experience for players."
  },
  "FFlagDeprecateExperienceInterventionNamespace_Staged": {
    "mechanism": "Removes an old system for handling game interventions.",
    "purpose": "Improves game performance by streamlining how interventions are managed."
  },
  "FFlagPlayerFeedbackPromptEnabled_Staged": {
    "mechanism": "Enables a new feature that asks players for feedback after gameplay.",
    "purpose": "Allows players to share their thoughts, helping improve games based on user experience."
  },
  "FFlagSquadStartedCardBgFixEnabled_Staged": {
    "mechanism": "Fixes background issues on the squad started card display.",
    "purpose": "Enhances visual clarity and aesthetics for players when viewing squad information."
  },
  "FFlagSettingsPageScaleTextSize": {
    "mechanism": "Adjusts the text size on the settings page for better readability.",
    "purpose": "Makes it easier for players to read and navigate settings."
  },
  "FFlagLuaAppLayoutParamsInContext_Staged": {
    "mechanism": "Improves how layout parameters are handled in Lua applications.",
    "purpose": "Provides developers with better tools for creating user-friendly game interfaces."
  },
  "DFFlagCLI171730AddSizeCheck": {
    "mechanism": "Adds a size check to ensure data fits within limits.",
    "purpose": "Prevents errors by ensuring that data sent is the correct size."
  },
  "DFFlagVoiceChatSendHttpErrorsTelemetry2_Staged": {
    "mechanism": "Tracks and sends data about HTTP errors related to voice chat.",
    "purpose": "Helps improve voice chat reliability by monitoring issues."
  },
  "FFlagExpChatUseUpdatedMessageRendered": {
    "mechanism": "Uses a new method for displaying chat messages.",
    "purpose": "Enhances the chat experience with better message rendering."
  },
  "FFlagPropertiesMixStylingAndPackageDefaultsCorrectly": {
    "mechanism": "Fixes how styles and default settings are combined in properties.",
    "purpose": "Ensures that visual elements look correct and consistent."
  },
  "FFlagNativePurchaseRobuxPageWrapperEnableTelemetry_Staged": {
    "mechanism": "Enables tracking for the Robux purchase page.",
    "purpose": "Improves the purchasing process by monitoring user interactions."
  },
  "FFlagLuaAppHandleMouseCursor2": {
    "mechanism": "Improves how the Lua application manages mouse cursor visibility and behavior.",
    "purpose": "Provides a smoother and more responsive mouse cursor experience for players."
  },
  "DFFlagDCDReadLegacyWithDecoder_Staged": {
    "mechanism": "Allows the system to read older data formats using a new decoder.",
    "purpose": "Ensures compatibility with legacy data, allowing players to access older game content."
  },
  "DFIntClientScriptTimeoutValueMsec": {
    "mechanism": "Sets a time limit for how long client scripts can run before being stopped.",
    "purpose": "Prevents scripts from running indefinitely, improving game performance and stability for players."
  },
  "FFlagCustomizedLandingLaunchGame_Staged": {
    "mechanism": "Enables personalized landing pages for games when launched.",
    "purpose": "Enhances the first impression of games by providing tailored experiences for players."
  },
  "FFlagEnableNapIxpLayerExposure_IXP": {
    "mechanism": "Exposes a new layer of features related to the Nap Ixp system.",
    "purpose": "Introduces new functionalities that improve player interactions and experiences within games."
  },
  "FFlagMakeupUVBoundsStretchAfterCrop": {
    "mechanism": "Adjusts texture coordinates after cropping to ensure proper display.",
    "purpose": "Improves the appearance of makeup textures on characters."
  },
  "FFlagAXAddInventoryItemsListProps_IXP": {
    "mechanism": "Adds new properties to inventory item lists for better data handling.",
    "purpose": "Enhances the inventory experience by providing more detailed item information."
  },
  "FFlagRbxStorageSkipPermOrphanedFiles": {
    "mechanism": "Bypasses permission checks for files that are no longer linked to any user.",
    "purpose": "Optimizes storage management by removing unnecessary files, improving performance."
  },
  "FStringIxpNewLayersForRegistration": {
    "mechanism": "Introduces new layers in the registration process for handling user data.",
    "purpose": "Streamlines user registration, making it easier and faster for new players."
  },
  "FIntVideoCaptureMaxShortSide_IXP": {
    "mechanism": "Sets a limit on the shortest side of video captures for consistency.",
    "purpose": "Ensures video captures maintain a standard quality and aspect ratio for players."
  },
  "DFFlagSupportNetworkValueFormatRandom2": {
    "mechanism": "Enables a new format for handling network values in the game.",
    "purpose": "Improves the reliability and performance of networked game features."
  },
  "DFFlagEnableContentTypeInRegister_Staged": {
    "mechanism": "Allows content types to be registered in a new system.",
    "purpose": "Enhances the organization and accessibility of different content types for developers."
  },
  "FFlagSquadStartedCardBgFixEnabled": {
    "mechanism": "Fixes the background display issue on the squad started card.",
    "purpose": "Provides a better visual experience for players when viewing squad information."
  },
  "FFlagReactSchedulingAddPlaySessionId": {
    "mechanism": "Integrates play session IDs into the scheduling system.",
    "purpose": "Improves tracking and management of player sessions for a smoother gameplay experience."
  },
  "FFlagAXMigrateItemDetailsPeekViewToAutoFocus": {
    "mechanism": "Changes the item details view to automatically focus on the selected item.",
    "purpose": "Makes it easier for players to view and interact with item details quickly."
  },
  "FFlagToolboxWebViewTutorial4": {
    "mechanism": "Enables a new tutorial interface in the toolbox using web technologies.",
    "purpose": "Helps players learn how to use the toolbox more effectively."
  },
  "FFlagAEGetEditableOutfitsType": {
    "mechanism": "Allows access to a new type of editable outfits in the avatar editor.",
    "purpose": "Gives players more customization options for their avatars."
  },
  "FFlagEnableMultipartForMeshImage_Staged": {
    "mechanism": "Activates support for multipart images in mesh assets.",
    "purpose": "Improves the visual quality of meshes by allowing more detailed textures."
  },
  "FFlagCASButtonsOnWindowsTouch_Staged": {
    "mechanism": "Enables touch-friendly buttons for the character customization screen on Windows devices.",
    "purpose": "Makes it easier for players using touch screens to customize their avatars."
  },
  "FFlagToolboxRetryReloadFailures3": {
    "mechanism": "Implements a retry mechanism for loading toolbox assets that fail to load initially.",
    "purpose": "Reduces frustration by automatically attempting to reload toolbox items that didn't load the first time."
  },
  "FFlagUseNewCorrelateProfilerDataFunction_Staged": {
    "mechanism": "Enables a new function for collecting performance data.",
    "purpose": "Improves game performance tracking for developers."
  },
  "FFlagAXMigrateAXFocusBehaviorRoot_Staged": {
    "mechanism": "Changes how focus behavior is managed in the user interface.",
    "purpose": "Enhances navigation and accessibility for players."
  },
  "FIntVideoCaptureMaxLongSideLowMem_IXP": {
    "mechanism": "Sets a limit on the maximum size for video captures in low memory mode.",
    "purpose": "Allows smoother video recording without using too much memory."
  },
  "FFlagAXGeneralizeInventoryItemsList_IXP": {
    "mechanism": "Standardizes how inventory items are listed and accessed.",
    "purpose": "Makes it easier for players to manage and find their items."
  },
  "FStringHelpPageIxpLayer_Staged": {
    "mechanism": "Introduces a new layer for help pages in the interface.",
    "purpose": "Provides clearer and more accessible help resources for players."
  },
  "DFIntReverbCameraPushForwardStudsHundredths": {
    "mechanism": "Adjusts the camera position based on reverb effects in the environment.",
    "purpose": "Enhances the immersive experience by making the camera feel more realistic in echoing spaces."
  },
  "FFlagDisableNpotException_Staged": {
    "mechanism": "Prevents errors related to non-power-of-two textures from disrupting gameplay.",
    "purpose": "Improves game stability and performance by reducing crashes or issues with certain graphics."
  },
  "DFIntJoinLimitWin32x64": {
    "mechanism": "Sets a limit on the number of players that can join a game on 64-bit Windows systems.",
    "purpose": "Ensures smoother gameplay by managing server load and preventing overcrowding."
  },
  "FFlagToolboxWebViewTutorial4_Staged": {
    "mechanism": "Introduces a new tutorial in the Toolbox that uses a web view interface.",
    "purpose": "Helps users learn how to use the Toolbox more effectively with interactive guidance."
  },
  "DFFlagParseDepartureIntentAsEnum_Staged": {
    "mechanism": "Interprets departure intents in a standardized way using enumerations.",
    "purpose": "Streamlines communication between game components, improving functionality and reducing errors."
  },
  "DFFlagNoCallstackAppendTarget_Staged": {
    "mechanism": "Disables appending target information to call stacks for error reporting.",
    "purpose": "Improves error handling by simplifying the information provided when issues occur."
  },
  "FFlagLuaAppScrollableDesktopCarousels2_Staged": {
    "mechanism": "Introduces a new design for scrolling carousels in the Lua app on desktop.",
    "purpose": "Enhances user experience by allowing smoother navigation through items in a carousel format."
  },
  "FFlagStreamJobRefactorSetCollection_PlaceFilter": {
    "mechanism": "Refactors how job streaming handles collections with a specific filter for places.",
    "purpose": "Optimizes performance when loading places, making it faster and more efficient for players."
  },
  "DFFlagAddTranslationDisplayMode_PlaceFilter": {
    "mechanism": "Adds a new display mode for translations in the place filter.",
    "purpose": "Allows players to view content in their preferred language, improving accessibility."
  },
  "DFFlagProcessStatisticsMemoryFix_Staged": {
    "mechanism": "Addresses memory usage issues in the process statistics tracking.",
    "purpose": "Reduces memory consumption, leading to better performance and stability for players."
  },
  "FFlagAXFixFlashingNoItemsFound": {
    "mechanism": "Fixes a visual glitch that causes flashing when no items are found.",
    "purpose": "Provides a smoother and more pleasant user experience when searching for items."
  },
  "FFlagAddFriendsUserTileRefactor": {
    "mechanism": "Updates the way user tiles are displayed for adding friends.",
    "purpose": "Makes it easier for players to find and add friends on the platform."
  },
  "FIntVideoCaptureMaxLongSideLowMem_Staged": {
    "mechanism": "Sets a limit on the maximum length of the longer side of video captures in low memory mode.",
    "purpose": "Improves performance and reduces lag when recording videos on devices with limited memory."
  },
  "FFlagFoundationPopoverContentToggleOnAnchorClick": {
    "mechanism": "Changes how popover content is displayed when clicking on an anchor element.",
    "purpose": "Enhances user interaction by making popover content more accessible and responsive."
  },
  "FFlagAXMigrateTryOnItemScreenToAutofocus": {
    "mechanism": "Automatically focuses on the item being tried on in the try-on screen.",
    "purpose": "Streamlines the process of trying on items, making it faster and more intuitive for players."
  },
  "FFlagFlagRolloutTestStaticBool16_Staged": {
    "mechanism": "Enables a specific feature toggle for testing purposes.",
    "purpose": "Allows developers to test new features without affecting all players."
  },
  "DFIntClientScriptTimeoutValueMsec_Staged": {
    "mechanism": "Sets a timeout value for client scripts to prevent them from running indefinitely.",
    "purpose": "Improves game performance by ensuring scripts do not hang and cause lag."
  },
  "FFlagPluginGuiPointerEvents": {
    "mechanism": "Enables pointer events for GUI elements in plugins.",
    "purpose": "Enhances the interactivity of plugins, making them more user-friendly."
  },
  "FFlagAXIncreaseDefaultPeekViewHeight_IXP": {
    "mechanism": "Increases the default height of the peek view in the user interface.",
    "purpose": "Provides a better view of content, improving user experience."
  },
  "DFFlagSimGeometryDeterministicSampling_Staged": {
    "mechanism": "Changes how geometry is sampled in simulations to be more consistent.",
    "purpose": "Ensures that simulations behave predictably, leading to fairer gameplay."
  },
  "FFlagDifferentiateSharingBaseOnPlatform": {
    "mechanism": "Changes how sharing features work based on the player's platform (e.g., mobile, PC).",
    "purpose": "Ensures players have a tailored sharing experience depending on the device they are using."
  },
  "DFFlagMicroProfilerMemoryTrackingAlert": {
    "mechanism": "Enables alerts for memory usage issues in the game's micro-profiler tool.",
    "purpose": "Helps developers identify and fix memory problems, leading to smoother gameplay."
  },
  "DFFlagSupportNetworkValueFormatRandom2_Staged": {
    "mechanism": "Implements a new format for handling network values in a staged rollout.",
    "purpose": "Improves how data is transmitted over the network, enhancing game performance and reliability."
  },
  "FFlagLuaAppLayoutParamsInContext": {
    "mechanism": "Allows layout parameters for Lua applications to be set within their context.",
    "purpose": "Gives developers more control over how their apps look and behave, improving user experience."
  },
  "FFlagStudioDumpWindowHierarchyToLog": {
    "mechanism": "Logs the hierarchy of windows in the development studio for debugging.",
    "purpose": "Assists developers in troubleshooting issues with the studio interface, making it easier to fix problems."
  },
  "FIntVideoCaptureMaxLongSideLowMem": {
    "mechanism": "Limits the maximum size of video captures to reduce memory usage.",
    "purpose": "Allows players to capture videos without using too much device memory."
  },
  "FFlagFixXboxActiveGamepadMismatch": {
    "mechanism": "Corrects issues where the wrong gamepad is recognized on Xbox.",
    "purpose": "Ensures players can use their intended gamepad without problems."
  },
  "FFlagCustomizedLandingLaunchGame": {
    "mechanism": "Enables customized landing pages for games when launched.",
    "purpose": "Provides a unique and tailored experience for players when entering a game."
  },
  "FFlagTopBarSignalizeMenuOpen_IXP": {
    "mechanism": "Adds visual indicators on the top bar when menus are open.",
    "purpose": "Helps players easily see when menus are active, improving navigation."
  },
  "FFlagRemoveStaleChildConnections": {
    "mechanism": "Cleans up outdated connections between game objects.",
    "purpose": "Improves game performance and stability by reducing unnecessary connections."
  },
  "FIntVideoCaptureMaxShortSideLowMem_Staged": {
    "mechanism": "Sets a limit on the shortest side of video captures to save memory.",
    "purpose": "Allows players to record videos without using too much device memory."
  },
  "DFFlagCLI172177_Staged": {
    "mechanism": "Enables a specific command-line interface feature for developers.",
    "purpose": "Improves tools for developers, enhancing the overall game creation experience."
  },
  "FFlagEnableTelemetryIntegrationCheck": {
    "mechanism": "Activates checks for telemetry data integration.",
    "purpose": "Helps ensure that performance data is accurately collected for better game optimization."
  },
  "DFFlagCLI171730AddSizeCheck_Staged": {
    "mechanism": "Adds a size validation check in the command-line interface.",
    "purpose": "Prevents errors by ensuring that uploaded assets meet size requirements."
  },
  "FStringFlagRepoGitHashFastString": {
    "mechanism": "Stores a fast-access string representing the current version of the code repository.",
    "purpose": "Allows for quick identification of the code version, aiding in updates and fixes."
  },
  "FFlagLuaAppUpdateCollectionHeader2_Staged": {
    "mechanism": "Updates the header display in the Lua app for better organization.",
    "purpose": "Improves user experience by making it easier to find and navigate collections."
  },
  "FFlagEnableNotApprovedPageV2_IXP": {
    "mechanism": "Introduces a new version of the page shown for unapproved content.",
    "purpose": "Provides clearer information to players about why their content is not approved."
  },
  "FFlagVoiceForceRunOnLeave_Staged": {
    "mechanism": "Ensures voice chat continues to function even when a player leaves a game.",
    "purpose": "Allows players to maintain communication with friends even after leaving a game."
  },
  "FStringFlipTimeStampFastString": {
    "mechanism": "Optimizes how timestamps are formatted and displayed in strings.",
    "purpose": "Enhances performance and speed of displaying time-related information."
  },
  "FIntVideoCaptureMaxShortSide_Staged": {
    "mechanism": "Sets a limit on the shortest side of video captures for consistency.",
    "purpose": "Ensures better quality and uniformity in video recordings for players."
  },
  "FFlagDisableMemoryTrackingRollout2_Staged": {
    "mechanism": "Disables a feature that tracks memory usage in the game.",
    "purpose": "Improves performance by reducing overhead from memory tracking."
  },
  "FFlagMakeupUVBoundsStretchAfterCrop_Staged": {
    "mechanism": "Adjusts how textures are applied to characters after cropping.",
    "purpose": "Ensures character makeup looks better and fits properly after adjustments."
  },
  "FFlagNetworkSchemaVersionServerBit": {
    "mechanism": "Updates the way network data is structured for server communication.",
    "purpose": "Enhances game stability and performance during online play."
  },
  "FIntVideoCaptureMaxShortSideLowMem_IXP": {
    "mechanism": "Sets a limit on the resolution for video capture to save memory.",
    "purpose": "Allows players with less memory to capture videos without crashing."
  },
  "FFlagLuauResumeFix": {
    "mechanism": "Fixes issues with the Luau scripting language when resuming scripts.",
    "purpose": "Ensures smoother gameplay and fewer errors in scripts during play."
  },
  "FFlagAXRootSlotBasedEditorFlag5": {
    "mechanism": "Enables a new editing interface that uses slots for organizing elements.",
    "purpose": "Makes it easier for developers to manage and arrange their game components."
  },
  "FFlagEnableBackgroundSignatureVerification_Staged": {
    "mechanism": "Implements a system to verify digital signatures in the background.",
    "purpose": "Enhances security by ensuring that assets are authentic without interrupting gameplay."
  },
  "FStringHelpPageIxpLayer": {
    "mechanism": "Introduces a new layer for help pages that can display additional information.",
    "purpose": "Provides players with better access to helpful resources and guides within the game."
  },
  "DFIntConvexDecompCompressionSelector_Staged": {
    "mechanism": "Selects a method for compressing complex shapes in the game.",
    "purpose": "Improves game performance by optimizing how shapes are processed and rendered."
  },
  "FFlagTexturePackGeneratorFix": {
    "mechanism": "Fixes issues in the tool that generates texture packs for games.",
    "purpose": "Ensures that developers can create and use texture packs without errors, enhancing visual quality."
  },
  "FIntVideoCaptureMaxShortSide": {
    "mechanism": "Sets the maximum length for the shorter side of video captures.",
    "purpose": "Allows players to capture videos in better resolutions suited for their devices."
  },
  "FFlagDifferentiateSharingBaseOnPlatform_Staged": {
    "mechanism": "Changes how sharing features work based on the platform used.",
    "purpose": "Improves the sharing experience for players depending on whether they are on mobile, PC, or console."
  },
  "DFIntPhoto2AvatarErrorEventsThrottleHundredthsPercent": {
    "mechanism": "Limits how often avatar photo errors are reported.",
    "purpose": "Reduces spam from error notifications, making it smoother for players to upload their avatars."
  },
  "FFlagRenderParticlesSimulateNonVisible6_Staged": {
    "mechanism": "Enables rendering of particle effects even when they are not visible.",
    "purpose": "Enhances visual effects in the game, making it more immersive for players."
  },
  "FFlagAEGetEditableOutfitsType_Staged": {
    "mechanism": "Introduces new types of outfits that can be edited.",
    "purpose": "Gives players more customization options for their avatars, enhancing personalization."
  },
  "DFLogBootcampCLI167628Log": {
    "mechanism": "Logs specific data from the Bootcamp CLI for analysis.",
    "purpose": "Helps improve the Bootcamp experience by tracking issues."
  },
  "FFlagAXGeneralizeInventoryItemsList": {
    "mechanism": "Updates how inventory items are displayed and accessed.",
    "purpose": "Makes it easier for players to find and manage their items."
  },
  "FFlagUsernameValidatorSelectorPaddingFix_Staged": {
    "mechanism": "Adjusts the layout of the username validation interface.",
    "purpose": "Improves the visual appearance and usability of username selection."
  },
  "FFlagAXPeekViewContentShouldNotBeSelectable_Staged": {
    "mechanism": "Prevents selection of content in the Peek View interface.",
    "purpose": "Enhances user experience by avoiding accidental selections."
  },
  "DFFlagLuauCodeGenDisableWithNoReentry": {
    "mechanism": "Disables code generation in Luau when reentry conditions are not met.",
    "purpose": "Ensures smoother performance and reduces errors in scripting."
  },
  "DFFlagDeserializeMetadataCLI171425": {
    "mechanism": "Changes how metadata is read and processed in the command line interface.",
    "purpose": "Improves the accuracy and efficiency of metadata handling for developers."
  },
  "FFlagDisableImageHash": {
    "mechanism": "Turns off the feature that uses hashes to identify images.",
    "purpose": "Reduces issues with image loading and improves performance for players."
  },
  "FFlagPropertiesMixStylingAndPackageDefaultsCorrectly_Staged": {
    "mechanism": "Fixes how styles and default settings are combined in properties.",
    "purpose": "Ensures a more consistent and visually appealing experience for players."
  },
  "FFlagAXEnableInitialTopLevelPageCounter_Staged": {
    "mechanism": "Enables a counter for tracking page views at the top level.",
    "purpose": "Helps developers understand user engagement on their pages."
  },
  "FFlagEnableBacktraceMetricKitReporter3_Staged": {
    "mechanism": "Activates a tool for reporting errors and performance metrics.",
    "purpose": "Enhances the ability to diagnose issues, leading to a smoother gameplay experience."
  },
  "FFlagSTM6798Enabled_Staged": {
    "mechanism": "Enables a new system for managing game state more efficiently.",
    "purpose": "Improves game performance and responsiveness for players."
  },
  "DFFlagLuauCodeGenDisableWithNoReentry_Staged": {
    "mechanism": "Prevents code generation from running again if it has already been processed.",
    "purpose": "Reduces errors and improves stability in scripts for developers."
  },
  "FFlagAXPrefetchMarketplaceIXP2_Staged": {
    "mechanism": "Caches marketplace data in advance to reduce loading times.",
    "purpose": "Speeds up access to items and experiences in the marketplace for players."
  },
  "FFlagAXRootSlotBasedEditorFlag5_IXP": {
    "mechanism": "Introduces a new way to organize and manage components in the editor.",
    "purpose": "Makes it easier for developers to create and modify games, enhancing player experiences."
  },
  "DFFlagSimGeometryDeterministicSampling": {
    "mechanism": "Ensures consistent results in simulations by using fixed sampling methods.",
    "purpose": "Provides a more reliable and predictable gameplay experience for players."
  },
  "DFFlagPMDHeaderGeomTypeReading_Staged": {
    "mechanism": "Enables reading of geometry type from PMD headers.",
    "purpose": "Improves the accuracy of 3D models in games."
  },
  "FFlagReactSchedulingAddPlaySessionId_Staged": {
    "mechanism": "Adds a unique session ID to play sessions for better tracking.",
    "purpose": "Enhances game performance and user experience by optimizing session management."
  },
  "FFlagTexturePackGeneratorFix_Staged": {
    "mechanism": "Fixes issues in the texture pack generation process.",
    "purpose": "Ensures that custom textures load correctly, improving visual quality."
  },
  "FFlagLuauAutocompleteAttributes_Staged": {
    "mechanism": "Improves the autocomplete feature for Luau programming attributes.",
    "purpose": "Makes coding easier and faster for developers by suggesting attributes."
  },
  "FFlagRemoveStaleChildConnections_Staged": {
    "mechanism": "Cleans up outdated connections in the game’s object hierarchy.",
    "purpose": "Reduces lag and improves game performance by managing connections more efficiently."
  },
  "FFlagNewMemoryTarget": {
    "mechanism": "Adjusts the memory allocation strategy for better performance.",
    "purpose": "Improves game performance and reduces lag for players."
  },
  "FFlagStatusFileMutex": {
    "mechanism": "Implements a locking mechanism for status files to prevent conflicts.",
    "purpose": "Ensures smoother operation and stability during game updates."
  },
  "FFlagFixSliceCenterWarningOnNegativeSize": {
    "mechanism": "Fixes an issue where warnings appear incorrectly for negative sizes in UI elements.",
    "purpose": "Reduces confusion for developers and improves UI consistency for players."
  },
  "FFlagCASButtonsOnWindowsTouch": {
    "mechanism": "Enables touch support for buttons in the Create-A-Style feature on Windows devices.",
    "purpose": "Enhances usability for players using touch screens on Windows devices."
  },
  "FFlagUsernameValidatorSelectorPaddingFix": {
    "mechanism": "Corrects the padding in the username validation selector interface.",
    "purpose": "Improves the visual layout and user experience when selecting usernames."
  },
  "FFlagTopBarSignalizeSetCores_IXP": {
    "mechanism": "Enables a visual indicator on the top bar for certain actions.",
    "purpose": "Helps players easily identify when specific features or settings are active."
  },
  "FIntVideoCaptureMaxLongSide": {
    "mechanism": "Sets a maximum length for the longer side of video captures.",
    "purpose": "Ensures video recordings maintain a consistent quality and size."
  },
  "FFlagLightOcclusionCull2": {
    "mechanism": "Improves how light interacts with objects to reduce rendering load.",
    "purpose": "Enhances game performance by making scenes render faster and smoother."
  },
  "FIntVideoCaptureMaxShortSideLowMem": {
    "mechanism": "Limits the shorter side of video captures for devices with low memory.",
    "purpose": "Allows players with less powerful devices to still record videos without crashing."
  },
  "FFlagFoundationDialogActionsUpdate": {
    "mechanism": "Updates the actions available in dialog boxes within the game.",
    "purpose": "Provides players with more intuitive and responsive options when interacting with dialogs."
  },
  "DFStringFlagRepoGitHashDynamicString": {
    "mechanism": "Stores a dynamic string related to the repository's Git hash.",
    "purpose": "Helps developers track changes and versions of the game more efficiently."
  },
  "DFIntBacktraceMetricKitUploadHundrethsPercent_Staged": {
    "mechanism": "Measures and uploads backtrace metrics as a percentage.",
    "purpose": "Improves error tracking and performance analysis for a smoother gaming experience."
  },
  "FFlagAXPrefetchMarketplaceIXP2": {
    "mechanism": "Preloads marketplace data in advance to reduce loading times.",
    "purpose": "Enhances user experience by making marketplace access faster and more seamless."
  },
  "DFIntVideoCaptureLowResOnLowMemThresholdMB_IXP": {
    "mechanism": "Sets a memory threshold for video capture resolution.",
    "purpose": "Ensures smoother gameplay on devices with limited memory by lowering video quality when needed."
  },
  "FFlagAddFriendsUserTileRefactor_Staged": {
    "mechanism": "Updates the way user tiles for friends are displayed.",
    "purpose": "Improves the visual layout and usability of the friends list for players."
  },
  "FFlagFriendsRoduxFixBlock": {
    "mechanism": "Fixes issues in the friends management system by updating the underlying data structure.",
    "purpose": "Improves the reliability of friend requests and notifications."
  },
  "DFFlagWriteFlagCacheAfterFlagFetch": {
    "mechanism": "Caches flag data after it is fetched to reduce future load times.",
    "purpose": "Makes the game run smoother by speeding up access to flag information."
  },
  "FFlagRenderParticlesSimulateNonVisible6": {
    "mechanism": "Enhances particle rendering to simulate effects even when not visible to the player.",
    "purpose": "Creates a more immersive experience by ensuring effects are consistent, even off-screen."
  },
  "DFFlagFixPrimitiveShapeInertiaMigration_Staged": {
    "mechanism": "Addresses issues with the physics of basic shapes during updates.",
    "purpose": "Ensures that basic shapes behave correctly in the game, improving gameplay physics."
  },
  "FFlagLuaAppUpdateCollectionHeader2": {
    "mechanism": "Updates the header of collections in the Lua application framework.",
    "purpose": "Enhances the organization and display of collections, making it easier for players to navigate."
  },
  "FFlagEnableBackgroundSignatureVerification": {
    "mechanism": "Enables verification of signatures in the background to enhance security.",
    "purpose": "Improves the safety of player accounts by ensuring only verified actions are processed."
  },
  "DFFlagFixPrimitiveShapeInertiaMigration": {
    "mechanism": "Addresses issues with how primitive shapes behave during physics simulations.",
    "purpose": "Provides a smoother and more realistic experience when interacting with shapes in games."
  },
  "DFFlagVoiceChatSendHttpErrorsTelemetry2": {
    "mechanism": "Collects data on HTTP errors related to voice chat functionality.",
    "purpose": "Helps developers identify and fix voice chat issues, improving communication for players."
  },
  "DFIntExpChatMessageClientRenderedThrottlePermyriad": {
    "mechanism": "Limits the rate at which chat messages are rendered on the client side.",
    "purpose": "Enhances performance by reducing lag when many messages are sent in quick succession."
  },
  "FFlagSTM6798Enabled": {
    "mechanism": "Activates a specific feature or improvement related to the game engine.",
    "purpose": "Brings new enhancements or fixes that improve gameplay and user experience."
  },
  "FFlagDisableMemoryTrackingRollout2": {
    "mechanism": "Disables a feature that tracks memory usage in the game engine.",
    "purpose": "Improves performance by reducing overhead from memory tracking."
  },
  "FFlagBootcampCLI167628": {
    "mechanism": "Enables a new command-line interface for bootcamp features.",
    "purpose": "Enhances the user experience for new players learning the platform."
  },
  "DFFlagCLI172177": {
    "mechanism": "Activates a specific command-line interface feature.",
    "purpose": "Provides developers with better tools for managing their games."
  },
  "FFlagVideoPlaybackManager2": {
    "mechanism": "Implements an updated system for managing video playback in games.",
    "purpose": "Ensures smoother and more reliable video experiences for players."
  },
  "DFFlagHttpCurlHttp2Enabled2": {
    "mechanism": "Enables HTTP/2 support for network requests.",
    "purpose": "Improves loading times and performance for online features in games."
  },
  "FFlagDeprecateExperienceInterventionNamespace": {
    "mechanism": "Removes an old system for managing experience interventions.",
    "purpose": "Streamlines the experience for players by eliminating outdated features."
  },
  "DFStringFlipTimeStampDynamicString": {
    "mechanism": "Changes how timestamps are formatted in dynamic strings.",
    "purpose": "Improves readability and clarity of time-related information for players."
  },
  "FFlagAXItemDetailsShouldNotHaveQuickMenuButton_Staged": {
    "mechanism": "Removes the quick menu button from item detail views.",
    "purpose": "Simplifies the interface for players, making it easier to focus on item details."
  },
  "FFlagLuaAppScrollableDesktopCarousels2": {
    "mechanism": "Enables scrollable carousels in the desktop version of the app.",
    "purpose": "Enhances user experience by allowing players to browse items more easily."
  },
  "DFIntBacktraceMetricKitUploadHundrethsPercent": {
    "mechanism": "Adjusts how performance metrics are uploaded for analysis.",
    "purpose": "Improves game stability and performance monitoring for a better player experience."
  },
  "FFlagVideoCaptureLowResOnLowMemDevices_IXP": {
    "mechanism": "Enables lower resolution video capture for devices with limited memory.",
    "purpose": "Allows players on low-end devices to record gameplay without crashing."
  },
  "DFFlagEnableLuaApiToRegisterEncryptedAssets_PlaceFilter": {
    "mechanism": "Allows Lua scripts to register assets that are encrypted for specific places.",
    "purpose": "Enhances security for game assets, ensuring only authorized players can access them."
  },
  "FFlagLuauResumeFix_Staged": {
    "mechanism": "Fixes issues with resuming scripts in the Luau programming language.",
    "purpose": "Improves script reliability, leading to smoother gameplay experiences."
  },
  "DFIntPhoto2AvatarErrorEventsThrottleHundredthsPercent_Staged": {
    "mechanism": "Limits the frequency of error events related to avatar photos.",
    "purpose": "Reduces spam from error messages, making it easier for players to manage their avatars."
  },
  "FFlagSettingsPageScaleTextSize_Staged": {
    "mechanism": "Adjusts the text size on the settings page based on screen scaling.",
    "purpose": "Improves readability for players, making settings easier to navigate."
  },
  "DFFlagVideoCoreScriptWithPlaybackManager_Staged": {
    "mechanism": "Enables a new script manager for video playback.",
    "purpose": "Improves video streaming performance and reliability in games."
  },
  "FFlagRefactorHelpPage5_IXP": {
    "mechanism": "Updates the help page structure for better navigation.",
    "purpose": "Makes it easier for players to find help and resources."
  },
  "FFlagUseGeneralizedFileCulling": {
    "mechanism": "Optimizes how files are loaded by removing unnecessary ones.",
    "purpose": "Reduces loading times and improves game performance."
  },
  "DFFlagReportInstanceMemoryToES_Staged": {
    "mechanism": "Tracks memory usage of game instances for analysis.",
    "purpose": "Helps developers optimize games by understanding memory usage."
  },
  "FFlagLightOcclusionCull2_Staged": {
    "mechanism": "Enhances the system that hides objects not visible to the player.",
    "purpose": "Improves game performance by reducing the number of rendered objects."
  },
  "FFlagAXAddInventoryItemsListProps": {
    "mechanism": "Adds new properties to inventory item lists for better data handling.",
    "purpose": "Improves how players can view and manage their inventory items."
  },
  "DFFlagEarlyReturnScrollingDisabled2": {
    "mechanism": "Disables a specific scrolling feature to optimize performance.",
    "purpose": "Enhances the overall experience by making scrolling smoother for players."
  },
  "DFFlagProcessStatisticsMemoryFix": {
    "mechanism": "Fixes memory usage issues in processing game statistics.",
    "purpose": "Reduces lag and improves game stability for players."
  },
  "FIntVideoCaptureMaxLongSide_Staged": {
    "mechanism": "Sets a limit on the maximum length of the video capture's longer side.",
    "purpose": "Ensures better quality and performance for video captures made by players."
  },
  "DFFlagWriteFlagCacheAfterFlagFetch_Staged": {
    "mechanism": "Updates how flag data is stored after being accessed.",
    "purpose": "Improves the efficiency of flag management, leading to faster game performance for players."
  },
  "DFIntConvexDecompCompressionSelector": {
    "mechanism": "Selects a method for compressing convex shapes in the game engine.",
    "purpose": "Improves performance and reduces file sizes for better game loading times."
  },
  "FFlagAXEnableInitialTopLevelPageCounter": {
    "mechanism": "Activates a counter that tracks visits to the main page of the game.",
    "purpose": "Helps developers understand player engagement on their game's main page."
  },
  "FFlagNativePurchaseRobuxPageWrapperEnableTelemetry": {
    "mechanism": "Enables tracking of data related to Robux purchases on the platform.",
    "purpose": "Provides insights into purchasing behavior to improve the buying experience."
  },
  "FFlagFixCdsduiRFYGridItemsPerRowLogic_Staged": {
    "mechanism": "Corrects the layout logic for displaying items in a grid format.",
    "purpose": "Ensures items are displayed correctly, enhancing user interface and experience."
  },
  "DFFlagReportInstanceMemoryToES": {
    "mechanism": "Sends memory usage data of game instances to the server for analysis.",
    "purpose": "Helps developers optimize their games by understanding memory usage patterns."
  },
  "FFlagTopBarSignalizeHealthBar3_IXP": {
    "mechanism": "Enhances the top bar to visually indicate health changes.",
    "purpose": "Players can easily see their health status at a glance."
  },
  "DFFlagMicroProfilerMemoryTrackingAlert_Staged": {
    "mechanism": "Implements alerts for memory tracking in performance profiling.",
    "purpose": "Helps developers identify memory issues to improve game performance."
  },
  "FFlagFriendsRoduxFixBlock_Staged": {
    "mechanism": "Fixes issues in the friends system using a state management tool.",
    "purpose": "Improves the reliability of friend interactions in the game."
  },
  "FFlagWebBrowserWinExecuteJavaScriptNullGuard": {
    "mechanism": "Adds a safeguard to prevent errors when executing JavaScript in web browsers.",
    "purpose": "Ensures smoother web interactions without crashes or errors."
  },
  "DFIntReverbCameraPushForwardStudsHundredths_Staged": {
    "mechanism": "Adjusts the camera position based on sound reverb settings.",
    "purpose": "Enhances the immersive experience by aligning visuals with audio effects."
  },
  "FFlagDisableNpotException": {
    "mechanism": "Disables a specific error handling for non-power-of-two textures.",
    "purpose": "Reduces crashes or issues related to texture loading, improving game stability."
  },
  "FFlagAXFixFlashingNoItemsFound_Staged": {
    "mechanism": "Fixes a visual glitch that causes flashing when no items are found in a search.",
    "purpose": "Enhances user experience by providing a smoother and clearer interface during searches."
  },
  "DFIntPerfDataGlobalThrottleHundredthsPercent_Staged": {
    "mechanism": "Adjusts performance data collection rates to optimize server load.",
    "purpose": "Improves game performance by ensuring smoother gameplay and reduced lag."
  },
  "FFlagFixCdsduiRFYGridItemsPerRowLogic": {
    "mechanism": "Corrects the logic that determines how many items are displayed per row in a grid.",
    "purpose": "Ensures better organization and visibility of items, making it easier for players to browse."
  },
  "FFlagCapturesCloseGalleryTooltipWhenCarouselOpen": {
    "mechanism": "Allows tooltips to remain visible even when a carousel is open.",
    "purpose": "Improves accessibility by providing helpful information without interrupting the carousel experience."
  },
  "FIntHelpPageThrottleHundredthsPercent_IXP": {
    "mechanism": "Limits the frequency of help page requests to reduce server load.",
    "purpose": "Improves the performance and responsiveness of help pages for players."
  },
  "FFlagAddAccountLinkingAlertAnalytics": {
    "mechanism": "Tracks user interactions with account linking alerts.",
    "purpose": "Helps improve the account linking process by understanding player behavior."
  },
  "FFlagStudioDumpWindowHierarchyToLog_Staged": {
    "mechanism": "Logs the hierarchy of windows in the development studio for debugging.",
    "purpose": "Aids developers in troubleshooting issues within the studio environment."
  },
  "FFlagPropertyDescriptorsToArray3": {
    "mechanism": "Changes how property descriptors are structured in code.",
    "purpose": "Enhances the efficiency of property management for developers."
  },
  "FFlagEnableTelemetryIntegrationCheck_Staged": {
    "mechanism": "Checks the integration of telemetry systems for data collection.",
    "purpose": "Improves data accuracy and insights for better player experiences."
  },
  "FFlagStreamJobRefactorSetCollection_Staged": {
    "mechanism": "Updates how job collections are managed in streaming.",
    "purpose": "Improves performance and stability during game streaming."
  },
  "DFFlagVideoCoreScriptWithPlaybackManager": {
    "mechanism": "Introduces a new script manager for video playback.",
    "purpose": "Enhances video playback experience in games."
  },
  "FFlagTopBarSignalizeKeepOutAreas5_IXP": {
    "mechanism": "Adds visual signals to indicate restricted areas on the top bar.",
    "purpose": "Helps players avoid entering areas they shouldn't."
  },
  "FStringIxpNewLayersForRegistration_Staged": {
    "mechanism": "Implements new layers for user registration processes.",
    "purpose": "Streamlines the registration experience for new players."
  },
  "FFlagAXItemDetailsShouldNotHaveQuickMenuButton": {
    "mechanism": "Removes the quick menu button from item detail views.",
    "purpose": "Simplifies the item detail interface for better usability."
  },
  "FFlagToolboxRetryReloadFailures3_Staged": {
    "mechanism": "Retries loading toolbox assets if the first attempt fails.",
    "purpose": "Ensures players can access and use toolbox items more reliably."
  },
  "FFlagStatusFileMutex_Staged": {
    "mechanism": "Implements a locking system to manage file access.",
    "purpose": "Improves stability and prevents errors when accessing game files."
  },
  "FFlagLuauResumeFix_PlaceFilter": {
    "mechanism": "Fixes issues with filtering places in the Luau scripting language.",
    "purpose": "Enhances the experience of finding and using places in games."
  },
  "FFlagVoiceForceRunOnLeave": {
    "mechanism": "Forces voice chat to continue running even when a player leaves a game.",
    "purpose": "Allows players to maintain voice communication with friends after leaving."
  },
  "DFIntExpChatMessageClientRenderedThrottlePermyriad_Staged": {
    "mechanism": "Limits the rate at which chat messages are rendered on the client side.",
    "purpose": "Reduces lag and improves performance during busy chat sessions."
  },
  "FFlagAXMigrateTryOnItemScreenToAutofocus_Staged": {
    "mechanism": "Switches the item try-on screen to automatically focus on the item being tried on.",
    "purpose": "Makes it easier for players to see and interact with items they want to try on."
  },
  "DFFlagClientScriptTimeout": {
    "mechanism": "Implements a timeout for client scripts to prevent them from running indefinitely.",
    "purpose": "Improves game performance and stability by stopping scripts that take too long to execute."
  },
  "FFlagLuauAutocompleteAttributes": {
    "mechanism": "Enhances the code editor to provide better suggestions for attributes in Luau scripts.",
    "purpose": "Helps developers write scripts faster and with fewer errors by suggesting relevant attributes."
  },
  "FFlagUseNewCorrelateProfilerDataFunction": {
    "mechanism": "Introduces a new function for collecting performance data more effectively.",
    "purpose": "Allows developers to better analyze game performance and optimize their games."
  },
  "FFlagAXMigrateItemDetailsPeekViewToAutoFocus_Staged": {
    "mechanism": "Changes the item details view to automatically focus on the item when opened.",
    "purpose": "Improves the user experience by making it easier for players to view and understand item details."
  },
  "FFlagCeaseUAPresenceRealtimeNotificationUpdatesInGameV2_IXP": {
    "mechanism": "Disables real-time updates for user presence notifications in-game.",
    "purpose": "Reduces unnecessary notifications, leading to a smoother gameplay experience."
  },
  "DFIntPerfDataGlobalThrottleHundredthsPercent": {
    "mechanism": "Adjusts the performance data collection rate based on a percentage throttle.",
    "purpose": "Improves game performance by limiting resource usage for data collection."
  },
  "FFlagLuauIndividualRecursionLimits": {
    "mechanism": "Imposes limits on how deep functions can call themselves in scripts.",
    "purpose": "Prevents scripts from running indefinitely, enhancing game stability."
  },
  "FFlagVideoHandleEarlyServiceShutdown": {
    "mechanism": "Improves how video services handle unexpected shutdowns.",
    "purpose": "Ensures a better user experience by managing video playback more reliably."
  },
  "FFlagEnableMultipartForMeshImage": {
    "mechanism": "Allows mesh images to be handled in multiple parts.",
    "purpose": "Enhances the visual quality and performance of mesh images in games."
  },
  "FIntVideoCaptureMaxLongSide_IXP": {
    "mechanism": "Sets a maximum size for the longer side of video captures.",
    "purpose": "Ensures that video captures do not exceed a certain resolution, improving performance and compatibility."
  },
  "FFlagFoundationDialogHeroImageOnlyFix": {
    "mechanism": "Fixes an issue where only the hero image was displayed in dialogs.",
    "purpose": "Enhances the appearance of dialogs by ensuring all intended content is visible."
  },
  "FFlagAXPeekViewContentShouldNotBeSelectable": {
    "mechanism": "Prevents content in peek views from being selected or interacted with.",
    "purpose": "Improves user experience by ensuring that peek views are for viewing only, not for interaction."
  },
  "FFlagRemoveGcInterval": {
    "mechanism": "Eliminates the regular interval for garbage collection in the game.",
    "purpose": "Reduces lag and improves performance by allowing more efficient memory management."
  },
  "FFlagFoundationDialogBodyUpdate": {
    "mechanism": "Updates the content structure of dialog bodies.",
    "purpose": "Improves the clarity and layout of information presented in dialogs for players."
  },
  "FFlagVoiceGenerateAndRunOperationsScopedTelemetryEnabled": {
    "mechanism": "Enables tracking of voice operations for better performance analysis.",
    "purpose": "Improves voice chat reliability and performance for players."
  },
  "FFlagExplorerFilterActionContext": {
    "mechanism": "Adds filtering options in the Explorer tool for easier navigation.",
    "purpose": "Helps developers find and manage game elements more efficiently."
  },
  "FFlagVideoHandleEarlyServiceShutdown_Staged": {
    "mechanism": "Implements a system to manage video playback during service interruptions.",
    "purpose": "Ensures smoother video experiences for players, even when services are unstable."
  },
  "DFFlagParseDepartureIntentAsEnum": {
    "mechanism": "Changes how player departure actions are categorized in the system.",
    "purpose": "Enhances game analytics by providing clearer data on why players leave."
  }
}