{
  "FFlagAXFixReactPerfExperimentCounter_Staged": {
    "mechanism": "Adjusts performance counters for React components in the game.",
    "purpose": "Improves the speed and responsiveness of user interfaces."
  },
  "FFlagCheckPillSelectedPressedState": {
    "mechanism": "Enhances the detection of selected states in UI elements.",
    "purpose": "Ensures that buttons and options work correctly when clicked."
  },
  "FFlagRemoteCommandServiceEnabled2_Staged": {
    "mechanism": "Activates a new system for handling remote commands between the server and clients.",
    "purpose": "Enables smoother communication, leading to fewer delays in gameplay actions."
  },
  "FFlagLuauSubtypingPrimitiveAndGenericTableTypes": {
    "mechanism": "Improves type-checking for tables in the Luau programming language.",
    "purpose": "Allows developers to write more flexible and error-free scripts."
  },
  "FFlagAXFixOrganicTTILogging": {
    "mechanism": "Fixes issues with logging for accessibility features.",
    "purpose": "Enhances the tracking of accessibility improvements for better user experience."
  },
  "FFlagUIBloxEnableFontScaling": {
    "mechanism": "Enables automatic adjustment of font sizes based on screen size.",
    "purpose": "Improves readability of text on different devices."
  },
  "FFlagPersonaLivenessFocusNavigation": {
    "mechanism": "Enhances navigation features for user profiles and avatars.",
    "purpose": "Makes it easier for players to find and interact with friends' profiles."
  },
  "FFlagRemoteCommandServiceEnabled2": {
    "mechanism": "Activates a new system for executing commands remotely in games.",
    "purpose": "Allows for more efficient game management and player interactions."
  },
  "FFlagPrecomputeDeformVertices4": {
    "mechanism": "Pre-calculates vertex positions for smoother animations.",
    "purpose": "Enhances the visual quality of character movements and animations."
  },
  "FFlagFoundationSupportCloudAssetsImage2_Staged": {
    "mechanism": "Supports the use of cloud-stored images in game assets.",
    "purpose": "Enables faster loading and better management of game images."
  },
  "FIntFAEWithCallbackPollMaxRetries_Staged": {
    "mechanism": "Limits the number of retries when polling for callbacks in the game.",
    "purpose": "Improves game performance by preventing excessive retries that could slow down gameplay."
  },
  "FFlagEnableBiometricChallenges": {
    "mechanism": "Enables the use of biometric authentication methods like fingerprint or facial recognition.",
    "purpose": "Enhances security for players by allowing them to log in more easily and securely."
  },
  "FFlagFixLeaderboardCleanup": {
    "mechanism": "Addresses issues with how leaderboards are cleaned up and updated.",
    "purpose": "Ensures that leaderboard data is accurate and up-to-date, providing a better competitive experience."
  },
  "FFlagLuaAppActiveFriendIconEmphasisBorder": {
    "mechanism": "Adds a visual border around active friends' icons in the app.",
    "purpose": "Makes it easier for players to identify and connect with their active friends."
  },
  "FFlagUseNewHapticServiceInUA3_Staged": {
    "mechanism": "Implements a new service for haptic feedback in user actions.",
    "purpose": "Enhances the immersive experience by providing tactile feedback during gameplay."
  },
  "FFlagFoundationNumberInputDisabledStackedVisual_Staged": {
    "mechanism": "Disables the stacked visual for number input fields in the UI.",
    "purpose": "Improves the appearance and usability of number inputs for players."
  },
  "DFFlagEnableLuaApiToRegisterEncryptedAssets_PlaceFilter": {
    "mechanism": "Allows developers to register encrypted assets using a Lua API with a place filter.",
    "purpose": "Enhances security for asset management, ensuring players have a safer experience."
  },
  "FFlagSduiRemoveGameTileInitLogging_Staged": {
    "mechanism": "Removes logging for the initialization of game tiles in the SDUI.",
    "purpose": "Reduces unnecessary data logging, leading to better performance for players."
  },
  "FFlagAXEnablePrefetchMarketplaceFailsafe": {
    "mechanism": "Implements a failsafe for prefetching marketplace data.",
    "purpose": "Ensures smoother access to marketplace items, reducing delays for players."
  },
  "DFFlagSeparateChildIndexReporting_Staged": {
    "mechanism": "Separates the reporting of child index data in the system.",
    "purpose": "Improves performance and accuracy in how child elements are handled, benefiting players."
  },
  "FFlagAEGetEditableOutfitsType_Staged": {
    "mechanism": "Enables retrieval of editable outfit types from the server.",
    "purpose": "Allows players to easily access and modify their outfits."
  },
  "FFlagAXMigrateScalesPageComponentsForAutofocus_Staged": {
    "mechanism": "Updates the components on the scales page to support automatic focus.",
    "purpose": "Improves user experience by making it easier to interact with the scales page."
  },
  "FFlagIASFixDirection3DHandedness": {
    "mechanism": "Corrects the handedness of 3D directional inputs.",
    "purpose": "Ensures that players' controls feel natural and intuitive in 3D environments."
  },
  "FFlagAXFixReactPerfExperimentCounter": {
    "mechanism": "Addresses performance issues in React components related to experimental features.",
    "purpose": "Enhances overall performance and responsiveness of the game interface."
  },
  "FFlagLuauPassBindableGenericsByReference": {
    "mechanism": "Allows bindable generics to be passed by reference in Luau scripts.",
    "purpose": "Improves scripting flexibility and efficiency for developers."
  },
  "DFFlagPath2DFixVisibleChangeRerender_Staged": {
    "mechanism": "Fixes how 2D paths are rendered when visibility changes.",
    "purpose": "Improves the visual consistency of 2D paths in games."
  },
  "FFlagTexturePackGeneratorFix_Staged": {
    "mechanism": "Corrects issues in the texture pack generation process.",
    "purpose": "Ensures players receive properly generated textures for a better visual experience."
  },
  "FFlagSplitLuauMemcat": {
    "mechanism": "Optimizes memory handling in the Luau scripting language.",
    "purpose": "Enhances game performance and reduces lag for smoother gameplay."
  },
  "FFlagLuaAppFixTopBarNameBadgeScaling2": {
    "mechanism": "Adjusts the scaling of name badges in the top bar of the Lua app.",
    "purpose": "Ensures name badges are displayed correctly and are easy to read."
  },
  "FFlagAccountLockConsoleLogout_Staged": {
    "mechanism": "Implements a logout feature for accounts that are locked on consoles.",
    "purpose": "Allows players to log out of their accounts if they are locked, improving account security."
  },
  "FFlagLuauStringConstFolding2_Staged": {
    "mechanism": "Optimizes string constants in Luau scripts for better performance.",
    "purpose": "Improves game performance by making scripts run faster."
  },
  "DFFlagUseModelInsteadOfItsParent": {
    "mechanism": "Changes how models are referenced in the game engine.",
    "purpose": "Enhances stability and performance when using models in games."
  },
  "FFlagRenderModelClusterEntityCulling": {
    "mechanism": "Reduces the number of models rendered based on visibility.",
    "purpose": "Improves game performance by only showing what players can see."
  },
  "FFlagAddControlVariantRolloutFlagsLuaBacktrace_Staged": {
    "mechanism": "Adds new flags for controlling game features in Lua scripts.",
    "purpose": "Allows developers to better manage game features and improve stability."
  },
  "FFlagEnableSubscriptionPurchasePromptDisclosure": {
    "mechanism": "Introduces a prompt for players before they purchase subscriptions.",
    "purpose": "Increases transparency for players about subscription purchases."
  },
  "DFFlagHttpRequestUseNewImplSelect": {
    "mechanism": "Switches to a new implementation for handling HTTP requests.",
    "purpose": "Improves the speed and reliability of online interactions within games."
  },
  "FFlagExtraScriptStats_Staged": {
    "mechanism": "Enables additional tracking of script performance metrics during development.",
    "purpose": "Helps developers optimize their scripts, leading to smoother gameplay for players."
  },
  "FFlagLuauInterpStringConstFolding": {
    "mechanism": "Optimizes string constant handling in the Luau scripting language.",
    "purpose": "Enhances script performance, resulting in faster game execution."
  },
  "FFlagAXPrefetchMarketplaceIXP2": {
    "mechanism": "Implements prefetching for marketplace data to reduce loading times.",
    "purpose": "Allows players to access marketplace items more quickly, improving the shopping experience."
  },
  "DFIntBadgeServiceMaximumBadgeGetCount_PlaceFilter": {
    "mechanism": "Sets a limit on the number of badges retrieved based on the game place.",
    "purpose": "Ensures players receive relevant badges without overwhelming them with too many options."
  },
  "FIntLivenessWithCallbackPollMaxRetries_Staged": {
    "mechanism": "Limits the number of times the system retries to check if a player is active.",
    "purpose": "Improves performance by reducing unnecessary checks, leading to a smoother experience."
  },
  "FFlagAddRedeemTile2_Staged": {
    "mechanism": "Introduces a new tile for redeeming rewards in the game.",
    "purpose": "Enhances the user interface for players, making it easier to claim rewards."
  },
  "DFFlagConvexDecompInertiaDataValidation_Staged": {
    "mechanism": "Validates data related to physics calculations for smoother object movements.",
    "purpose": "Ensures more accurate and realistic interactions between objects in the game."
  },
  "FFlagPlayerListSetIsGamepadOnMount": {
    "mechanism": "Enables the player list to recognize when a gamepad is connected.",
    "purpose": "Improves accessibility for players using gamepads, enhancing their gameplay experience."
  },
  "FFlagLuaAppEnableWindowsHandheldTokenScale_Staged": {
    "mechanism": "Adjusts the scaling of UI elements for handheld devices on Windows.",
    "purpose": "Provides a better visual experience for players using handheld devices, making the game easier to navigate."
  },
  "FFlagInExperienceContainerScreenSizeReducer": {
    "mechanism": "Reduces the size of the experience container on the screen.",
    "purpose": "Provides a more immersive gameplay experience by maximizing the visible game area."
  },
  "FFlagHatThumbnailingFallbackToGetObjects": {
    "mechanism": "Uses a backup method to retrieve hat thumbnails if the primary method fails.",
    "purpose": "Ensures players can always see hat images, improving the shopping experience."
  },
  "FFlagCustomizedLandingLaunchGame": {
    "mechanism": "Allows for personalized landing pages when launching games.",
    "purpose": "Enhances player engagement by showcasing tailored content and features."
  },
  "DFFlagUseNewPhysicsMeshDecoderForAero": {
    "mechanism": "Implements a new system for decoding physics meshes for aerodynamic objects.",
    "purpose": "Improves the realism and performance of flying objects in games."
  },
  "FFlagCeaseUAPresenceRealtimeNotificationUpdatesInGameV2": {
    "mechanism": "Stops real-time notifications about user presence in games.",
    "purpose": "Reduces distractions during gameplay, allowing players to focus more on their experience."
  },
  "FFlagLuaAppMigrateGameTileByDefault4_Staged": {
    "mechanism": "Enables the default use of a new game tile format in the Lua application.",
    "purpose": "Improves the visual presentation of games on the platform."
  },
  "FFlagAddMobilePlayerListScaling_Staged": {
    "mechanism": "Adjusts the player list size dynamically for mobile devices.",
    "purpose": "Enhances the visibility and usability of the player list for mobile users."
  },
  "FIntImprovedStrokesBetaFeatureRolloutPercent": {
    "mechanism": "Controls the percentage of users receiving access to a new feature related to strokes.",
    "purpose": "Gradually introduces players to improved drawing or design tools."
  },
  "FFlagMoveNewPlayerListDividers": {
    "mechanism": "Changes the layout of dividers in the player list for better organization.",
    "purpose": "Makes it easier for players to navigate and find friends in the player list."
  },
  "DFFlagFixGetTextSizeWrongLocale_Staged": {
    "mechanism": "Corrects a bug that affects text size calculations based on locale settings.",
    "purpose": "Ensures that text appears correctly sized for players in different regions."
  },
  "FFlagFoundationSupportCloudAssetsImage2": {
    "mechanism": "Enables support for cloud-based images in the asset system.",
    "purpose": "Improves the loading and display of images in games, enhancing visual quality."
  },
  "FFlagHidePartyVoiceLobbyMicWhenDisconnected_Staged": {
    "mechanism": "Hides the microphone icon in the party lobby when a player is disconnected.",
    "purpose": "Reduces confusion by indicating that the player is not connected and cannot use voice chat."
  },
  "FFlagTexturePackGeneratorFix": {
    "mechanism": "Fixes issues in the texture pack generation process.",
    "purpose": "Ensures that texture packs load correctly, providing a better visual experience in games."
  },
  "DFFlagSimUseRootStepPhysicsBuoyancy_Staged": {
    "mechanism": "Implements buoyancy effects based on root step physics for simulations.",
    "purpose": "Enhances realism in water interactions, making objects float or sink more accurately."
  },
  "FFlagPersonaLivenessFocusNavigation_Staged": {
    "mechanism": "Improves navigation focus for the persona interface.",
    "purpose": "Makes it easier for players to navigate their profiles and settings, improving user experience."
  },
  "FFlagEnableControlVariantRolloutFlagsLuaBacktrace": {
    "mechanism": "Enables detailed error tracking for Lua scripts.",
    "purpose": "Helps developers identify and fix issues faster, leading to a smoother gameplay experience."
  },
  "FFlagAddRedeemTile2": {
    "mechanism": "Introduces a new tile for redeeming items in the UI.",
    "purpose": "Makes it easier for players to find and redeem their rewards."
  },
  "FFlagEnableMoreMenuFocusFix_Staged": {
    "mechanism": "Improves navigation focus within menus.",
    "purpose": "Enhances user experience by making menu navigation more intuitive."
  },
  "FFlagHeroUnitReducedMotion2_Staged": {
    "mechanism": "Reduces motion effects for hero units in games.",
    "purpose": "Provides a more comfortable experience for players sensitive to motion."
  },
  "FFlagWinBackgroundDownloadUpdates2_Staged": {
    "mechanism": "Allows updates to download in the background while playing.",
    "purpose": "Minimizes interruptions during gameplay by keeping the game updated without pausing."
  },
  "FFlagIASFixStudioKeyCodeDisplay": {
    "mechanism": "Fixes the display of key codes in the studio environment.",
    "purpose": "Improves clarity for developers by showing accurate key codes."
  },
  "DFIntRbxmFileManagerOperationalEventLoggingThrottleHundredthsPercent": {
    "mechanism": "Adjusts the logging frequency for file manager events.",
    "purpose": "Enhances performance by reducing unnecessary logging, leading to smoother file management."
  },
  "FFlagAXRootSlotBasedEditorFlag5_Staged": {
    "mechanism": "Introduces a new editor feature based on slot management.",
    "purpose": "Allows for more organized and efficient editing of game elements."
  },
  "DFFlagSimUseRootStepPhysicsBuoyancy": {
    "mechanism": "Implements buoyancy calculations in the physics engine.",
    "purpose": "Creates more realistic water interactions for players and objects."
  },
  "FFlagTerrainOneTouch690": {
    "mechanism": "Enables a simplified terrain editing tool.",
    "purpose": "Makes it easier for developers to create and modify terrain with less effort."
  },
  "FFlagLuaAppAddSduiToSearch": {
    "mechanism": "Adds SDUI (Screen Dynamic User Interface) to the search functionality in Lua applications.",
    "purpose": "Improves the search experience by allowing more dynamic and interactive user interfaces."
  },
  "FFlagEnableChallengeRateLimit": {
    "mechanism": "Implements a limit on the number of challenges a player can attempt in a given time frame.",
    "purpose": "Prevents players from spamming challenges, ensuring a fairer gameplay experience."
  },
  "DFIntConvexDecompCompressionSelector_Staged": {
    "mechanism": "Selects a method for compressing convex shapes in game models.",
    "purpose": "Optimizes game performance by reducing the size of complex shapes, leading to smoother gameplay."
  },
  "DFIntRbxmFileManagerOperationalEventLoggingThrottleHundredthsPercent_Staged": {
    "mechanism": "Controls the frequency of logging events related to file management operations.",
    "purpose": "Enhances system performance by reducing unnecessary logging, which can speed up file operations."
  },
  "FFlagRemoveMeInParent2": {
    "mechanism": "Removes the 'Me' option from the parent selection in certain contexts.",
    "purpose": "Simplifies the user interface by eliminating redundant options, making it easier for players to navigate."
  },
  "FFlagAXPrefetchMarketplaceIXP2_Staged": {
    "mechanism": "Improves how the marketplace loads items by preloading data.",
    "purpose": "Makes browsing and purchasing items faster for players."
  },
  "FFlagUKOSAUpdatedCopy_Staged": {
    "mechanism": "Updates the text and information displayed for UK players.",
    "purpose": "Provides clearer and more relevant information for users in the UK."
  },
  "FFlagAccountLockConsoleLogout": {
    "mechanism": "Automatically logs out users from consoles when their account is locked.",
    "purpose": "Enhances security by ensuring locked accounts cannot be accessed."
  },
  "FFlagAvatarGenBodyColorFix_Staged": {
    "mechanism": "Fixes issues with body color settings in the avatar generator.",
    "purpose": "Ensures players can accurately customize their avatar's body color."
  },
  "DFIntReverbCameraPushForwardStudsHundredths": {
    "mechanism": "Adjusts the camera's position based on sound reverb effects.",
    "purpose": "Improves the immersive experience by aligning camera movement with sound."
  },
  "FFlagMoveNewPlayerListDividers_Staged": {
    "mechanism": "Rearranges the layout of player list dividers in the UI.",
    "purpose": "Improves the organization of player lists for easier navigation."
  },
  "FFlagEnableSquadJoinButtonSelectable_Staged": {
    "mechanism": "Makes the squad join button clickable and selectable.",
    "purpose": "Allows players to easily join squads with a simple click."
  },
  "FFlagLuauInterpStringConstFolding_Staged": {
    "mechanism": "Optimizes string constant handling in the Luau scripting language.",
    "purpose": "Enhances performance and efficiency for developers when scripting."
  },
  "DFFlagEnableCheckAdGuiData_Staged": {
    "mechanism": "Enables the system to verify and manage ad GUI data.",
    "purpose": "Ensures that ad displays are accurate and functional for players."
  },
  "FFlagAddDropdownTypeToValueChanger_Staged": {
    "mechanism": "Introduces a dropdown option in the value changer interface.",
    "purpose": "Provides players with more options and flexibility when changing values."
  },
  "FFlagSwapAppGameTileAndSduiGameTileInRFY_Staged": {
    "mechanism": "Swaps the display order of game tiles in the app and the SDUI.",
    "purpose": "Improves the visibility and accessibility of game tiles for players."
  },
  "FFlagEnableAccountLockModal_Staged": {
    "mechanism": "Introduces a modal window that appears when account locking is triggered.",
    "purpose": "Enhances account security by informing players about potential account lock issues."
  },
  "DFFlagFastEmitterFill2": {
    "mechanism": "Optimizes the way particle emitters fill up, making it more efficient.",
    "purpose": "Provides smoother and more visually appealing particle effects in games."
  },
  "DFStringFlagRepoGitHashDynamicString": {
    "mechanism": "Links a dynamic string to the version control system for tracking changes.",
    "purpose": "Helps developers keep track of updates and changes, ensuring a better gaming experience."
  },
  "DFIntReverbCameraPushForwardStudsHundredths_Staged": {
    "mechanism": "Adjusts the camera's position based on reverb settings in small increments.",
    "purpose": "Creates a more immersive audio experience by aligning camera movement with sound effects."
  },
  "FFlagFixLeaderboardStatSortTypeMismatch": {
    "mechanism": "Corrects inconsistencies in sorting leaderboard statistics based on their types.",
    "purpose": "Ensures leaderboard stats are sorted correctly, making it easier for players to understand rankings."
  },
  "FFlagEnableUISoundAndHaptics10": {
    "mechanism": "Activates new sound and vibration features in the user interface.",
    "purpose": "Enhances player experience with audio cues and haptic feedback for better interaction."
  },
  "FFlagSduiRemoveGameTileInitLogging": {
    "mechanism": "Disables logging for the initialization of game tiles in the UI.",
    "purpose": "Improves performance by reducing unnecessary logging, leading to a smoother experience."
  },
  "FFlagIEMSelectorUnchangedByMouseWheel": {
    "mechanism": "Prevents the mouse wheel from altering the selection in the in-game menu.",
    "purpose": "Provides a more stable menu navigation experience for players using the mouse."
  },
  "FFlagUIBloxEnableFontScaling_Staged": {
    "mechanism": "Introduces scalable fonts in the UI for better readability.",
    "purpose": "Improves text visibility and accessibility for players across different devices."
  },
  "FFlagAddVoiceExposureLayer_Staged": {
    "mechanism": "Adds a new layer for voice chat exposure settings in the game.",
    "purpose": "Allows players to better control who can hear their voice in games."
  },
  "FFlagWinBackgroundDownloadUpdates2": {
    "mechanism": "Implements background downloading of game updates while players are in the game.",
    "purpose": "Reduces wait time for players by updating games without interrupting their play."
  },
  "FFlagEnableSubscriptionPurchasePromptDisclosure_Staged": {
    "mechanism": "Introduces a prompt that informs players about subscription purchases before they confirm.",
    "purpose": "Ensures players are aware of subscription costs, enhancing transparency."
  },
  "FFlagRenderParticlesSimulateNonVisible6": {
    "mechanism": "Allows particles to be simulated even when they are not visible on the screen.",
    "purpose": "Improves the realism of effects in the game, making experiences more immersive."
  },
  "FFlagHighlights255Allowed": {
    "mechanism": "Increases the limit of highlight colors that can be used in the game.",
    "purpose": "Gives players more options for customizing their characters and environments."
  },
  "DFFlagSimCSGSerializeHistoryGeoService6": {
    "mechanism": "Stores and retrieves history of geometric changes in simulations.",
    "purpose": "Allows players to undo or redo changes in their game builds."
  },
  "EnableExitImmediatelyOnBackgroundingOnQuest": {
    "mechanism": "N/A (invalid)",
    "purpose": "N/A (invalid)"
  },
  "DFStringFlipTimeStampDynamicString": {
    "mechanism": "Updates timestamps in dynamic strings for better performance.",
    "purpose": "Ensures players see accurate and timely information in their game interfaces."
  },
  "DFIntCafTelemetryIntegrationAppLaunchTelemetryThrottleHundredthsPercent": {
    "mechanism": "Limits the frequency of data collection during app launches.",
    "purpose": "Enhances game performance by reducing lag during startup."
  },
  "FFlagEnableBiometricChallenges_Staged": {
    "mechanism": "Integrates biometric authentication for account security.",
    "purpose": "Provides players with a more secure way to access their accounts using fingerprints or facial recognition."
  },
  "SafeWebViewParamsUnboxing": {
    "mechanism": "N/A (invalid)",
    "purpose": "N/A (invalid)"
  },
  "FFlagLuaAppUpdateGameGridSideMargin": {
    "mechanism": "Adjusts the layout margins of game grid displays in the Lua app for better visual spacing.",
    "purpose": "Provides a cleaner and more visually appealing layout for players browsing games."
  },
  "FFlagAvatarGenBodyColorFix": {
    "mechanism": "Fixes issues with the body color generation in avatars to ensure accurate color representation.",
    "purpose": "Ensures that players' avatars display the correct colors as intended, improving customization."
  },
  "FFlagEnableAccountLockModal": {
    "mechanism": "Introduces a modal dialog that appears when an account lock is triggered, guiding users through the process.",
    "purpose": "Increases account security by clearly informing players about account lock situations and how to resolve them."
  },
  "FFlagFilterNewPlayerListValueStat": {
    "mechanism": "Implements a filtering system for new player statistics to enhance data accuracy and relevance.",
    "purpose": "Provides players with more accurate and useful information about new players in the game."
  },
  "FFlagAddNavigationToTryOnPageForCurrentlyWearing2_IXP": {
    "mechanism": "Adds navigation links to the Try-On page for items currently worn by the player.",
    "purpose": "Allows players to easily switch between items they are wearing while trying on new outfits."
  },
  "DFFlagDataPingTracerAdditionalFields_Staged": {
    "mechanism": "Enhances data tracking by adding more fields to the ping tracer system.",
    "purpose": "Improves the ability to diagnose and fix connection issues for players."
  },
  "FFlagPremultiplyViewportframeBackgroundColor": {
    "mechanism": "Changes how the background color of viewport frames is processed before rendering.",
    "purpose": "Ensures that background colors look more consistent and visually appealing in games."
  },
  "FFlagRenderModelClusterEntityCulling_Staged": {
    "mechanism": "Optimizes rendering by removing unseen model clusters from the rendering process.",
    "purpose": "Increases game performance by reducing the load on players' devices."
  },
  "DFFlagPath2DFixVisibleChangeRerender": {
    "mechanism": "Fixes how visible changes in 2D paths trigger re-rendering.",
    "purpose": "Ensures smoother visual updates and interactions in 2D games."
  },
  "FFlagModerationServiceIgnoreTemporaryCaptures_Staged": {
    "mechanism": "Modifies moderation to overlook temporary captures in the system.",
    "purpose": "Improves the accuracy of moderation by not counting temporary captures, leading to a fairer experience for players."
  },
  "FFlagCustomizedLandingLaunchGame_Staged": {
    "mechanism": "Enables personalized landing pages for games when launched.",
    "purpose": "Enhances player experience by providing tailored game entry points, making it easier to find and enjoy games."
  },
  "FFlagAvatarChatDelayModelDelivery2_Staged": {
    "mechanism": "Adjusts the timing of avatar model updates in chat.",
    "purpose": "Reduces delays in displaying avatars in chat, making interactions feel more immediate and engaging."
  },
  "FFlagLuaAppFixSearchGameGridInitialItemsPerRow": {
    "mechanism": "Fixes the layout for displaying games in search results.",
    "purpose": "Improves the visual organization of game search results, helping players find games more easily."
  },
  "FFlagAssetProviderSetThreadNames_Staged": {
    "mechanism": "Assigns specific names to threads handling asset delivery.",
    "purpose": "Enhances performance monitoring and debugging, indirectly improving the overall game experience for players."
  },
  "FFlagGetGameIconsFromThumbnailsDeliveryApiIxp_Staged": {
    "mechanism": "Fetches game icons from a new API for better performance.",
    "purpose": "Players will see game icons load faster and more reliably."
  },
  "FFlagIASFixStudioKeyCodeDisplay_Staged": {
    "mechanism": "Fixes how key codes are displayed in the studio environment.",
    "purpose": "Players and developers will have clearer key code information while scripting."
  },
  "FFlagEnableControlVariantRolloutFlagsLuaBacktrace_Staged": {
    "mechanism": "Implements a system to track and debug control variants in Lua scripts.",
    "purpose": "Helps developers identify and fix issues more easily, improving game stability."
  },
  "FFlagEnableUISoundAndHaptics10_Staged": {
    "mechanism": "Enables new sound and haptic feedback features in the user interface.",
    "purpose": "Players will experience enhanced audio and tactile feedback for a more immersive experience."
  },
  "FFlagLuaAppReduceGameIconFetches": {
    "mechanism": "Reduces the number of times game icons are fetched during gameplay.",
    "purpose": "Players will enjoy smoother gameplay with less loading time for game icons."
  },
  "FFlagDecoupleScreenGuiFromPurchasePromptApp_Staged": {
    "mechanism": "Separates the GUI from the purchase prompt system to improve performance.",
    "purpose": "Enhances the user experience by making the purchase process smoother and more responsive."
  },
  "DFIntPerfDataGlobalThrottleHundredthsPercent_Staged": {
    "mechanism": "Adjusts performance data collection rates to optimize server load.",
    "purpose": "Improves game performance by reducing lag and ensuring smoother gameplay."
  },
  "FFlagDynamicTranslationAlwaysRetranslate": {
    "mechanism": "Ensures that translations are updated dynamically whenever content changes.",
    "purpose": "Provides players with the most accurate and up-to-date translations for a better understanding of the game."
  },
  "FFlagStreamJobRefactorSetCollection": {
    "mechanism": "Refactors how job data is streamed and collected for better efficiency.",
    "purpose": "Improves the reliability and speed of job-related data, enhancing gameplay experiences."
  },
  "FFlagLuauStringConstFolding2": {
    "mechanism": "Optimizes string handling in the Luau scripting language for better performance.",
    "purpose": "Increases game performance by making scripts run faster and more efficiently."
  },
  "DFFlagSplineClampForNaNInput_Staged": {
    "mechanism": "Prevents invalid input values (NaN) from affecting spline calculations.",
    "purpose": "Ensures smoother and more reliable movement paths in games."
  },
  "DFFlagDataPingTracerAdditionalFields": {
    "mechanism": "Adds more data points to network performance tracking.",
    "purpose": "Improves the ability to diagnose and fix lag issues for players."
  },
  "DFFlagUseNewPhysicsMeshDecoderForLegacyMassData": {
    "mechanism": "Updates how physics data is processed for older models.",
    "purpose": "Enhances the performance and accuracy of physics interactions in games."
  },
  "FFlagEnableTelemetryIntegrationCheck_Staged": {
    "mechanism": "Implements checks for data tracking systems.",
    "purpose": "Helps developers monitor game performance and player experience more effectively."
  },
  "FFlagWinUsedMemoryCorrectApi_IXP": {
    "mechanism": "Corrects the method used to report memory usage.",
    "purpose": "Provides more accurate information about memory usage, improving game stability."
  },
  "FFlagAddControlVariantRolloutFlagsLuaBacktrace": {
    "mechanism": "Enables tracking of Lua errors with more detailed backtrace information.",
    "purpose": "Helps developers identify and fix issues in their games more efficiently, leading to a smoother experience for players."
  },
  "FFlagAddNewPlayerListFocusNav_Staged": {
    "mechanism": "Introduces a new navigation system for the player list that focuses on improved usability.",
    "purpose": "Makes it easier for players to manage and interact with their friends and other players in the game."
  },
  "DFFlagSeparateChildIndexReporting": {
    "mechanism": "Changes how child index information is reported in the game engine.",
    "purpose": "Improves performance and accuracy in rendering, resulting in a better visual experience for players."
  },
  "FFlagLuauResumeFix": {
    "mechanism": "Fixes issues related to resuming Luau scripts that may have been paused.",
    "purpose": "Ensures that games run smoothly without interruptions, enhancing gameplay for players."
  },
  "FFlagLuaAppLayoutParamsInContext": {
    "mechanism": "Allows layout parameters to be defined in the context of Lua applications.",
    "purpose": "Gives developers more control over how game interfaces are displayed, improving the overall user experience for players."
  },
  "FFlagSplitLuauMemcat_Staged": {
    "mechanism": "Separates memory management for Luau scripts to improve performance.",
    "purpose": "Enhances game performance and reduces lag during gameplay."
  },
  "FFlagDynamicTranslationUseCacheValue": {
    "mechanism": "Caches translation values for dynamic text to reduce processing time.",
    "purpose": "Improves loading times for text, making games feel more responsive."
  },
  "DFFlagUsePhysicsMeshDecoderInBulletWrapper_Staged": {
    "mechanism": "Utilizes a new method for decoding physics meshes in bullet interactions.",
    "purpose": "Provides more accurate and realistic physics interactions in games."
  },
  "FFlagHeroUnitReducedMotion2": {
    "mechanism": "Offers an option to reduce motion effects for players who prefer less visual stimulation.",
    "purpose": "Makes games more accessible for players with motion sensitivity."
  },
  "FFlagAddMobilePlayerListScaling": {
    "mechanism": "Adjusts the player list display size on mobile devices for better visibility.",
    "purpose": "Improves the user interface for mobile players, making it easier to see other players."
  },
  "FFlagDynamicTranslationAlwaysRetranslate_Staged": {
    "mechanism": "Forces the system to reprocess translations dynamically.",
    "purpose": "Ensures that text and other elements are always displayed in the correct language, improving user experience."
  },
  "FFlagIASFixDirection3DHandedness_Staged": {
    "mechanism": "Adjusts the handling of 3D object orientations to match user expectations.",
    "purpose": "Fixes issues with how objects are rotated, making interactions more intuitive for players."
  },
  "DFFlagUseNewPhysicsMeshDecoderForLegacyMassData_Staged": {
    "mechanism": "Implements a new method for decoding physics data for older models.",
    "purpose": "Improves the performance and accuracy of physics simulations in older games, enhancing gameplay."
  },
  "DFFlagSimCSGSerializeHistoryGeoService6_Staged": {
    "mechanism": "Updates the way geometric data is saved and processed in simulations.",
    "purpose": "Enhances the stability and reliability of building tools, making it easier for players to create and edit structures."
  },
  "FFlagStreamJobRefactorSetCollection_Staged": {
    "mechanism": "Reorganizes how streaming jobs are managed and executed.",
    "purpose": "Improves the efficiency of loading game assets, leading to faster load times and smoother gameplay."
  },
  "FFlagHelpPageIXPExposure": {
    "mechanism": "Enables a new help page feature for users.",
    "purpose": "Provides players with easier access to support and guidance."
  },
  "FFlagLuauResumeFix_Staged": {
    "mechanism": "Fixes issues with the Luau scripting language's resume function.",
    "purpose": "Improves the stability and reliability of scripts for developers."
  },
  "FFlagRemoveMeInParent2_Staged": {
    "mechanism": "Removes the 'Me' reference in certain parent objects.",
    "purpose": "Simplifies code for developers, making it easier to manage objects."
  },
  "FFlagLuauSubtypingPrimitiveAndGenericTableTypes_Staged": {
    "mechanism": "Enhances type checking for tables in Luau scripting.",
    "purpose": "Allows developers to write more flexible and safer code."
  },
  "FFlagLuaAppLayoutParamsInContext_Staged": {
    "mechanism": "Adds layout parameters to the context of Lua applications.",
    "purpose": "Improves the customization and layout options for developers creating apps."
  },
  "FFlagFilterNewPlayerListValueStat_Staged": {
    "mechanism": "Filters the list of new players based on specific criteria.",
    "purpose": "Helps players find and connect with new users more easily."
  },
  "FFlagIEMSelectorUnchangedByMouseWheel_Staged": {
    "mechanism": "Prevents the item selector from changing when the mouse wheel is scrolled.",
    "purpose": "Provides a smoother experience when browsing items without accidental changes."
  },
  "FFlagAddIconToUserTile_Staged": {
    "mechanism": "Adds an icon to user profile tiles in the interface.",
    "purpose": "Makes it easier for players to identify and recognize users at a glance."
  },
  "FFlagAXAddInventoryItemsListProps_Staged": {
    "mechanism": "Enhances the properties of the inventory items list for better functionality.",
    "purpose": "Improves how players interact with their inventory, making it more user-friendly."
  },
  "FFlagFixDelayAfterPurchaseFlowComplete": {
    "mechanism": "Reduces the waiting time after completing a purchase.",
    "purpose": "Allows players to continue playing without unnecessary delays after buying items."
  },
  "FFlagLuaAppUpdateGameGridTableColumns": {
    "mechanism": "Updates the layout of game grid tables in the Lua app.",
    "purpose": "Improves the organization and readability of game listings for players."
  },
  "FFlagExpChatEnableFocusNavigation2": {
    "mechanism": "Enhances navigation in chat using keyboard focus.",
    "purpose": "Makes it easier for players to move through chat messages without using a mouse."
  },
  "FFlagDynamicTranslationUseCacheValue_Staged": {
    "mechanism": "Caches translation values for quicker access during gameplay.",
    "purpose": "Speeds up the loading of translated text, improving the experience for non-English players."
  },
  "DFIntCafTelemetryIntegrationAppLaunchTelemetryThrottleHundredthsPercent_Staged": {
    "mechanism": "Controls the frequency of telemetry data sent during app launches.",
    "purpose": "Helps optimize performance by reducing unnecessary data transmission during startup."
  },
  "FFlagPlayerListIgnoreDevGamepadBindings": {
    "mechanism": "Disables certain gamepad controls for developers in the player list.",
    "purpose": "Ensures developers can test games without interference from gamepad settings."
  },
  "FFlagFixMediaKeysMapping_Staged": {
    "mechanism": "Adjusts the mapping of media keys to ensure they work correctly within Roblox.",
    "purpose": "Improves user experience by allowing media keys to function properly while playing games."
  },
  "FFlagEnableMoreMenuFocusFix": {
    "mechanism": "Enhances the focus management for menus to ensure they are more accessible and responsive.",
    "purpose": "Makes it easier for players to navigate menus without losing focus or encountering glitches."
  },
  "FIntLivenessWithCallbackPollMaxRetries": {
    "mechanism": "Sets a limit on the number of retries for polling live data callbacks to improve performance.",
    "purpose": "Ensures smoother gameplay by reducing delays caused by excessive retries in data fetching."
  },
  "FFlagEnableNativeChallengeAbandonment": {
    "mechanism": "Allows players to abandon challenges natively within the game interface.",
    "purpose": "Gives players the flexibility to leave challenges without penalties, enhancing their gaming experience."
  },
  "FFlagAddFriendsFixText": {
    "mechanism": "Corrects the text and interface related to adding friends in Roblox.",
    "purpose": "Improves clarity and usability when players try to add friends, making the process more intuitive."
  },
  "FFlagFixWallsOcclusion": {
    "mechanism": "Improves how walls block visibility in the game engine.",
    "purpose": "Players will see more accurate visuals where walls properly hide or reveal objects."
  },
  "FFlagLuaAppSduiItemImpressionsStartRow_Staged": {
    "mechanism": "Changes how items are displayed in a list format in the app.",
    "purpose": "Players will experience a more organized and visually appealing layout of items."
  },
  "FFlagGetGameIconsFromThumbnailsDeliveryApiIxp": {
    "mechanism": "Fetches game icons directly from a new delivery system.",
    "purpose": "Players will see faster loading and better quality game icons."
  },
  "FFlagLuauPassBindableGenericsByReference_Staged": {
    "mechanism": "Allows certain data types to be passed more efficiently in scripts.",
    "purpose": "Players will benefit from smoother gameplay and improved script performance."
  },
  "DFFlagHttpRequestUseNewImplSelect_Staged": {
    "mechanism": "Switches to a new method for handling web requests.",
    "purpose": "Players will experience more reliable connections and data fetching in games."
  },
  "FFlagReportTextureStreamingTelemetry3_Staged": {
    "mechanism": "Collects data on texture streaming performance.",
    "purpose": "Improves game graphics by optimizing how textures load."
  },
  "FFlagFoundationNumberInputDisabledStackedVisual": {
    "mechanism": "Disables stacked visual elements for number inputs.",
    "purpose": "Enhances user experience by simplifying number entry."
  },
  "FFlagFixDelayAfterPurchaseFlowComplete_Staged": {
    "mechanism": "Reduces the wait time after completing a purchase.",
    "purpose": "Makes transactions faster and smoother for players."
  },
  "FStringFlipTimeStampFastString": {
    "mechanism": "Improves string handling for timestamps.",
    "purpose": "Ensures quicker and more accurate time displays in games."
  },
  "FFlagHatThumbnailingFallbackToGetObjects_Staged": {
    "mechanism": "Uses a backup method for generating hat thumbnails.",
    "purpose": "Ensures players can see hat images even if the primary method fails."
  },
  "DFFlagUseModelInsteadOfItsParent_Staged": {
    "mechanism": "Changes the way models are referenced in the game, using the model itself rather than its parent object.",
    "purpose": "Improves performance and organization of game assets, making it easier for developers to manage models."
  },
  "FFlagLuaAppActiveFriendIconEmphasisBorder_Staged": {
    "mechanism": "Adds a visual border around active friend icons in the app interface.",
    "purpose": "Helps players quickly identify which friends are currently online or active."
  },
  "FFlagPlayerListSetIsGamepadOnMount_Staged": {
    "mechanism": "Adjusts the player list behavior to recognize when a gamepad is connected upon loading.",
    "purpose": "Enhances the user experience for players using gamepads by optimizing the interface for their controls."
  },
  "FFlagFixUninitializedMenuKeyBindings": {
    "mechanism": "Corrects issues with menu key bindings that were not set up properly at startup.",
    "purpose": "Ensures players have a smooth experience with key controls from the beginning, preventing confusion."
  },
  "FFlagAssetProviderSetThreadNames": {
    "mechanism": "Assigns specific names to threads handling asset loading, improving debugging.",
    "purpose": "Helps developers identify and fix issues related to asset loading more efficiently."
  },
  "DFIntPerfDataGlobalThrottleHundredthsPercent": {
    "mechanism": "Limits performance data collection to reduce server load.",
    "purpose": "Improves game performance by managing how much data is processed."
  },
  "DFFlagUseNewPhysicsMeshDecoderForNav_Staged": {
    "mechanism": "Implements a new method for decoding physics meshes for navigation.",
    "purpose": "Enhances navigation accuracy and efficiency in games."
  },
  "FFlagAXIncreaseDefaultPeekViewHeight_Staged": {
    "mechanism": "Adjusts the default height for the peek view in the user interface.",
    "purpose": "Provides a better visual experience by allowing more content to be seen at once."
  },
  "FFlagExtraScriptStats": {
    "mechanism": "Adds additional statistics tracking for scripts in games.",
    "purpose": "Gives developers more insights into script performance, helping them optimize their games."
  },
  "FFlagAddDropdownTypeToValueChanger": {
    "mechanism": "Introduces a dropdown option for changing values in the user interface.",
    "purpose": "Makes it easier for players to select options, improving user experience."
  },
  "FFlagLuaAppEnableWindowsHandheldTokenScale": {
    "mechanism": "Enables scaling of UI elements for handheld devices running Windows.",
    "purpose": "Improves the visibility and usability of the interface on Windows handheld devices."
  },
  "FFlagRemoveLegacyChatConsoleCheck": {
    "mechanism": "Removes outdated checks for the chat console in the game's code.",
    "purpose": "Enhances chat functionality by streamlining the chat system for better performance."
  },
  "FFlagLuaAppAddSduiToSearch_Staged": {
    "mechanism": "Integrates a new search feature within the Lua app for better content discovery.",
    "purpose": "Allows players to find games and items more easily through improved search capabilities."
  },
  "FFlagAddFriendsFixText_Staged": {
    "mechanism": "Fixes text display issues related to adding friends in the game.",
    "purpose": "Ensures players can clearly see and understand friend requests and notifications."
  },
  "FFlagLuaAppSduiItemImpressionsStartRow": {
    "mechanism": "Adjusts the starting row for item impressions in the Lua app's UI.",
    "purpose": "Optimizes the layout of items displayed to players, making it easier to browse."
  },
  "FFlagAddNewPlayerListFocusNav": {
    "mechanism": "Adds navigation focus to the player list for easier access.",
    "purpose": "Improves user experience by allowing players to navigate the player list more efficiently."
  },
  "FFlagFixLeaderboardStatSortTypeMismatch_Staged": {
    "mechanism": "Corrects sorting issues in leaderboard statistics.",
    "purpose": "Ensures that leaderboard stats are displayed correctly, enhancing competitive gameplay."
  },
  "FFlagPrecomputeDeformVertices4_Staged": {
    "mechanism": "Precomputes vertex deformation for smoother graphics.",
    "purpose": "Enhances visual quality and performance of character models during gameplay."
  },
  "FFlagEnableNativeChallengeAbandonment_Staged": {
    "mechanism": "Allows players to abandon challenges natively within the game.",
    "purpose": "Gives players the flexibility to exit challenges without penalty, improving game flow."
  },
  "FFlagDecoupleScreenGuiFromPurchasePromptApp": {
    "mechanism": "Separates GUI elements from the purchase prompt system.",
    "purpose": "Improves the user interface by making it more responsive and less cluttered during purchases."
  },
  "FFlagRenderParticlesSimulateNonVisible6_Staged": {
    "mechanism": "Enables particles to behave as if they are still present even when not visible.",
    "purpose": "Improves the realism of particle effects in games, enhancing visual quality."
  },
  "FFlagUKOSAUpdatedCopy": {
    "mechanism": "Updates the copy of the UK Online Safety Act implementation.",
    "purpose": "Ensures compliance with local laws, providing a safer environment for players."
  },
  "DFFlagUseNewPhysicsMeshDecoderForAero_Staged": {
    "mechanism": "Switches to a new method for decoding physics meshes for aerodynamic objects.",
    "purpose": "Enhances the performance and accuracy of physics in games involving flying or moving objects."
  },
  "FFlagLuaAppFixSearchGameGridInitialItemsPerRow_Staged": {
    "mechanism": "Adjusts the number of items displayed per row in the game search grid.",
    "purpose": "Improves the layout of search results, making it easier for players to find games."
  },
  "FFlagWindowsInstallerPostWebLaunch_Staged": {
    "mechanism": "Implements a new installer process for Windows after launching from the web.",
    "purpose": "Streamlines the installation process, making it quicker and more user-friendly for players."
  },
  "FFlagEnableChallengeRateLimit_Staged": {
    "mechanism": "Limits the number of challenges a player can attempt in a certain timeframe.",
    "purpose": "Prevents players from spamming challenges, ensuring a fairer gameplay experience."
  },
  "FFlagAXEnablePrefetchMarketplaceFailsafe_Staged": {
    "mechanism": "Implements a backup system for loading marketplace items to avoid failures.",
    "purpose": "Ensures players can access marketplace items more reliably, reducing errors during purchases."
  },
  "FFlagLuaAppUpdateGameGridSideMargin_Staged": {
    "mechanism": "Adjusts the spacing on the game grid layout in the app.",
    "purpose": "Improves the visual appearance and usability of the game grid for players."
  },
  "FFlagReportTextureStreamingTelemetry3": {
    "mechanism": "Collects data on how textures are streamed in games for analysis.",
    "purpose": "Helps developers optimize texture loading, leading to smoother gameplay for players."
  },
  "FFlagAXFixOrganicTTILogging_Staged": {
    "mechanism": "Corrects the logging system for tracking organic traffic and interactions.",
    "purpose": "Enhances the accuracy of data collected about player interactions, improving game features based on real usage."
  },
  "DFFlagUseNewPhysicsMeshDecoderForNav": {
    "mechanism": "Enables a new method for decoding physics meshes for navigation purposes.",
    "purpose": "Improves the accuracy and efficiency of character movement and navigation in complex environments."
  },
  "DFFlagSplineClampForNaNInput": {
    "mechanism": "Introduces a clamping mechanism for spline calculations when encountering invalid (NaN) inputs.",
    "purpose": "Prevents errors in animations and movements, ensuring smoother gameplay even when unexpected data occurs."
  },
  "DFFlagConvexDecompInertiaDataValidation": {
    "mechanism": "Validates inertia data during the convex decomposition process for physics calculations.",
    "purpose": "Enhances the realism of object interactions and collisions, making gameplay feel more natural."
  },
  "FFlagAXMigrateScalesPageComponentsForAutofocus": {
    "mechanism": "Migrates page components to support automatic focus on scale adjustments.",
    "purpose": "Streamlines the user experience when adjusting scales, making it easier for players to customize their creations."
  },
  "FFlagCarouselUseNewUserTileWithPresenceIcon_IXP": {
    "mechanism": "Switches to a new user tile design that includes presence indicators for online status.",
    "purpose": "Allows players to easily see which friends are online, enhancing social interactions within the game."
  },
  "DFFlagEnableCheckAdGuiData": {
    "mechanism": "Enables a check for ad-related data in the GUI.",
    "purpose": "Improves the display and functionality of advertisements in the game."
  },
  "FFlagStreamJobRefactorSetCollection_PlaceFilter": {
    "mechanism": "Refactors how job streaming processes collections with a place filter.",
    "purpose": "Enhances performance and organization of game assets during streaming."
  },
  "DFFlagFixGetTextSizeWrongLocale": {
    "mechanism": "Fixes the text size calculation to account for different languages and regions.",
    "purpose": "Ensures text appears correctly sized for players from various locales."
  },
  "DFFlagBaseGuiSelectedObjectUpdates": {
    "mechanism": "Updates the selected object in the Base GUI when changes occur.",
    "purpose": "Provides real-time feedback and interaction improvements for players using the GUI."
  },
  "FFlagAXFixBuyActionBarNotAppearing3_Staged": {
    "mechanism": "Fixes an issue where the buy action bar does not show up in certain scenarios.",
    "purpose": "Ensures players can easily access purchase options when needed."
  },
  "FFlagLuaAppFixTopBarNameBadgeScaling2_Staged": {
    "mechanism": "Adjusts the scaling of name badges in the top bar for better visibility.",
    "purpose": "Improves the appearance of player names and badges, making them easier to read."
  },
  "FFlagUgcValidationValidateEmissiveMask_Staged": {
    "mechanism": "Enhances the validation process for user-generated content to ensure emissive masks are correctly applied.",
    "purpose": "Ensures that custom items look as intended, improving the quality of user creations."
  },
  "DFFlagMicroprofilerOffFix": {
    "mechanism": "Disables a performance profiling tool that was causing issues.",
    "purpose": "Improves game performance and stability for a smoother gaming experience."
  },
  "FFlagModerationServiceIgnoreTemporaryCaptures": {
    "mechanism": "Modifies the moderation system to not flag temporary captures for review.",
    "purpose": "Reduces unnecessary moderation actions, allowing players to share temporary content without worry."
  },
  "FFlagShowAntiHarassmentSettings_IXP": {
    "mechanism": "Enables a new settings menu for players to manage anti-harassment features.",
    "purpose": "Empowers players to customize their safety settings, enhancing their overall experience and comfort."
  },
  "FFlagEnableFixAdsClickoutPassthroughSafeArea": {
    "mechanism": "Adjusts ad click areas to avoid overlapping with safe zones.",
    "purpose": "Ensures players can click on ads without interference from UI elements."
  },
  "FFlagUgcValidationValidateEmissiveMask": {
    "mechanism": "Implements checks for emissive textures in user-generated content.",
    "purpose": "Improves the quality and safety of custom items by ensuring they meet standards."
  },
  "FFlagAXFixBuyActionBarNotAppearing3": {
    "mechanism": "Fixes issues where the purchase action bar fails to show up.",
    "purpose": "Allows players to easily buy items without missing the action bar."
  },
  "FFlagEnableSquadJoinButtonSelectable": {
    "mechanism": "Adds a selectable button for joining squads in-game.",
    "purpose": "Makes it easier for players to join their friends' squads directly."
  },
  "FFlagUseCaptureForStudio_Staged": {
    "mechanism": "Enables a capture feature for staged game development in Roblox Studio.",
    "purpose": "Helps developers create and test their games more effectively."
  },
  "FFlagSwapAppGameTileAndSduiGameTileInRFY": {
    "mechanism": "Swaps the display order of game tiles in the app and the SDUI.",
    "purpose": "Improves the visibility and accessibility of game tiles for players."
  },
  "FStringFlagRepoGitHashFastString": {
    "mechanism": "Uses a faster method to retrieve version information from the repository.",
    "purpose": "Enhances performance and loading times for players accessing game updates."
  },
  "FFlagWindowsInstallerPostWebLaunch": {
    "mechanism": "Enables a new installer for Windows after launching from the web.",
    "purpose": "Streamlines the installation process for players using Windows."
  },
  "FFlagLuaAppReduceGameIconFetches_Staged": {
    "mechanism": "Reduces the number of times game icons are fetched during app usage.",
    "purpose": "Decreases loading times and improves app performance for players."
  },
  "FFlagLuaAppUpdateGameGridTableColumns_Staged": {
    "mechanism": "Modifies the layout of game grid tables in the app.",
    "purpose": "Enhances the organization and presentation of games for easier browsing by players."
  },
  "FFlagAddIconToUserTile": {
    "mechanism": "Adds an icon to user profile tiles in the interface.",
    "purpose": "Makes it easier for players to identify user profiles at a glance."
  },
  "FFlagFixWallsOcclusion_Staged": {
    "mechanism": "Improves how walls block visibility in the game.",
    "purpose": "Enhances gameplay by preventing players from seeing through walls incorrectly."
  },
  "FFlagUseNewHapticServiceInUA3": {
    "mechanism": "Implements a new system for haptic feedback on devices.",
    "purpose": "Provides players with better tactile responses during gameplay, making it more immersive."
  },
  "DFFlagFastEmitterFill2_Staged": {
    "mechanism": "Optimizes how particle emitters fill in the game.",
    "purpose": "Improves performance and visual effects for players, making the game run smoother."
  },
  "FFlagEnableFixAdsClickoutPassthroughSafeArea_Staged": {
    "mechanism": "Adjusts how ads interact with the game's safe area.",
    "purpose": "Ensures players can click on ads without issues, improving ad engagement."
  },
  "FFlagTerrainOneTouch690_Staged": {
    "mechanism": "Improves terrain interaction by allowing single-touch actions.",
    "purpose": "Makes it easier for players to interact with terrain features."
  },
  "FFlagFixUninitializedMenuKeyBindings_Staged": {
    "mechanism": "Fixes issues with menu key bindings that weren't set up correctly.",
    "purpose": "Ensures players can use their keyboard shortcuts without problems."
  },
  "FFlagExplorerStreaming2_Staged": {
    "mechanism": "Enhances the way the game loads and streams content in the Explorer.",
    "purpose": "Improves performance and loading times for players while using the Explorer."
  },
  "FFlagEnableBackgroundSignatureVerification": {
    "mechanism": "Adds a security check for game assets in the background.",
    "purpose": "Increases player safety by ensuring assets are verified before use."
  },
  "FFlagAvatarChatDelayModelDelivery2": {
    "mechanism": "Adjusts the timing for delivering avatar models during chat interactions.",
    "purpose": "Reduces delays in displaying avatars, making chat more responsive."
  },
  "DFFlagBaseGuiSelectedObjectUpdates_Staged": {
    "mechanism": "Updates selected objects in the GUI dynamically without needing a full refresh.",
    "purpose": "Improves user experience by making the interface more responsive and intuitive."
  },
  "FFlagCachelessPluginLoading3_Staged": {
    "mechanism": "Loads plugins without using cached data, ensuring the latest version is always used.",
    "purpose": "Ensures players and developers always have the most up-to-date tools and features available."
  },
  "DFIntConvexDecompCompressionSelector": {
    "mechanism": "Selects a method for compressing complex shapes in games to optimize performance.",
    "purpose": "Enhances game performance by reducing lag and improving load times for players."
  },
  "FFlagHighlights255Allowed_Staged": {
    "mechanism": "Allows the use of a wider range of highlight colors in the game.",
    "purpose": "Gives developers more creative freedom to make their games visually appealing."
  },
  "FFlagExpChatEnableFocusNavigation2_Staged": {
    "mechanism": "Implements keyboard navigation for chat features, allowing users to navigate with ease.",
    "purpose": "Improves accessibility for players who prefer using the keyboard over the mouse."
  },
  "FFlagFixLeaderboardCleanup_Staged": {
    "mechanism": "Improves the process of removing outdated leaderboard data.",
    "purpose": "Ensures players see accurate leaderboard information without clutter."
  },
  "FFlagAXGeneralizeInventoryItemsList_Staged": {
    "mechanism": "Standardizes how inventory items are displayed across different categories.",
    "purpose": "Makes it easier for players to find and manage their items."
  },
  "FFlagUseCaptureForStudio": {
    "mechanism": "Enables a new system for capturing game visuals in the development environment.",
    "purpose": "Enhances the experience for developers by providing better tools for creating games."
  },
  "FFlagAEGetEditableOutfitsType": {
    "mechanism": "Allows access to a new type of outfit that can be edited.",
    "purpose": "Gives players more customization options for their avatars."
  },
  "FFlagCachelessPluginLoading3": {
    "mechanism": "Loads plugins without relying on cached data.",
    "purpose": "Improves the speed and reliability of loading plugins for developers."
  },
  "DFFlagMicroprofilerOffFix_Staged": {
    "mechanism": "Disables the microprofiler tool in certain scenarios to improve performance.",
    "purpose": "Enhances game performance by reducing unnecessary resource usage."
  },
  "FFlagPlayerListIgnoreDevGamepadBindings_Staged": {
    "mechanism": "Ignores specific gamepad controls set by developers in the player list.",
    "purpose": "Ensures a smoother experience for players using gamepads by avoiding conflicts."
  },
  "FIntImprovedStrokesBetaFeatureRolloutPercent_Staged": {
    "mechanism": "Gradually introduces a new feature related to strokes in the game.",
    "purpose": "Allows players to experience improved drawing or painting tools in a controlled manner."
  },
  "FFlagHelpPageIXPExposure_Staged": {
    "mechanism": "Increases visibility of a help page for players.",
    "purpose": "Provides players with better access to support and information about the game."
  },
  "FFlagEnableBackgroundSignatureVerification_Staged": {
    "mechanism": "Activates a security check for game assets in the background.",
    "purpose": "Enhances security by ensuring that game assets are verified, protecting players from malicious content."
  },
  "FFlagAddVoiceExposureLayer": {
    "mechanism": "Adds a layer to manage voice chat exposure settings.",
    "purpose": "Improves player control over who can hear their voice in games."
  },
  "FFlagEnableTelemetryIntegrationCheck": {
    "mechanism": "Integrates telemetry data checks into the platform.",
    "purpose": "Enhances performance monitoring for a smoother gameplay experience."
  },
  "FFlagHidePartyVoiceLobbyMicWhenDisconnected": {
    "mechanism": "Hides the microphone icon in the party lobby when a player is disconnected.",
    "purpose": "Reduces confusion by indicating when players are not connected for voice chat."
  },
  "FFlagInExperienceContainerScreenSizeReducer_Staged": {
    "mechanism": "Reduces the size of the experience container on the screen.",
    "purpose": "Optimizes the layout for better visibility and interaction with game elements."
  },
  "FFlagPremultiplyViewportframeBackgroundColor_Staged": {
    "mechanism": "Changes how the background color of viewport frames is processed.",
    "purpose": "Improves visual consistency and aesthetics in game environments."
  },
  "FFlagRemoveLegacyChatConsoleCheck_Staged": {
    "mechanism": "Disables an old check for chat console compatibility.",
    "purpose": "Improves chat performance and reliability for players."
  },
  "DFFlagUsePhysicsMeshDecoderInBulletWrapper": {
    "mechanism": "Switches to a new method for decoding physics meshes in bullets.",
    "purpose": "Enhances the accuracy and realism of bullet physics in games."
  },
  "FFlagCheckPillSelectedPressedState_Staged": {
    "mechanism": "Updates the way the system checks if a pill button is selected or pressed.",
    "purpose": "Provides a smoother and more responsive user interface for players."
  }
}