{
  "FFlagFCDecrementVertexCount": {
    "mechanism": "Reduces the number of vertices in 3D models for better performance.",
    "purpose": "Improves game performance by making models easier to render."
  },
  "FFlagAXSavePreviousPageFromQuickMenu": {
    "mechanism": "Stores the last page visited in the quick menu for easier navigation.",
    "purpose": "Allows players to quickly return to the last menu they used."
  },
  "FFlagLuauVectorLerp": {
    "mechanism": "Enhances the way vectors are smoothly transitioned between points.",
    "purpose": "Makes movements and animations look smoother and more natural."
  },
  "FFlagEnableNoiseReductionForAudioDeviceInput": {
    "mechanism": "Applies noise reduction to audio input from devices.",
    "purpose": "Improves audio clarity during voice chats and recordings."
  },
  "FFlagLuauRefineDistributesOverUnions": {
    "mechanism": "Improves how certain operations are handled with complex shapes.",
    "purpose": "Enhances the accuracy of shape interactions in games."
  },
  "FFlagUIBloxFixModalBottomSheetSelectable": {
    "mechanism": "Fixes the selection behavior of modal bottom sheets in the UI framework.",
    "purpose": "Improves user interaction with modal dialogs, making them easier to use."
  },
  "FFlagLrMainMetrics_Staged": {
    "mechanism": "Enables tracking of main metrics for user engagement and performance.",
    "purpose": "Helps developers understand player behavior to enhance game experiences."
  },
  "FFlagSTM6819Enabled_Staged": {
    "mechanism": "Activates a specific feature related to state management in games.",
    "purpose": "Enhances game stability and performance for smoother gameplay."
  },
  "DFFlagVideoSandboxPreviewVideos_Staged": {
    "mechanism": "Allows for previewing videos in a controlled environment before full release.",
    "purpose": "Gives developers a way to test video content before it goes live, ensuring quality."
  },
  "FFlagVoiceChatEnableSdpCompressionMaster3_Staged": {
    "mechanism": "Implements advanced compression for voice chat data.",
    "purpose": "Improves voice chat quality and reduces lag during conversations."
  },
  "DFFlagCLI169073": {
    "mechanism": "Enables a specific command line interface feature for developers.",
    "purpose": "Improves the development experience by providing better tools for creating games."
  },
  "DFFlagEnableGameJoinChatTimeoutEvent_Staged": {
    "mechanism": "Introduces a timeout event for chat when joining games.",
    "purpose": "Enhances player communication by managing chat availability during game loading."
  },
  "DFFlagISRPerfPass": {
    "mechanism": "Optimizes the internal system for rendering performance.",
    "purpose": "Provides smoother gameplay and better graphics for players."
  },
  "FFlagAXEnableItemDetailsTryOnPage2": {
    "mechanism": "Allows players to try on items directly from the details page.",
    "purpose": "Makes it easier for players to see how items look before purchasing."
  },
  "DFIntDataStoreOrderedGetFixedRequestLimit_PlaceFilter": {
    "mechanism": "Adjusts the request limits for data storage with specific filters.",
    "purpose": "Improves game performance by efficiently managing data requests."
  },
  "FFlagAXAddStyleToItemCardPriceLine": {
    "mechanism": "Adds new visual styles to the price display on item cards.",
    "purpose": "Improves the appearance of item prices, making them more attractive and easier to read."
  },
  "FFlagStudioFixStandalonePluginUnloadingAsync3": {
    "mechanism": "Fixes issues with unloading plugins in a standalone environment asynchronously.",
    "purpose": "Enhances the stability of the Roblox Studio by ensuring plugins unload correctly, preventing crashes."
  },
  "FFlagAXCategoryPillScrollToStart": {
    "mechanism": "Enables scrolling to the start of category pills in the UI.",
    "purpose": "Allows players to easily navigate and view all available categories without missing any options."
  },
  "FFlagAppChatEnableHandheldScalingFixes": {
    "mechanism": "Implements fixes for scaling chat features on handheld devices.",
    "purpose": "Improves the chat experience on mobile devices, making it easier to read and interact with."
  },
  "FFlagMediaPlaybackStopsWhenJoiningExperience": {
    "mechanism": "Stops media playback when a player joins a new game or experience.",
    "purpose": "Prevents distractions from media when entering a game, allowing players to focus on the new experience."
  },
  "FFlagStudioUseUIThread_Staged": {
    "mechanism": "Enables the Studio to use the UI thread for rendering, improving performance.",
    "purpose": "Provides a smoother and more responsive experience when using Roblox Studio."
  },
  "DFFlagWriteFlagCacheAfterFlagFetch": {
    "mechanism": "Updates the flag cache after fetching flags to ensure the latest values are used.",
    "purpose": "Improves the reliability of feature flags, ensuring players experience the most current features."
  },
  "FFlagLuauNoConstraintGenRecursionLimitIce": {
    "mechanism": "Removes limits on recursive constraints in the Luau scripting language.",
    "purpose": "Allows developers to create more complex and flexible scripts without hitting recursion limits."
  },
  "DFFlagAndroidOomScoreTelemetry": {
    "mechanism": "Collects data on out-of-memory scores for Android devices.",
    "purpose": "Helps improve performance and stability for players using Roblox on Android devices."
  },
  "FFlagAppChatIllustrationsUpdate": {
    "mechanism": "Updates the chat system to include illustrations and images.",
    "purpose": "Enhances communication by allowing players to share images in chat, making interactions more engaging."
  },
  "FFlagAXMigrateEmoteMenuFromRoactGamepad_Staged": {
    "mechanism": "Moves the emote menu to a new system for better performance on gamepads.",
    "purpose": "Improves the experience of using emotes for players using game controllers."
  },
  "FFlagFixDisplaySizeVR2_Staged": {
    "mechanism": "Adjusts the display settings for VR to ensure proper sizing on headsets.",
    "purpose": "Enhances visual clarity and comfort for players using virtual reality."
  },
  "FFlagUIBloxTruncateExperienceTileMetadataTextFooter": {
    "mechanism": "Shortens the text displayed in the footer of experience tiles to fit better.",
    "purpose": "Makes it easier for players to read and understand information about games."
  },
  "FFlagVoiceChatClientRewrite_OneFlagToRuleThemAll_Client2_Staged": {
    "mechanism": "Reworks the voice chat system for improved stability and features.",
    "purpose": "Provides a more reliable and feature-rich voice chat experience for players."
  },
  "FFlagDisableRejoinGroupIdDoubleRead": {
    "mechanism": "Prevents the system from reading group IDs twice when a player rejoins.",
    "purpose": "Reduces errors and improves the efficiency of group-related features for players."
  },
  "FFlagAXMigrateCenteredModalViewToAutoFocus": {
    "mechanism": "Changes how modal views focus on input fields automatically.",
    "purpose": "Makes it easier for players to start typing in pop-up windows without clicking."
  },
  "FFlagFixDisplaySizeEnum": {
    "mechanism": "Corrects the enumeration used for display sizes in the system.",
    "purpose": "Ensures players see the right display options, improving clarity and usability."
  },
  "DFFlagFixImageContentInvalid": {
    "mechanism": "Addresses issues with displaying images that are incorrectly formatted.",
    "purpose": "Ensures players can see images properly, enhancing visual experience."
  },
  "FFlagInternalExportHandleMisnamedR15Bones": {
    "mechanism": "Fixes the handling of incorrectly named bones in R15 character models during export.",
    "purpose": "Improves character model compatibility, leading to smoother animations for players."
  },
  "FFlagFixTexturePackLoadingRetries": {
    "mechanism": "Adjusts the retry mechanism for loading texture packs when they fail initially.",
    "purpose": "Reduces loading errors, allowing players to access their favorite textures more reliably."
  },
  "FFlagFixBlurryImages": {
    "mechanism": "Improves image rendering to reduce blurriness.",
    "purpose": "Players will see clearer and sharper images in the game."
  },
  "FFlagVoiceAddWebrtClosedTransitionEnabled": {
    "mechanism": "Enhances voice chat transition using WebRTC technology.",
    "purpose": "Players experience smoother voice chat connections without interruptions."
  },
  "FFlagPerformanceTelemetryHandleSpuriousWake": {
    "mechanism": "Optimizes performance tracking by filtering out unnecessary data.",
    "purpose": "Players enjoy a more stable and responsive gaming experience."
  },
  "FFlagEnableProfilePlatformDualCta_v5_IXP": {
    "mechanism": "Introduces dual call-to-action buttons on user profiles.",
    "purpose": "Players can easily access more options to connect with friends."
  },
  "DFFlagProductInfoBatchingEnabled2_PlaceFilter": {
    "mechanism": "Groups product information requests to improve efficiency.",
    "purpose": "Players receive product details faster when browsing items."
  },
  "FFlagAddTopBarScrim": {
    "mechanism": "Adds a semi-transparent overlay to the top bar of the game interface.",
    "purpose": "Improves visibility and focus on the top bar elements."
  },
  "FFlagAXCatalogCategoryPillsShowAllCategory": {
    "mechanism": "Displays all categories in the catalog as pills for easier navigation.",
    "purpose": "Makes it simpler for players to find items by showing all categories at once."
  },
  "FFlagBuyActionBarShouldNotUnrenderInFullscreenMode": {
    "mechanism": "Prevents the buy action bar from disappearing when the game is in fullscreen mode.",
    "purpose": "Ensures players can always see the buy options while playing in fullscreen."
  },
  "DFFlagRemoveTemporaryScreenshotFilePresave": {
    "mechanism": "Eliminates the temporary file created before saving screenshots.",
    "purpose": "Streamlines the screenshot process for players, making it faster and more efficient."
  },
  "FFlagIsrMainMetrics_Staged": {
    "mechanism": "Enables a new system for tracking main metrics in a staged environment.",
    "purpose": "Helps improve game performance and player experience through better data analysis."
  },
  "FFlagFlyweightTrackId_Staged": {
    "mechanism": "Optimizes how track IDs are stored and accessed in the game engine.",
    "purpose": "Improves performance and reduces memory usage for smoother gameplay."
  },
  "DFFlagVoiceSdpCompressionRemoteEventFieldReceivesUnexpectedValue_Staged": {
    "mechanism": "Adjusts how voice data is compressed and transmitted over the network.",
    "purpose": "Enhances voice chat quality and reliability for better communication between players."
  },
  "FFlagLuauCompileVectorLerp_Staged": {
    "mechanism": "Introduces a new method for calculating vector interpolation in scripts.",
    "purpose": "Allows developers to create smoother animations and movements in games."
  },
  "FFlagAXFixManageOutfitPageFocusLostBehind": {
    "mechanism": "Fixes focus issues on the outfit management page when navigating.",
    "purpose": "Ensures players can easily manage their outfits without losing track of their selections."
  },
  "DFFlagEnableCancelTouchesOnGameViewControllerDisappear": {
    "mechanism": "Enables touch events to be canceled when the game view is closed.",
    "purpose": "Prevents unintended actions when players exit the game view, improving user experience."
  },
  "FFlagAXMigrateEmoteMenuFromRoactGamepad": {
    "mechanism": "Moves the emote menu to a new system for better performance on gamepads.",
    "purpose": "Improves the experience of using emotes on gamepads."
  },
  "FFlagAXQuickButtonsFrameShouldAlwaysExist": {
    "mechanism": "Ensures that quick action buttons are always available in the UI.",
    "purpose": "Makes it easier for players to access quick actions without searching."
  },
  "FFlagAndroidTrimMemoryCounters": {
    "mechanism": "Optimizes memory usage on Android devices to prevent crashes.",
    "purpose": "Enhances stability and performance for players on Android."
  },
  "DFFlagFixImageContentInvalid_Staged": {
    "mechanism": "Addresses issues with displaying images that are not valid.",
    "purpose": "Ensures players see the correct images without errors."
  },
  "FFlagUKOSALegacyReportMenu_Staged": {
    "mechanism": "Reintroduces an older version of the reporting menu for user feedback.",
    "purpose": "Provides a familiar reporting experience for players in the UK."
  },
  "FFlagReCacheIconsOnThemeChange": {
    "mechanism": "Rebuilds icon cache when the theme changes.",
    "purpose": "Ensures icons match the new theme for a consistent look."
  },
  "FFlagAXCategoryPillAnimationsUserMotionSettings": {
    "mechanism": "Enables animations for category pills based on user motion settings.",
    "purpose": "Provides smoother transitions and animations for a better user experience."
  },
  "FFlagFixEmoteWarningSize": {
    "mechanism": "Adjusts the size of the emote warning display.",
    "purpose": "Makes the warning more visible and easier to read for players."
  },
  "FFlagAXCategoryPillPadding": {
    "mechanism": "Modifies the padding around category pills.",
    "purpose": "Improves the layout and spacing for a cleaner interface."
  },
  "FFlagLuauOccursCheckInCommit": {
    "mechanism": "Checks for Luau occurrences during code commits.",
    "purpose": "Enhances code reliability by catching issues early in the development process."
  },
  "FFlagLuaAppsServerTriggeredModals": {
    "mechanism": "Allows server-side scripts to trigger modal dialogs in Lua applications.",
    "purpose": "Enables better user interactions by showing pop-up messages or forms based on server events."
  },
  "DFFlagRbxStorageRemoveOldCacheSkipEmpty": {
    "mechanism": "Removes outdated cached data from storage, skipping empty entries.",
    "purpose": "Improves game performance by freeing up space and ensuring only relevant data is stored."
  },
  "DFFlagBacktraceAPIQueryParamFix": {
    "mechanism": "Fixes issues with how query parameters are handled in API requests.",
    "purpose": "Ensures more reliable data retrieval, leading to smoother gameplay and fewer errors."
  },
  "FFlagAXFixFocusNavigationShiftingWidgetList": {
    "mechanism": "Corrects focus navigation issues in widget lists for accessibility.",
    "purpose": "Enhances accessibility for players using keyboard navigation, making it easier to interact with game menus."
  },
  "FFlagAXMigrateResellersCardToAutofocus": {
    "mechanism": "Changes how focus is managed on reseller cards to automatically focus on them.",
    "purpose": "Streamlines the shopping experience by making it easier for players to navigate and select reseller items."
  },
  "FFlagAXCategoryPillPositionAnimation": {
    "mechanism": "Enables animated transitions for category pill positions in the UI.",
    "purpose": "Improves the visual experience by making UI changes smoother and more appealing."
  },
  "FFlagNetworkInterface_Staged": {
    "mechanism": "Implements a new network interface system in stages for better performance.",
    "purpose": "Enhances game stability and reduces lag during gameplay."
  },
  "DFFlagLoadTestingEnabled3": {
    "mechanism": "Activates a third version of load testing tools for developers.",
    "purpose": "Allows developers to better test their games under heavy load, ensuring a smoother experience for players."
  },
  "DFIntISRInstanceBlockTimeoutWorldSteps": {
    "mechanism": "Sets a timeout limit for instance blocking during world steps in the game engine.",
    "purpose": "Prevents the game from freezing by ensuring that processes are completed in a timely manner."
  },
  "DFIntRobloxTelemetryLoadTestStartThrottleHundredthsPercent_PlaceFilter": {
    "mechanism": "Controls the percentage throttle for starting telemetry load tests based on place filters.",
    "purpose": "Helps manage server load during testing, ensuring that players experience less disruption."
  },
  "FFlagAXMigrateItemDetailsFullToAutoFocus": {
    "mechanism": "Changes how item details are displayed by automatically focusing on them.",
    "purpose": "Makes it easier for players to view and interact with item details without extra clicks."
  },
  "FFlagLrMainMetrics": {
    "mechanism": "Implements new metrics tracking for performance analysis.",
    "purpose": "Helps improve game performance by providing better insights into how games are running."
  },
  "UseApplicationLifecycleCallbacks": {
    "mechanism": "N/A (invalid)",
    "purpose": "N/A (invalid)"
  },
  "FFlagCleanUpMouseWrapMode": {
    "mechanism": "Refines the handling of mouse movement within the game environment.",
    "purpose": "Provides a smoother and more intuitive mouse control experience for players."
  },
  "FIntOcclusionSolverInitialMaxSearchIterations": {
    "mechanism": "Adjusts the number of iterations used in solving visibility calculations.",
    "purpose": "Improves rendering performance by optimizing how objects are displayed based on visibility."
  },
  "FFlagUseClientSettingAPI_IXP": {
    "mechanism": "Uses a new API to manage client settings more efficiently.",
    "purpose": "Improves the customization of player settings for a better gaming experience."
  },
  "DFFlagWriteTombstoneAfterDynamicFetch": {
    "mechanism": "Stores data after fetching it dynamically to ensure stability.",
    "purpose": "Enhances game reliability by preventing data loss during gameplay."
  },
  "FFlagAppChatEnableHandheldScalingFixes_Staged": {
    "mechanism": "Implements fixes for chat scaling on handheld devices.",
    "purpose": "Makes chat easier to read and use on mobile devices."
  },
  "FFlagDisableGalleryStopGap": {
    "mechanism": "Removes temporary measures in the gallery feature.",
    "purpose": "Provides a smoother and more consistent experience when using the gallery."
  },
  "FFlagSlimServiceEnableUploadsInNonEditMode_Staged": {
    "mechanism": "Allows uploads to occur even when not in edit mode.",
    "purpose": "Enables players to share content more freely without needing to edit."
  },
  "FFlagIsrMainMetrics": {
    "mechanism": "Enables tracking of main performance metrics in real-time.",
    "purpose": "Helps improve game performance by providing developers with better insights."
  },
  "FFlagNativeDialogManager_Staged": {
    "mechanism": "Introduces a new system for managing dialog boxes in games.",
    "purpose": "Enhances user experience by making dialogs more responsive and visually appealing."
  },
  "FFlagReverbAbsorptionFieldFileFormat": {
    "mechanism": "Updates the file format for audio reverb settings.",
    "purpose": "Improves sound quality in games by allowing more detailed audio effects."
  },
  "DFFlagMoveOctreeChecks": {
    "mechanism": "Changes how collision checks are processed in the game engine.",
    "purpose": "Increases game performance by optimizing how objects interact with each other."
  },
  "FFlagRemoveiOS13DeprecatedCode": {
    "mechanism": "Removes outdated code that is no longer supported on iOS.",
    "purpose": "Ensures smoother gameplay on newer iOS devices by eliminating compatibility issues."
  },
  "FFlagChatIntegrationFixShortcut": {
    "mechanism": "Fixes a shortcut in chat integration to improve functionality.",
    "purpose": "Enhances the chat experience by making it more reliable."
  },
  "FFlagStudioActionsMultiplePayloads": {
    "mechanism": "Allows multiple actions to be processed at once in the studio.",
    "purpose": "Speeds up the development process for creators by enabling batch actions."
  },
  "FFlagAXCategoryPillColorAnimationInstantOff": {
    "mechanism": "Changes the animation for category pill colors to turn off instantly.",
    "purpose": "Improves visual feedback for players by making color changes immediate."
  },
  "DFIntBadgeServiceMaximumBadgeGetCount_PlaceFilter": {
    "mechanism": "Sets a limit on the number of badges that can be retrieved based on the place.",
    "purpose": "Ensures players receive relevant badges without overwhelming them."
  },
  "FFlagVoiceAddWebrtClosedTransitionEnabled_Staged": {
    "mechanism": "Implements a smoother transition for voice chat features.",
    "purpose": "Provides a better voice chat experience by reducing abrupt changes."
  },
  "DFFlagEnableUpdateClientFeatureTimeoutListener2": {
    "mechanism": "Enables a listener that tracks timeouts for client feature updates.",
    "purpose": "Improves the reliability of feature updates by ensuring they are monitored for delays."
  },
  "FFlagExtendLightRangeTo120HideRolloutPropertyAndEnable": {
    "mechanism": "Increases the range of light sources in the game to 120 units and hides the rollout property.",
    "purpose": "Enhances the visual experience by allowing lights to illuminate larger areas."
  },
  "FFlagLuaAppEdpBackendV2HydrateLegacyIxp4": {
    "mechanism": "Updates the backend system to better support legacy features in Lua applications.",
    "purpose": "Ensures older features continue to work smoothly with new updates."
  },
  "FStringEngineVoiceSdpCompressionIxpLayer_Staged": {
    "mechanism": "Implements compression for voice data in the engine using a specific protocol.",
    "purpose": "Reduces the amount of data used for voice chat, improving performance and quality."
  },
  "DFFlagVideoWinHwEncoderDeleteIfNoPool": {
    "mechanism": "Removes hardware encoders for video if there are no available resources.",
    "purpose": "Optimizes video processing by freeing up resources when they are not needed."
  },
  "FFlagVideoEncoderScopedOutputBuffer_Staged": {
    "mechanism": "Improves video encoding by using a more efficient output buffer.",
    "purpose": "Enhances the quality and performance of in-game video recordings."
  },
  "FFlagLuaAppShowAgeRatingWithPlayButtonOnTileHoverWithHiddenMetadata": {
    "mechanism": "Displays age ratings when hovering over game tiles, even if metadata is hidden.",
    "purpose": "Helps players quickly see age ratings before deciding to play a game."
  },
  "FFlagMigrateEmptyResultsViewToFoundation": {
    "mechanism": "Updates the display for empty search results to a new design framework.",
    "purpose": "Provides a cleaner and more user-friendly experience when no search results are found."
  },
  "FFlagPerfDataOnTelemetryV2": {
    "mechanism": "Collects performance data using an updated telemetry system.",
    "purpose": "Improves game performance monitoring, leading to better gameplay experiences."
  },
  "FFlagCallVoiceLeaveOnNetworkDisconnect2": {
    "mechanism": "Automatically disconnects voice chat when the network connection fails.",
    "purpose": "Ensures players are not left in a voice chat when they lose their internet connection."
  },
  "FFlagIncreaseEffectiveLightGridRadius": {
    "mechanism": "Increases the radius of the light grid used for rendering in games.",
    "purpose": "Improves lighting quality and realism in games, making environments look better."
  },
  "DFIntVoiceChatHttpErrorsTelemetryThrottleHundredthsPercent": {
    "mechanism": "Monitors and limits the frequency of voice chat error reports.",
    "purpose": "Enhances the stability of voice chat by reducing spam from error messages."
  },
  "FFlagAXCatalogReactPerfIXPEnabledV3_Staged": {
    "mechanism": "Implements performance improvements in the catalog using React technology.",
    "purpose": "Makes browsing and searching for items in the catalog faster and smoother."
  },
  "FFlagUKOSALegacyReportMenu": {
    "mechanism": "Reverts the reporting menu to an older version for users in the UK.",
    "purpose": "Provides a familiar experience for players who prefer the previous reporting system."
  },
  "FIntServerTriggeredModalTrafficPercent_Staged": {
    "mechanism": "Controls the percentage of players who see server-triggered pop-up messages.",
    "purpose": "Allows for targeted communication with players, improving engagement and information delivery."
  },
  "FFlagLuaAppFixSearchTextBoxWidth": {
    "mechanism": "Adjusts the width of the search text box in the Lua app.",
    "purpose": "Improves user experience by ensuring the search box fits properly and is easier to use."
  },
  "DFFlagVoiceChatSendHttpErrorsTelemetry_Staged": {
    "mechanism": "Tracks and sends data on HTTP errors related to voice chat.",
    "purpose": "Helps developers identify and fix issues with voice chat, leading to a smoother communication experience."
  },
  "FFlagAXCategoryPillInstantFadeOut": {
    "mechanism": "Enables instant fading out of category pills in the interface.",
    "purpose": "Makes the interface cleaner and more responsive when changing categories."
  },
  "FFlagRemoveUpdatePromptChild": {
    "mechanism": "Removes the child component that prompts for updates.",
    "purpose": "Reduces interruptions for players by eliminating unnecessary update prompts."
  },
  "FStringFlipTimeStampFastString": {
    "mechanism": "Optimizes the way timestamps are processed in strings.",
    "purpose": "Enhances performance, leading to faster loading times and smoother gameplay."
  },
  "FFlagUpdateViewportOnUse3DPanelsChanged": {
    "mechanism": "Updates the game view when 3D panels are used.",
    "purpose": "Improves the visual experience by ensuring the game display updates correctly with 3D elements."
  },
  "FFlagEnableFAECancellationAnalytics_Staged": {
    "mechanism": "Tracks data on when players cancel in-game purchases.",
    "purpose": "Helps developers understand player behavior and improve the purchasing process."
  },
  "FFlagProductInfoBatchingCoalescingEnabled_PlaceFilter": {
    "mechanism": "Groups product information requests to reduce server load.",
    "purpose": "Enhances game performance by speeding up how product info is displayed to players."
  },
  "FFlagAppChatFixPaddingWhenScaling": {
    "mechanism": "Adjusts chat padding when the app is resized.",
    "purpose": "Ensures chat looks good and is easy to read on different screen sizes."
  },
  "FFlagAddDismissTopBarFocus": {
    "mechanism": "Allows players to remove focus from the top bar interface.",
    "purpose": "Gives players more control over their screen layout, improving usability."
  },
  "FFlagShowSocialContextToastToAll": {
    "mechanism": "Displays a notification about social interactions to all players in a game.",
    "purpose": "Informs players about their friends' activities, enhancing social engagement."
  },
  "FFlagRbxthumbForAlbumArt_Staged": {
    "mechanism": "Uses a new thumbnail system for displaying album art in games.",
    "purpose": "Improves the visual quality of album art, making it more appealing to players."
  },
  "FFlagVoiceConnectionApiSendSdpParsingErrorTelemetry": {
    "mechanism": "Tracks and reports errors related to voice connection setup.",
    "purpose": "Helps improve voice chat reliability by identifying and fixing connection issues."
  },
  "FFlagVideoGamePreviewSessionTracking": {
    "mechanism": "Monitors player interactions during video game previews.",
    "purpose": "Provides developers with insights on player behavior to enhance game previews."
  },
  "FFlagFixDisplaySizeEnum_Staged": {
    "mechanism": "Corrects the way display sizes are categorized in the system.",
    "purpose": "Ensures players have a better experience by accurately adjusting game visuals to their screen sizes."
  },
  "FFlagSTM6819Enabled": {
    "mechanism": "Enables a specific system for managing player data more efficiently.",
    "purpose": "Improves the overall performance and responsiveness of the game experience."
  },
  "DFFlagVoiceChatSendHttpErrorsTelemetry": {
    "mechanism": "Tracks and reports errors related to voice chat features.",
    "purpose": "Helps developers fix issues with voice chat, leading to a smoother communication experience for players."
  },
  "FFlagFCDecrementVertexCount_Staged": {
    "mechanism": "Reduces the number of vertices in 3D models to optimize rendering.",
    "purpose": "Enhances game performance by making it run faster and smoother on various devices."
  },
  "FFlagAXDisableGamepadPanning": {
    "mechanism": "Disables the feature that allows panning the camera with a gamepad.",
    "purpose": "Provides a more stable camera control experience for players using gamepads."
  },
  "FFlagAXCatalogCategoryPillsIXP_Staged": {
    "mechanism": "Introduces a new layout for displaying catalog categories.",
    "purpose": "Makes it easier for players to browse and find items in the catalog."
  },
  "FFlagEnableSocialSelfProfileViewExposureEvents": {
    "mechanism": "Tracks when players view their own profiles for analytics.",
    "purpose": "Helps improve social features by understanding how players interact with their profiles."
  },
  "FFlagStudioActionsMultiplePayloads_Staged": {
    "mechanism": "Allows multiple actions to be sent together in Roblox Studio.",
    "purpose": "Enhances the development experience by making it easier to manage changes."
  },
  "FFlagFFlagFixLayeredSorting": {
    "mechanism": "Corrects the order in which layered clothing is displayed on avatars.",
    "purpose": "Ensures that clothing items appear as intended, improving avatar customization."
  },
  "FFlagLuaAppSupportEmptyStringFooterMetadata": {
    "mechanism": "Enables support for empty string metadata in Lua applications.",
    "purpose": "Improves the functionality of apps by allowing more flexible metadata usage."
  },
  "FFlagRbxthumbForAlbumArt": {
    "mechanism": "Uses a new method for displaying album art thumbnails.",
    "purpose": "Enhances the visual presentation of music albums in the platform."
  },
  "DFFlagRemoveTemporaryScreenshotFilePresave_Staged": {
    "mechanism": "Disables the temporary storage of screenshots before saving them.",
    "purpose": "Reduces clutter and improves performance by not saving unnecessary files."
  },
  "FFlagFallbackGenericAbuseReporting": {
    "mechanism": "Enables a basic reporting system for abuse when the main system fails.",
    "purpose": "Ensures players can still report inappropriate behavior even if the primary system is down."
  },
  "FFlagAXRemoveTryOnManagerAvatarScreen": {
    "mechanism": "Removes the avatar try-on feature from the manager screen.",
    "purpose": "Simplifies the avatar customization process by focusing on essential features."
  },
  "DFFlagWriteFlagCacheAfterDynamicFetch_Staged": {
    "mechanism": "Updates the cache of feature flags after they are fetched dynamically.",
    "purpose": "Improves the speed and reliability of accessing feature flags for players."
  },
  "FFlagAXUnifiedLoggingValidation1_Staged": {
    "mechanism": "Consolidates logging for avatar-related actions into a single system.",
    "purpose": "Enhances tracking and debugging of avatar features for a smoother player experience."
  },
  "FFlagAXSendLegacyWidgetImpressions_Staged": {
    "mechanism": "Sends data about widget usage to improve analytics.",
    "purpose": "Helps developers understand how players interact with widgets, leading to better designs."
  },
  "FStringLuaOTATag_Staged": {
    "mechanism": "Adds a tag for identifying specific Lua scripts during updates.",
    "purpose": "Ensures players receive the latest features and fixes in their games."
  },
  "FFlagRemoveRespawnShortcutFromRespawnConfirmation": {
    "mechanism": "Removes a quick respawn option from the confirmation screen.",
    "purpose": "Encourages players to think about their respawn choices, enhancing gameplay strategy."
  },
  "DFFlagEnableGenerateRecommendationItemListFromRcc2_Staged": {
    "mechanism": "Generates a list of recommended items based on player data.",
    "purpose": "Provides personalized item suggestions to players, improving their shopping experience."
  },
  "FFlagEnableSpatialUIScalingFix": {
    "mechanism": "Adjusts the scaling of user interface elements based on spatial settings.",
    "purpose": "Ensures UI elements are properly sized and positioned for better visibility and usability."
  },
  "FFlagFixLockCenterMouseClickAndScroll_Staged": {
    "mechanism": "Fixes issues with mouse locking and scrolling behavior in the game.",
    "purpose": "Improves player control and navigation while using the mouse."
  },
  "DFFlagInferredCrashReportToBacktraceRegister": {
    "mechanism": "Enhances crash reporting by linking inferred issues to a backtrace system.",
    "purpose": "Helps developers identify and fix crashes more effectively, leading to a smoother gaming experience."
  },
  "DFFlagEnableGenerateRecommendationItemListFromRcc2": {
    "mechanism": "Generates item recommendations based on player preferences using a new system.",
    "purpose": "Provides players with personalized item suggestions to enhance their experience."
  },
  "FFlagAXCategoryPillScrollToStart_Staged": {
    "mechanism": "Adjusts the scrolling behavior of category pills in the user interface.",
    "purpose": "Makes it easier for players to navigate through categories and find what they want."
  },
  "FStringLuaOTATag": {
    "mechanism": "Introduces a tagging system for Lua scripts to manage updates.",
    "purpose": "Allows for better organization and tracking of script changes, improving game performance."
  },
  "FFlagReverbAbsorptionField": {
    "mechanism": "Adjusts sound properties in specific areas to create realistic audio effects.",
    "purpose": "Enhances the gaming experience by making sounds feel more immersive and natural."
  },
  "DFIntAssetProviderCdnBytesThrottleHundrethsPercent2": {
    "mechanism": "Limits the amount of data sent from the asset server to manage bandwidth usage.",
    "purpose": "Improves game performance and loading times by optimizing data delivery."
  },
  "DFIntLoadTestStartTimeUnix_PlaceFilter": {
    "mechanism": "Sets a specific time for testing game loading under certain conditions.",
    "purpose": "Helps developers understand and improve how quickly their games load for players."
  },
  "FFlagFixKeyboardFocusInfiniteLoop": {
    "mechanism": "Resolves an issue where keyboard focus could get stuck in a loop.",
    "purpose": "Ensures players can interact with the game smoothly without control issues."
  },
  "FFlagFFlagIconHostSetZIndexToDefault": {
    "mechanism": "Restores the default layering order for icons in the user interface.",
    "purpose": "Improves visual clarity and organization in the game's interface for players."
  },
  "FFlagLuaAppFocusFixTopBanner_Staged": {
    "mechanism": "Fixes issues with the top banner when the app loses focus.",
    "purpose": "Ensures the top banner displays correctly, improving user experience."
  },
  "FFlagCachelessPluginLoading2": {
    "mechanism": "Loads plugins without using cached data.",
    "purpose": "Provides faster and more reliable plugin loading for users."
  },
  "FFlagLuaAppRecommendedGamesCollectionCarousel": {
    "mechanism": "Introduces a carousel feature for displaying recommended games.",
    "purpose": "Enhances game discovery by showcasing recommended games in a visually appealing way."
  },
  "DFFlagEnableUpdateClientFeatureTimeoutListener2_Staged": {
    "mechanism": "Implements a listener for client update timeouts.",
    "purpose": "Improves game stability by better handling situations where updates take too long."
  },
  "FFlagAXBackgroundSceneManagerRevamp3_Staged": {
    "mechanism": "Revamps the management of background scenes in the app.",
    "purpose": "Enhances performance and visual quality of background scenes for players."
  },
  "FFlagCapturesAddSavePromptVideoLog": {
    "mechanism": "Adds a log entry when a save prompt is shown during video capture.",
    "purpose": "Helps developers track when players are prompted to save their progress while recording."
  },
  "FFlagLuauNoConstraintGenRecursionLimitIce_Staged": {
    "mechanism": "Removes limits on recursion for certain code generation processes in Luau.",
    "purpose": "Allows developers to write more complex scripts without hitting recursion limits, improving game functionality."
  },
  "FFlagOnlyVisibleFramesAllowModal": {
    "mechanism": "Restricts modal pop-ups to only appear on visible frames in the UI.",
    "purpose": "Enhances user experience by ensuring that pop-ups do not interfere with the gameplay when frames are not visible."
  },
  "DFFlagVoiceSdpCompressionSendSizeTelemetry": {
    "mechanism": "Collects data on the size of compressed voice data sent during gameplay.",
    "purpose": "Improves voice chat performance by analyzing data transmission sizes, leading to better communication quality."
  },
  "FIntServerTriggeredModalTrafficPercent": {
    "mechanism": "Controls the percentage of players who will see server-triggered modal pop-ups.",
    "purpose": "Allows for testing and gradual rollout of new pop-ups to ensure they are effective without overwhelming players."
  },
  "FFlagLuaAppAddSchemaFieldsToGameClicks": {
    "mechanism": "Adds new data fields to track game clicks in Lua applications.",
    "purpose": "Improves analytics for developers by providing more detailed information about player interactions."
  },
  "DFStringLoadTestingUniverseId_PlaceFilter": {
    "mechanism": "Filters places in load testing based on a specific universe ID.",
    "purpose": "Helps developers test specific games more effectively by focusing on relevant places."
  },
  "DFFlagEnableContextForGenerateList": {
    "mechanism": "Enables context-aware generation of lists in the game engine.",
    "purpose": "Enhances the gameplay experience by making list generation more relevant and tailored to the player's context."
  },
  "DFFlagVoiceSdpCompressionSendSizeTelemetry_Staged": {
    "mechanism": "Tracks the size of compressed voice data sent over the network.",
    "purpose": "Improves voice chat quality by optimizing data transmission based on real usage metrics."
  },
  "FFlagFCSkeletonIgnoreUnusedPartsCheckFaceControls_Staged": {
    "mechanism": "Allows the system to ignore certain unused parts when checking face controls in character models.",
    "purpose": "Enhances performance and responsiveness of character animations by reducing unnecessary checks."
  },
  "FFlagLuaAppFocusFixTopBanner": {
    "mechanism": "Fixes a bug where the top banner doesn't respond correctly when the app is focused.",
    "purpose": "Ensures the top banner behaves properly, improving user experience."
  },
  "FFlagAXCategoryPillColorAnimationInstantOff_Staged": {
    "mechanism": "Changes the animation of category pills to instantly stop when not in use.",
    "purpose": "Makes the interface feel more responsive and visually appealing."
  },
  "DFStringAllowedPublicFlags_Staged": {
    "mechanism": "Defines a list of flags that can be accessed publicly for testing.",
    "purpose": "Allows developers to test features more easily, enhancing game development."
  },
  "FFlagSduiComponentSkipParseLocalProps": {
    "mechanism": "Optimizes the parsing process for local properties in UI components.",
    "purpose": "Improves performance and loading times for user interfaces."
  },
  "DFFlagEditableMeshFastClusterSkipLoD": {
    "mechanism": "Skips certain level of detail checks for editable meshes to speed up rendering.",
    "purpose": "Enhances game performance by making meshes load faster."
  },
  "FFlagEnableAdOpportunityTracker4_PlaceFilter": {
    "mechanism": "Enables a filter for ad opportunities based on the place context.",
    "purpose": "Helps developers better target ads to players in specific game locations."
  },
  "FStringFlagRepoGitHashFastString": {
    "mechanism": "Stores a fast-access string of the Git hash for version control.",
    "purpose": "Improves the speed of retrieving version information for updates."
  },
  "FFlagNativeDialogManager": {
    "mechanism": "Introduces a new system for managing dialog boxes natively.",
    "purpose": "Enhances the user experience by providing smoother and more consistent dialog interactions."
  },
  "FStringIxpNewLayersForRegistration": {
    "mechanism": "Implements new layers for user registration processes.",
    "purpose": "Streamlines the registration experience for new users, making it easier to sign up."
  },
  "FFlagCoreComponentManagerEmitAssetDMKeyTelemetry": {
    "mechanism": "Tracks and sends telemetry data related to asset management.",
    "purpose": "Improves asset management by providing insights into how assets are used and managed."
  },
  "DFFlagWriteFlagCacheAfterDynamicFetch": {
    "mechanism": "Caches flags after they are fetched dynamically to improve access speed.",
    "purpose": "Players experience faster loading times for features that rely on these flags."
  },
  "FFlagFixLockCenterMouseClickAndScroll": {
    "mechanism": "Fixes issues with mouse click and scroll locking in the game interface.",
    "purpose": "Players can interact with the game more smoothly without unexpected mouse behavior."
  },
  "FFlagEngineVoiceSdpCompressionIxpEnabled_Staged": {
    "mechanism": "Enables compression for voice data during communication in games.",
    "purpose": "Players enjoy clearer voice chat with reduced lag and better performance."
  },
  "DFFlagLoadTestingEnabled3_PlaceFilter": {
    "mechanism": "Implements a filtering system for places during load testing.",
    "purpose": "Players benefit from a more stable and optimized game experience during testing phases."
  },
  "FFlagFixEmoteWarningSize_Staged": {
    "mechanism": "Adjusts the size of warning messages related to emotes in the game.",
    "purpose": "Players receive clearer and more appropriately sized warnings, enhancing usability."
  },
  "DFIntTextChatCommandClientSentThrottlePermyriad": {
    "mechanism": "Limits how often players can send chat commands to reduce spam.",
    "purpose": "Helps keep chat clean and manageable for better communication."
  },
  "FFlagAppChatConversationOverlayRefactor": {
    "mechanism": "Updates the chat overlay for improved performance and usability.",
    "purpose": "Provides a smoother and more user-friendly chat experience."
  },
  "FFlagReconnectToSameServer": {
    "mechanism": "Allows players to reconnect to the same game server after disconnection.",
    "purpose": "Ensures players can return to their game without losing progress."
  },
  "FFlagSduiSupportArrayParsing": {
    "mechanism": "Enhances the way the game handles and processes UI elements in arrays.",
    "purpose": "Improves the performance and flexibility of user interfaces in games."
  },
  "FFlagPlaceVersionHistoryMetadataRCC_Staged": {
    "mechanism": "Enables tracking of different versions of game places for better management.",
    "purpose": "Allows developers to manage and revert to previous versions of their games easily."
  },
  "DFFlagAudioSpeechToTextRequireVoiceChat2": {
    "mechanism": "Requires players to use voice chat for speech-to-text features.",
    "purpose": "Allows players to convert spoken words into text during voice chat."
  },
  "FFlagEnableAudioSpeechToText_PlaceFilter": {
    "mechanism": "Enables filtering of speech-to-text results based on the game environment.",
    "purpose": "Improves the relevance of transcribed speech by considering the game's context."
  },
  "FFlagProductInfoBatchingCoalescingEnabled_Staged": {
    "mechanism": "Groups multiple product information requests into a single batch for efficiency.",
    "purpose": "Reduces loading times and improves performance when accessing product details."
  },
  "FFlagProductInfoBatchingCoalescingEnabled": {
    "mechanism": "Combines product info requests to minimize server load and response time.",
    "purpose": "Enhances user experience by speeding up the retrieval of product information."
  },
  "FFlagExtendedLightRangesFixDirtyCrash": {
    "mechanism": "Fixes issues related to lighting ranges that could cause crashes.",
    "purpose": "Improves game stability and visual quality by ensuring better lighting performance."
  },
  "FFlagEnableProfilePlatformDualCta_v5": {
    "mechanism": "Enables a dual call-to-action button on profile pages for different platforms.",
    "purpose": "Makes it easier for players to take actions on profiles, improving user experience."
  },
  "FFlagMicroprofilerBigButtons": {
    "mechanism": "Increases the size of buttons in the microprofiler tool for better visibility.",
    "purpose": "Helps developers easily access performance metrics, enhancing game optimization."
  },
  "FFlagEnableConfirmButtonIconOnPlaystation": {
    "mechanism": "Adds a confirmation button icon specifically for PlayStation controllers.",
    "purpose": "Improves clarity for PlayStation users when confirming actions in games."
  },
  "DFFlagAndroidDebugHeapTelemetry": {
    "mechanism": "Collects detailed memory usage data for debugging on Android devices.",
    "purpose": "Aids developers in identifying and fixing memory issues, leading to smoother gameplay."
  },
  "FFlagEnableAppChatFocusableFixes2": {
    "mechanism": "Fixes focus issues in the app chat interface to ensure it works correctly.",
    "purpose": "Enhances chat functionality for players, making communication more reliable."
  },
  "FFlagUITextureRendererUseNewRenderPath_Staged": {
    "mechanism": "Switches to a new method for rendering UI textures.",
    "purpose": "Improves the visual quality and performance of user interfaces."
  },
  "FFlagFixTexturePackLoadingRetries_Staged": {
    "mechanism": "Fixes issues with retrying the loading of texture packs.",
    "purpose": "Ensures that texture packs load correctly, enhancing the game's appearance."
  },
  "DFFlagSkipSavingEmptyCapture": {
    "mechanism": "Prevents saving empty capture data.",
    "purpose": "Reduces unnecessary data storage, improving game performance."
  },
  "FFlagISREarlyFilterAnimatedJoints": {
    "mechanism": "Applies filters to animated joints earlier in the rendering process.",
    "purpose": "Enhances the smoothness and responsiveness of character animations."
  },
  "FFlagFCSkeletonIgnoreUnusedPartsCheckFaceControls": {
    "mechanism": "Ignores checks for unused parts in skeletons when handling face controls.",
    "purpose": "Streamlines character customization, allowing for more flexible designs."
  },
  "FFlagUITextureRendererUseNewRenderPath": {
    "mechanism": "Switches the method used to render UI textures to a more efficient process.",
    "purpose": "Improves the visual quality and performance of UI elements in games."
  },
  "FFlagCorrectGuiStateMouseDownAndroid": {
    "mechanism": "Fixes how mouse down events are handled on Android devices.",
    "purpose": "Ensures that touch interactions work correctly, enhancing gameplay on Android."
  },
  "FFlagEnableSocialSelfProfileViewExposureEvents_Staged": {
    "mechanism": "Tracks when players view their own profile in social features.",
    "purpose": "Helps improve social features by understanding how players interact with their profiles."
  },
  "DFFlagVoiceSdpCompressionSendProtoParseErrorTelemetry_Staged": {
    "mechanism": "Collects data on errors related to voice communication protocol parsing.",
    "purpose": "Aims to enhance voice chat reliability by identifying and fixing issues."
  },
  "FFlagCreateConnectionInternalEarlierServer": {
    "mechanism": "Establishes a connection to the server earlier in the game loading process.",
    "purpose": "Reduces waiting time for players, leading to a faster game start."
  },
  "FFlagSlimServiceEnableUploadsInNonEditMode": {
    "mechanism": "Allows users to upload assets even when not in edit mode.",
    "purpose": "Enables players to quickly add content without needing to enter edit mode."
  },
  "FStringTextureTranscodeFidelityETC": {
    "mechanism": "Improves the quality of texture compression for better visuals.",
    "purpose": "Enhances the appearance of textures in games, making them look sharper and more detailed."
  },
  "FFlagAXExternalItemDetailsOverlay": {
    "mechanism": "Introduces a new overlay for viewing item details from external sources.",
    "purpose": "Provides players with more information about items without leaving the game."
  },
  "DFIntVoiceChatHttpErrorsTelemetryThrottleHundredthsPercent_Staged": {
    "mechanism": "Monitors and limits the frequency of voice chat error reports.",
    "purpose": "Improves the reliability of voice chat by reducing unnecessary error notifications."
  },
  "FFlagAXCatalogCategoryPillsIXP": {
    "mechanism": "Updates the way catalog categories are displayed with a new pill design.",
    "purpose": "Makes it easier for players to navigate and find items in the catalog."
  },
  "DFFlagSolverV2CleanupPendingModelStreamingModeModels": {
    "mechanism": "Improves the management of streaming models in the game engine.",
    "purpose": "Enhances game performance by reducing lag when loading models."
  },
  "FFlagProfilePlatformEnableEditAvatar_IXP": {
    "mechanism": "Allows users to edit their avatars directly from the platform interface.",
    "purpose": "Makes it easier for players to customize their avatars without navigating away from their profile."
  },
  "FFlagAXCategoryPillColorAnimation": {
    "mechanism": "Introduces animated color transitions for category pills in the UI.",
    "purpose": "Provides a more visually appealing and engaging user interface experience."
  },
  "FFlagPassTextAlignmentRelevancyInfo_Staged": {
    "mechanism": "Adjusts how text alignment is handled in game passes.",
    "purpose": "Improves readability and presentation of information for players purchasing game passes."
  },
  "DFIntTextChatCommandClientSentThrottlePermyriad_Staged": {
    "mechanism": "Limits the frequency of chat commands sent by players to prevent spam.",
    "purpose": "Ensures a cleaner chat experience by reducing clutter and improving communication."
  },
  "FFlagLuaAppAddSortDataToPymkCarouselClicks": {
    "mechanism": "N/A (invalid)",
    "purpose": "N/A (invalid)"
  },
  "DFIntTextChatMessageClientReceivedThrottlePermyriad_Staged": {
    "mechanism": "N/A (invalid)",
    "purpose": "N/A (invalid)"
  },
  "FFlagLuauTypeCheckerVectorLerp_Staged": {
    "mechanism": "N/A (invalid)",
    "purpose": "N/A (invalid)"
  },
  "FFlagFixToggleMenuIconForTheFive_Staged": {
    "mechanism": "N/A (invalid)",
    "purpose": "N/A (invalid)"
  },
  "FFlagSelfieConsentDialogDontUsePortal": {
    "mechanism": "N/A (invalid)",
    "purpose": "N/A (invalid)"
  },
  "FFlagNewBindToMessageError_Staged": {
    "mechanism": "Improves error handling for message binding in scripts.",
    "purpose": "Helps developers identify issues more easily, leading to smoother gameplay."
  },
  "DFStringDataStoreRdbShadowTrafficRolloutConfig_PlaceFilter": {
    "mechanism": "Introduces a filtering system for data storage based on place.",
    "purpose": "Enhances data management, ensuring players' data is more accurately saved and retrieved."
  },
  "DFFlagSkipSavingEmptyCapture_Staged": {
    "mechanism": "Prevents saving empty data captures to the database.",
    "purpose": "Reduces unnecessary data clutter, improving performance and load times for players."
  },
  "FFlagAppChatFixPaddingWhenScaling_Staged": {
    "mechanism": "Adjusts the chat interface padding when the app is resized.",
    "purpose": "Ensures a better visual experience in chat, making it easier for players to read messages."
  },
  "FFlagAXMigrateItemOwnerShipPageToAutofocus": {
    "mechanism": "Changes the item ownership page to automatically focus on the main input field.",
    "purpose": "Streamlines the user experience, allowing players to interact with items more quickly."
  },
  "FFlagProfilePlatformEnableClickToCopyUsername": {
    "mechanism": "Enables a feature that allows users to click on usernames to copy them to the clipboard.",
    "purpose": "Makes it easier for players to share usernames without typing them out."
  },
  "DFFlagVideoWinHwEncoderDeleteIfNoPool_Staged": {
    "mechanism": "Adjusts video encoding settings to delete hardware encoder instances if they are not in use.",
    "purpose": "Improves system performance by freeing up resources when video encoding is not needed."
  },
  "FFlagEnableCVSUrlForOtaPatch_Staged": {
    "mechanism": "Allows the use of a specific URL format for over-the-air updates.",
    "purpose": "Streamlines the update process for players, ensuring they receive the latest features and fixes more efficiently."
  },
  "FFlagVideoEncoderScopedOutputBuffer": {
    "mechanism": "Implements a scoped output buffer for video encoding to manage data more effectively.",
    "purpose": "Enhances video quality and reduces lag during streaming for players."
  },
  "FFlagAddFriendsConsistentFocusActions": {
    "mechanism": "Standardizes the actions available when interacting with friends in the game.",
    "purpose": "Improves user experience by making it easier and more intuitive to manage friend interactions."
  },
  "DFIntProductIdProductInfoCacheLifetimeSeconds_PlaceFilter": {
    "mechanism": "Sets the duration for how long product information is stored before needing to be refreshed, specifically for certain places.",
    "purpose": "Improves loading times for product info in specific games, making it faster for players to see items."
  },
  "FFlagAXSendLegacyWidgetImpressions": {
    "mechanism": "Enables tracking of interactions with older style widgets for analytics.",
    "purpose": "Helps developers understand player engagement with older features, allowing for better game improvements."
  },
  "FixIsolatedGmaSdkCleanDisconnect": {
    "mechanism": "N/A (invalid)",
    "purpose": "N/A (invalid)"
  },
  "DFStringFlagRepoGitHashDynamicString": {
    "mechanism": "Stores a dynamic string that represents the current version of the codebase.",
    "purpose": "Allows for better tracking of updates and changes in the game, ensuring players always have the latest features."
  },
  "DFFlagISRAdjustMtu": {
    "mechanism": "Modifies the maximum transmission unit (MTU) settings for network packets.",
    "purpose": "Improves network performance and stability for players, leading to a smoother gaming experience."
  },
  "FFlagEnableAutomaticGainControlForAudioDeviceInput": {
    "mechanism": "Automatically adjusts audio input levels for better sound quality.",
    "purpose": "Ensures players' voices are heard clearly during voice chats."
  },
  "FFlagShowSocialContextToastToAll_Staged": {
    "mechanism": "Displays notifications about social interactions to all players.",
    "purpose": "Keeps players informed about their friends' activities and interactions."
  },
  "FFlagUIEditorActionURI": {
    "mechanism": "Allows users to perform actions in the UI editor through specific links.",
    "purpose": "Simplifies the process of editing user interfaces for developers."
  },
  "DFStringLoadTestingUniverseId": {
    "mechanism": "Identifies a specific universe for load testing purposes.",
    "purpose": "Helps developers test their games under heavy user loads to improve performance."
  },
  "FFlagEnableAppNavGamepadRemoval": {
    "mechanism": "Removes the gamepad navigation feature from the app.",
    "purpose": "Streamlines navigation for players who prefer using touch or keyboard controls."
  },
  "FFlagLuauCompileVectorLerp": {
    "mechanism": "Enables a more efficient way to calculate vector interpolation in scripts.",
    "purpose": "Improves the performance of games that use vector lerping, making animations smoother."
  },
  "DFIntRobloxTelemetryLoadTestEndThrottleHundredthsPercent_PlaceFilter": {
    "mechanism": "Adjusts how data is collected during load tests for specific places.",
    "purpose": "Helps developers understand how their games perform under stress, leading to better optimization."
  },
  "FFlagAXDisableHiddenCatalogCategoryPills": {
    "mechanism": "Removes visual indicators for hidden categories in the catalog.",
    "purpose": "Simplifies the catalog interface for players, making it easier to find items."
  },
  "FFlagConvertVariantToCorrectType": {
    "mechanism": "Ensures that item variants are processed with the correct data types.",
    "purpose": "Prevents errors and improves the reliability of item customization options for players."
  },
  "FFlagAXAddOverlayFocusHandlerToPurchaseLookPrompt": {
    "mechanism": "Adds functionality to manage focus on purchase prompts in overlays.",
    "purpose": "Enhances the user experience by making it easier to navigate purchase options."
  },
  "FFlagMediaPlaybackStopsWhenJoiningExperience_Staged": {
    "mechanism": "Stops media playback when a player joins a game.",
    "purpose": "Prevents audio or video from playing while loading into a new experience."
  },
  "DFIntJoinLimitWin32x64_Staged": {
    "mechanism": "Sets a limit on the number of players joining on 64-bit Windows.",
    "purpose": "Helps manage server performance by controlling how many players can join at once."
  },
  "FFlagAXFixBuyActionBarNotAppearing2": {
    "mechanism": "Fixes an issue where the buy action bar doesn't show up correctly.",
    "purpose": "Ensures players can see and use the buy options in games."
  },
  "DFStringLoadTestArguments_PlaceFilter": {
    "mechanism": "Introduces a filter for testing specific places during load tests.",
    "purpose": "Improves testing accuracy by allowing developers to focus on certain game areas."
  },
  "FFlagLuauVectorLerp_Staged": {
    "mechanism": "Enhances the way vector interpolation works in the Luau scripting language.",
    "purpose": "Allows smoother movement and transitions for objects in games."
  },
  "FFlagAddSwitchTabHintsToIEM2": {
    "mechanism": "Adds hints for switching tabs in the interface.",
    "purpose": "Helps players easily navigate between different tabs."
  },
  "DFFlagVideoSandboxPreviewVideos": {
    "mechanism": "Enables a preview feature for videos in the sandbox environment.",
    "purpose": "Allows players to see a preview of videos before using them."
  },
  "FFlagEngineVoiceSdpCompressionIxpEnabled_IXP": {
    "mechanism": "Implements compression for voice data in the engine.",
    "purpose": "Improves voice chat quality and reduces lag during conversations."
  },
  "DFIntLoadTestParticipationPerMillionUsers_PlaceFilter": {
    "mechanism": "Sets a limit on the number of users participating in load tests based on place filters.",
    "purpose": "Ensures smoother gameplay by managing server load during tests."
  },
  "FFlagCallVoiceLeaveOnNetworkDisconnect2_Staged": {
    "mechanism": "Automatically disconnects voice chat when the network connection drops.",
    "purpose": "Prevents players from being stuck in voice chat during connection issues."
  },
  "FFlagVoiceConnectionApiSendSdpParsingErrorTelemetry_Staged": {
    "mechanism": "Sends data about errors in processing voice connection information.",
    "purpose": "Helps improve voice chat reliability by tracking issues."
  },
  "FFlagFixDisplaySizeVR2": {
    "mechanism": "Adjusts how display sizes are calculated for VR devices.",
    "purpose": "Enhances the visual experience in VR by ensuring proper scaling."
  },
  "FFlagProfilePlatformEnableClickToCopyUsername_Staged": {
    "mechanism": "Adds a feature to copy usernames with a click.",
    "purpose": "Makes it easier for players to share usernames quickly."
  },
  "FFlagRemoveLeaveShortcutFromLeaveConfirm": {
    "mechanism": "Removes the shortcut to leave a game from the confirmation dialog.",
    "purpose": "Prevents accidental game exits by requiring confirmation."
  },
  "FFlagDisableEtcFallback": {
    "mechanism": "Stops using a backup method for certain features.",
    "purpose": "Improves performance by relying on the primary method only."
  },
  "FFlagAddFriendsEmptyStateUpdate": {
    "mechanism": "Updates the UI to show a message when there are no friends to display.",
    "purpose": "Helps players understand why their friends list is empty."
  },
  "DFFlagEnableGameJoinChatTimeoutEvent": {
    "mechanism": "Introduces a timeout event for chat when joining a game.",
    "purpose": "Improves communication by ensuring chat is available after joining a game."
  },
  "FFlagStudioUseUIThread": {
    "mechanism": "Switches the user interface rendering to a separate thread for better performance.",
    "purpose": "Enhances the experience for developers by making the studio interface smoother."
  },
  "FFlagFlyweightTrackId": {
    "mechanism": "Optimizes how track IDs are managed to reduce memory usage.",
    "purpose": "Improves game performance by making it more efficient in handling audio tracks."
  },
  "DFFlagEditableMeshFastClusterSkipLoD_Staged": {
    "mechanism": "Allows skipping levels of detail for editable meshes in a staged environment.",
    "purpose": "Speeds up the editing process for developers working with complex models."
  },
  "FFlagAXMigrateQuickButtonsToGlobalAutoFocus": {
    "mechanism": "Moves quick action buttons to a global focus system for easier access.",
    "purpose": "Makes it simpler for players to use quick buttons without having to click around."
  },
  "FFlagSelfieConsentDontMountUnused": {
    "mechanism": "Prevents unnecessary loading of selfie features if not used.",
    "purpose": "Improves game performance by not loading features that players won't use."
  },
  "FFlagReconnectToSameServer_Staged": {
    "mechanism": "Allows players to reconnect to the same game server after disconnecting.",
    "purpose": "Provides a smoother experience by keeping players in the same game session."
  },
  "FFlagLuaAppAddSortDataToSocialCarouselClicks": {
    "mechanism": "Adds sorting data to clicks in the social feature carousel.",
    "purpose": "Enhances the organization of social interactions, making it easier for players to find friends."
  },
  "DFIntDataStoreFixedRequestLimit_PlaceFilter": {
    "mechanism": "Fixes the request limit for data storage when filtering places.",
    "purpose": "Ensures players can access their game data more reliably without hitting limits."
  },
  "DFStringLoadTestName_PlaceFilter": {
    "mechanism": "Filters place names during loading tests to ensure consistency.",
    "purpose": "Helps improve the loading experience by managing how place names are displayed."
  },
  "FFlagPassTextAlignmentRelevancyInfo": {
    "mechanism": "Passes additional information about text alignment to rendering systems.",
    "purpose": "Enhances text display by ensuring proper alignment, making it easier to read."
  },
  "FFlagEngineVoiceChatClientRewriteIxpEnabled_IXP": {
    "mechanism": "Implements a new system for handling voice chat on the client side.",
    "purpose": "Improves voice chat quality and reliability for players during interactions."
  },
  "FFlagStudioTasksFutureShareMutexes_Staged": {
    "mechanism": "Introduces a system for managing shared resources in the studio environment.",
    "purpose": "Enhances performance and stability when multiple tasks are running in Roblox Studio."
  },
  "FFlagLuauTypeCheckerVectorLerp": {
    "mechanism": "Enables type checking for vector interpolation functions in Luau.",
    "purpose": "Helps developers catch errors early, leading to smoother animations and movements in games."
  },
  "FFlagVideoWinEncodeSampleTracking": {
    "mechanism": "Tracks video encoding samples for performance analysis.",
    "purpose": "Improves video quality and playback experience for users."
  },
  "FFlagLuaAppsServerTriggeredModals_Staged": {
    "mechanism": "Enables server-triggered pop-up modals in Lua applications.",
    "purpose": "Allows developers to show important messages or prompts to players during gameplay."
  },
  "DFIntJoinLimitWin32x64": {
    "mechanism": "Sets a limit on the number of players joining on 64-bit Windows systems.",
    "purpose": "Ensures smoother gameplay by managing server load effectively."
  },
  "FFlagEnableCVSUrlForOtaPatch": {
    "mechanism": "Allows the use of CVS URLs for over-the-air updates.",
    "purpose": "Facilitates easier and faster updates for players without manual downloads."
  },
  "FFlagPurchasePromptPriceShouldUseProductInfoPrice2": {
    "mechanism": "Updates the purchase prompt to reflect the latest product pricing.",
    "purpose": "Ensures players see accurate prices when making purchases, reducing confusion."
  },
  "DFFlagVoiceSdpCompressionRemoteEventFieldReceivesUnexpectedValue": {
    "mechanism": "Handles unexpected values in voice communication data.",
    "purpose": "Improves reliability of voice chat by preventing errors."
  },
  "FFlagRefactorIsTopBarFocused": {
    "mechanism": "Changes how the top bar's focus state is managed in the UI.",
    "purpose": "Enhances user experience by making the interface more responsive."
  },
  "FStringEngineVoiceSdpCompressionIxpLayer_IXP": {
    "mechanism": "Defines a specific layer for voice data compression in the engine.",
    "purpose": "Optimizes voice quality and reduces data usage during chats."
  },
  "FFlagCustomDspBaseSupportsSidechain": {
    "mechanism": "Enables sidechain audio processing in custom DSP setups.",
    "purpose": "Allows for more advanced audio effects in voice chat."
  },
  "FStringEngineVoiceSdpCompressionIxpLayer": {
    "mechanism": "Specifies the compression layer for voice data in the engine.",
    "purpose": "Improves the efficiency of voice communication."
  },
  "FFlagSongbirdPopoverSubmenu2": {
    "mechanism": "Enables a new design for pop-up menus in the Songbird feature.",
    "purpose": "Improves user experience by making menu navigation easier and more intuitive."
  },
  "DFFlagISRBlockStaleCFrameImprovements": {
    "mechanism": "Prevents outdated position data from affecting game performance.",
    "purpose": "Enhances game stability and responsiveness for smoother gameplay."
  },
  "FFlagCommunicationsFixLastInputMode": {
    "mechanism": "Fixes issues with tracking the last input method used by players.",
    "purpose": "Ensures that players' preferred input methods are remembered correctly, improving accessibility."
  },
  "FFlagAXUseDefaultFocusHandlerInFocusedWidgetTopContent": {
    "mechanism": "Implements a standard focus management system for UI elements.",
    "purpose": "Makes it easier for players to navigate through user interface components, especially for those using assistive technologies."
  },
  "FStringTutorialUpsellPlaceId": {
    "mechanism": "Links tutorial prompts to specific game places for better guidance.",
    "purpose": "Helps new players find relevant tutorials directly related to the game they are playing."
  },
  "FFlagFixKeyboardFocusInfiniteLoop_Staged": {
    "mechanism": "Fixes a bug where keyboard focus could get stuck in a loop.",
    "purpose": "Ensures players can navigate the game without keyboard input issues."
  },
  "FFlagAXMIgrateItemDetailsModalToAutofocus": {
    "mechanism": "Moves the item details modal to automatically focus when opened.",
    "purpose": "Makes it easier for players to interact with item details quickly."
  },
  "FFlagRemoveiOS13DeprecatedCode_Staged": {
    "mechanism": "Removes outdated code that is no longer supported on iOS 13.",
    "purpose": "Improves app performance and stability for players using newer iOS versions."
  },
  "FFlagVoiceChatClientRewrite_OneFlagToRuleThemAll_Client2_IXP": {
    "mechanism": "Rewrites the voice chat system for better performance and reliability.",
    "purpose": "Enhances the voice chat experience for players, making communication smoother."
  },
  "DFFlagISRDoNotCrashCanSkipNewInstanceCheckIfPropNull": {
    "mechanism": "Prevents crashes by allowing certain checks to be skipped if properties are null.",
    "purpose": "Improves game stability and reduces crashes for players."
  },
  "FFlagStudioTasksFutureShareMutexes": {
    "mechanism": "Implements a system to manage shared resources in tasks more efficiently.",
    "purpose": "Improves performance and stability when multiple tasks are running simultaneously in Studio."
  },
  "FFlagNetworkInterface": {
    "mechanism": "Introduces a new way for different parts of the game to communicate over the network.",
    "purpose": "Enhances the reliability and speed of data exchange during gameplay."
  },
  "FFlagFixHapticWaveformReplication": {
    "mechanism": "Corrects how haptic feedback signals are sent to devices.",
    "purpose": "Ensures that players receive accurate and responsive vibrations during gameplay."
  },
  "DFFlagUseVisBugChecks_PlaceFilter": {
    "mechanism": "Adds checks for visual bugs when filtering places.",
    "purpose": "Helps players find and access places without visual errors, improving their experience."
  },
  "FFlagStudioFixStandalonePluginUnloadingAsync3_Staged": {
    "mechanism": "Fixes issues with unloading plugins in a more efficient manner.",
    "purpose": "Prevents crashes and improves the overall stability of Studio when using plugins."
  },
  "FFlagAXEnableCategoryPills4": {
    "mechanism": "Enables a new UI component for categorizing items.",
    "purpose": "Improves navigation by allowing players to easily find and filter items."
  },
  "FFlagVoiceChatEnableSdpCompressionMaster3_IXP": {
    "mechanism": "Activates compression for voice chat data transmission.",
    "purpose": "Enhances voice chat quality and reduces lag during conversations."
  },
  "FFlagSongbirdPopoverSubmenu2_Staged": {
    "mechanism": "Introduces a new submenu for songbird features.",
    "purpose": "Makes it easier for players to access music-related options and settings."
  },
  "FFlagPlaceVersionHistoryMetadataRCC": {
    "mechanism": "Adds metadata tracking for different versions of game places.",
    "purpose": "Allows players to see and revert to previous versions of games."
  },
  "FFlagProfilePlatformEnableChipSocialRow_v6_IXP": {
    "mechanism": "Enables a new layout for social interactions on player profiles.",
    "purpose": "Improves the way players connect and interact with friends on their profiles."
  },
  "FFlagSolverV2RefactorReplicationStateUpdate": {
    "mechanism": "Updates the way game state is synchronized across players using a new system.",
    "purpose": "Improves the consistency and speed of game updates for a smoother multiplayer experience."
  },
  "DFFlagProductInfoBatchingEnabled_PlaceFilter": {
    "mechanism": "Groups product information requests to reduce the number of calls made to the server.",
    "purpose": "Enhances performance by loading product details faster when browsing items in the game."
  },
  "AndroidAddActivityManagerMemoryClassifications": {
    "mechanism": "N/A (invalid)",
    "purpose": "N/A (invalid)"
  },
  "FFlagAXMarketplaceCategoryPillTooltip": {
    "mechanism": "Adds tooltips to category pills in the marketplace for better information display.",
    "purpose": "Helps players understand what each category represents, making it easier to find items."
  },
  "FFlagFixIsrDeferredPropResize": {
    "mechanism": "Fixes issues with resizing properties in deferred rendering.",
    "purpose": "Ensures that visual elements resize correctly, improving the overall graphical quality of the game."
  },
  "DFStringLoadTestingUniverseId_Staged": {
    "mechanism": "Uses a specific ID to test loading performance in a controlled environment.",
    "purpose": "Improves game loading times and performance for players."
  },
  "DFIntTextChatMessageClientReceivedThrottlePermyriad": {
    "mechanism": "Limits the number of chat messages a player can receive in a certain timeframe.",
    "purpose": "Reduces spam and enhances chat experience for players."
  },
  "FFlagMicroprofilerBigButtons_Staged": {
    "mechanism": "Introduces larger buttons in the microprofiler tool for easier interaction.",
    "purpose": "Makes it simpler for developers to analyze game performance."
  },
  "FFlagAXMigrateCommunityAvatarEntryButtonToLocalRef": {
    "mechanism": "Changes how the community avatar button is referenced in the code.",
    "purpose": "Streamlines the avatar selection process for players."
  },
  "DFIntProductInfoBatchingMaxSize_PlaceFilter": {
    "mechanism": "Sets a limit on the number of product information requests that can be processed at once.",
    "purpose": "Improves the efficiency of product searches and filters for players."
  },
  "FFlagRemoveUpdatePromptChild_Staged": {
    "mechanism": "Disables the prompt that asks players to update their game when a new version is available.",
    "purpose": "Players won't be interrupted by update prompts, allowing for a smoother gaming experience."
  },
  "FFlagFoundationPseudoChildSelectors": {
    "mechanism": "Enables the use of pseudo-child selectors in UI elements for better styling.",
    "purpose": "Developers can create more visually appealing and organized interfaces for players."
  },
  "DFStringAllowedPublicFlags": {
    "mechanism": "Defines a list of public flags that can be accessed by developers for feature toggling.",
    "purpose": "Allows developers to enable or disable features easily, improving game stability and player experience."
  },
  "FFlagVoiceChatClientRewrite_OneFlagToRuleThemAll_Client2": {
    "mechanism": "Consolidates voice chat functionality under a single flag for easier management.",
    "purpose": "Enhances the voice chat experience for players by streamlining its performance and reliability."
  },
  "FFlagAXCatalogReactPerfIXPEnabledV3": {
    "mechanism": "Improves the performance of the catalog interface using React technology.",
    "purpose": "Players experience faster loading times and smoother browsing when searching for items in the catalog."
  },
  "FFlagSduiSupportArrayParsing_Staged": {
    "mechanism": "Enables parsing of array data in the SDUI framework.",
    "purpose": "Improves the way user interfaces handle lists of items, making them more dynamic and responsive."
  },
  "FFlagEnableClientSettingAPIInProduction_IXP": {
    "mechanism": "Activates the Client Setting API for use in live games.",
    "purpose": "Allows developers to manage player settings more effectively, enhancing user experience."
  },
  "FFlagEnableProfilePlatformDualCta_v5_Staged": {
    "mechanism": "Introduces a dual call-to-action feature for player profiles.",
    "purpose": "Encourages players to engage with profiles more, increasing social interactions."
  },
  "DFFlagWriteTombstoneAfterDynamicFetch_Staged": {
    "mechanism": "Records a 'tombstone' after fetching dynamic data.",
    "purpose": "Helps in tracking data retrieval issues, improving game stability and performance."
  },
  "FFlagUnsyncBreakpointsInClonedScripts": {
    "mechanism": "Allows breakpoints in cloned scripts to remain unsynchronized.",
    "purpose": "Facilitates easier debugging by keeping breakpoints separate in different script instances."
  },
  "FFlagAXUnifiedLoggingValidation1": {
    "mechanism": "Enhances logging by validating data before it's recorded.",
    "purpose": "Improves the accuracy of logs, helping developers troubleshoot issues more effectively."
  },
  "FFlagInitializeAutocompleteOnlyIfEnabledV3": {
    "mechanism": "Activates autocomplete features only when specifically enabled in settings.",
    "purpose": "Provides a cleaner experience by reducing unnecessary suggestions until the player opts in."
  },
  "FFlagVideoGamePreviewSessionTracking_Staged": {
    "mechanism": "Tracks player sessions during video game previews for analysis.",
    "purpose": "Helps developers understand player engagement and improve game previews."
  },
  "DFFlagVoiceSdpCompressionSendProtoParseErrorTelemetry": {
    "mechanism": "Sends telemetry data when there are errors in parsing voice communication data.",
    "purpose": "Enables better monitoring of voice chat issues, leading to improved voice features."
  },
  "FFlagColorPickerUseGridLayout": {
    "mechanism": "Changes the layout of the color picker to a grid format.",
    "purpose": "Makes it easier for players to select colors quickly and intuitively."
  },
  "DFStringFlipTimeStampDynamicString": {
    "mechanism": "Adjusts how timestamps are displayed in dynamic strings.",
    "purpose": "Improves the readability of time-related information for players."
  },
  "DFFlagLoadTestingEnabled3_Staged": {
    "mechanism": "Enables testing of game loading processes in a controlled environment.",
    "purpose": "Helps developers ensure smoother game loading experiences for players."
  },
  "FFlagAXEnableCategoryPills4_Staged": {
    "mechanism": "Introduces a new way to categorize and filter game content.",
    "purpose": "Makes it easier for players to find and explore games based on their interests."
  },
  "DFIntAcousticSimulationForegroundCost": {
    "mechanism": "Sets a cost for simulating sound in the game environment.",
    "purpose": "Enhances audio realism in games, improving the overall experience for players."
  },
  "FFlagEnableFAECancellationAnalytics": {
    "mechanism": "Tracks and analyzes cancellations of in-game purchases.",
    "purpose": "Helps developers understand player behavior and improve the purchasing experience."
  },
  "DFFlagEnableCancelTouchesOnGameViewControllerDisappear_Staged": {
    "mechanism": "Allows touch events to be canceled when the game view controller is closed.",
    "purpose": "Prevents unintended actions when players exit the game view."
  },
  "DFFlagEnableContextForGenerateList_Staged": {
    "mechanism": "Enables additional context for generating lists in the game.",
    "purpose": "Improves the accuracy and relevance of lists shown to players."
  },
  "FFlagAXDisableCategoryPillsOnCatalogSearch": {
    "mechanism": "Removes category filters (pills) from the catalog search interface.",
    "purpose": "Simplifies the search experience for players by reducing clutter."
  },
  "DFIntDataStoreOrderedSetFixedRequestLimit_PlaceFilter": {
    "mechanism": "Sets a fixed limit on requests for ordered data in place filters.",
    "purpose": "Enhances performance and reliability when filtering game data."
  },
  "FFlagNewBindToMessageError": {
    "mechanism": "Introduces a new method for handling message binding errors.",
    "purpose": "Improves error handling, leading to a smoother experience for players."
  },
  "FFlagAXOutlineSubcategoryPill": {
    "mechanism": "Enables a visual outline for subcategory pills in the UI.",
    "purpose": "Improves the visibility and organization of categories, making it easier for players to navigate."
  }
}