{
  "FFlagCallVoiceLeaveOnNetworkDisconnect2_Staged": {
    "mechanism": "Automatically disconnects voice chat when the network connection drops.",
    "purpose": "Ensures players don't remain in voice chat during connectivity issues."
  },
  "FFlagMicroprofilerBigButtons_Staged": {
    "mechanism": "Introduces larger buttons in the microprofiler tool for easier interaction.",
    "purpose": "Makes it simpler for developers to analyze performance data."
  },
  "FFlagStudioTasksFutureShareMutexes_Staged": {
    "mechanism": "Implements a system to manage shared tasks in Studio more efficiently.",
    "purpose": "Improves the stability and performance of Roblox Studio for developers."
  },
  "FFlagStudioActionsMultiplePayloads_Staged": {
    "mechanism": "Allows multiple data sets to be sent with actions in Studio.",
    "purpose": "Enhances the flexibility and functionality of scripting in Roblox Studio."
  },
  "FFlagNativeDialogManager_Staged": {
    "mechanism": "Replaces the old dialog system with a new, more efficient one.",
    "purpose": "Provides a smoother and more responsive experience for players when interacting with dialogs."
  },
  "FFlagSTM6819Enabled": {
    "mechanism": "Enables a specific feature in the system for better performance.",
    "purpose": "Improves game stability and reduces lag for players."
  },
  "FFlagProfilePlatformEnableClickToCopyUsername_Staged": {
    "mechanism": "Allows users to click on usernames to copy them easily.",
    "purpose": "Makes it simpler for players to share usernames with friends."
  },
  "FFlagProfilePlatformEnableClickToCopyUsername": {
    "mechanism": "Enables a feature that lets players click to copy usernames directly.",
    "purpose": "Enhances user experience by streamlining the process of sharing usernames."
  },
  "FFlagMediaPlaybackStopsWhenJoiningExperience": {
    "mechanism": "Automatically pauses any media playback when a player joins a game.",
    "purpose": "Prevents distractions from media while players are entering a game."
  },
  "FFlagMediaPlaybackStopsWhenJoiningExperience_Staged": {
    "mechanism": "Tests the feature that pauses media playback upon joining a game.",
    "purpose": "Ensures a smoother transition into games by stopping media distractions."
  },
  "DFStringFlipTimeStampDynamicString": {
    "mechanism": "Changes how timestamps are formatted in dynamic strings.",
    "purpose": "Improves the readability of time-related messages for players."
  },
  "DFIntLoadTestStartTimeUnix_PlaceFilter": {
    "mechanism": "Filters places based on a specific start time for load testing.",
    "purpose": "Helps developers test their games more effectively by focusing on specific timeframes."
  },
  "FFlagNativeDialogManager": {
    "mechanism": "Introduces a new system for managing dialog boxes in the game.",
    "purpose": "Enhances the user experience by making dialogs more responsive and easier to use."
  },
  "FFlagEnableSocialSelfProfileViewExposureEvents_Staged": {
    "mechanism": "Tracks when players view their own profiles in a social context.",
    "purpose": "Allows for better social features and insights into player interactions."
  },
  "FFlagCallVoiceLeaveOnNetworkDisconnect2": {
    "mechanism": "Automatically disconnects voice chat when a network issue occurs.",
    "purpose": "Prevents confusion by ensuring players are aware when they lose connection."
  },
  "FFlagStudioActionsMultiplePayloads": {
    "mechanism": "Allows multiple actions to be sent in a single request to the server.",
    "purpose": "Improves performance and responsiveness in Roblox Studio by reducing the number of server calls."
  },
  "FStringFlagRepoGitHashFastString": {
    "mechanism": "Uses a faster method to retrieve the Git hash for version control.",
    "purpose": "Speeds up the loading process for developers by quickly accessing version information."
  },
  "FFlagRemoveUpdatePromptChild_Staged": {
    "mechanism": "Removes the update prompt for certain child objects in a staged environment.",
    "purpose": "Reduces interruptions for developers while testing changes in Roblox Studio."
  },
  "FFlagAXCategoryPillScrollToStart": {
    "mechanism": "Enables scrolling to the start of a category in the user interface.",
    "purpose": "Enhances navigation for players by making it easier to find items in categories."
  },
  "DFStringFlagRepoGitHashDynamicString": {
    "mechanism": "Dynamically generates the Git hash string for version tracking.",
    "purpose": "Ensures developers always have the latest version information without manual updates."
  },
  "FFlagAXCatalogCategoryPillsIXP_Staged": {
    "mechanism": "Enables a new UI layout for category pills in the catalog.",
    "purpose": "Improves navigation and organization of items in the catalog for players."
  },
  "FFlagSTM6819Enabled_Staged": {
    "mechanism": "Activates a specific system update for better performance.",
    "purpose": "Enhances game stability and reduces lag for a smoother experience."
  },
  "FFlagVoiceConnectionApiSendSdpParsingErrorTelemetry_Staged": {
    "mechanism": "Tracks errors in the voice connection setup process.",
    "purpose": "Helps developers fix voice chat issues, leading to better communication for players."
  },
  "DFFlagVoiceSdpCompressionSendSizeTelemetry_Staged": {
    "mechanism": "Collects data on the size of compressed voice data sent.",
    "purpose": "Optimizes voice chat performance, improving audio quality for players."
  },
  "FFlagAXCatalogCategoryPillsIXP": {
    "mechanism": "Implements a new design for category pills in the catalog.",
    "purpose": "Makes it easier for players to find and browse items in the catalog."
  },
  "FFlagFixDisplaySizeEnum_Staged": {
    "mechanism": "Updates the way display sizes are categorized in the system.",
    "purpose": "Ensures that players see the correct display size settings for a better visual experience."
  },
  "FFlagMicroprofilerBigButtons": {
    "mechanism": "Introduces larger buttons in the microprofiler tool for easier interaction.",
    "purpose": "Makes it simpler for developers to use profiling tools, enhancing game performance."
  },
  "DFFlagVoiceSdpCompressionSendSizeTelemetry": {
    "mechanism": "Tracks the size of compressed voice data sent during gameplay.",
    "purpose": "Helps improve voice chat quality and efficiency for players."
  },
  "FFlagVoiceConnectionApiSendSdpParsingErrorTelemetry": {
    "mechanism": "Monitors errors related to parsing voice connection data.",
    "purpose": "Aims to enhance voice chat reliability by identifying and fixing connection issues."
  },
  "FFlagRemoveUpdatePromptChild": {
    "mechanism": "Eliminates the prompt that asks players to update the game.",
    "purpose": "Reduces interruptions for players, allowing for a smoother gaming experience."
  },
  "FFlagAXCatalogReactPerfIXPEnabledV3": {
    "mechanism": "Enables a new version of the catalog interface using React for improved performance.",
    "purpose": "Players experience faster loading times and smoother interactions in the catalog."
  },
  "FStringFlipTimeStampFastString": {
    "mechanism": "Optimizes how timestamps are processed in strings for quicker access.",
    "purpose": "Players benefit from reduced delays when accessing time-related information."
  },
  "FFlagFixDisplaySizeVR2": {
    "mechanism": "Adjusts the display size settings for virtual reality to enhance visual fidelity.",
    "purpose": "Players using VR headsets enjoy a better and more immersive visual experience."
  },
  "DFFlagVoiceSdpCompressionSendProtoParseErrorTelemetry": {
    "mechanism": "Tracks errors in parsing voice data to improve reliability.",
    "purpose": "Players experience fewer issues with voice communication during gameplay."
  },
  "DFFlagVoiceSdpCompressionRemoteEventFieldReceivesUnexpectedValue_Staged": {
    "mechanism": "Addresses unexpected values in voice data transmission to ensure consistency.",
    "purpose": "Players benefit from more reliable voice chat functionality without interruptions."
  },
  "DFFlagVoiceSdpCompressionRemoteEventFieldReceivesUnexpectedValue": {
    "mechanism": "Adjusts how voice data is sent to avoid errors.",
    "purpose": "Improves voice chat reliability for players."
  },
  "FFlagSlimServiceEnableUploadsInNonEditMode_Staged": {
    "mechanism": "Allows uploads even when not in edit mode.",
    "purpose": "Enables players to upload assets more freely."
  },
  "FFlagAXUnifiedLoggingValidation1": {
    "mechanism": "Enhances logging for better data tracking.",
    "purpose": "Helps developers identify issues faster."
  },
  "FFlagFixToggleMenuIconForTheFive_Staged": {
    "mechanism": "Corrects the icon display in the menu.",
    "purpose": "Provides a clearer user interface for players."
  },
  "FFlagAXUnifiedLoggingValidation1_Staged": {
    "mechanism": "Implements additional checks for logging.",
    "purpose": "Improves overall system reliability for developers."
  },
  "FFlagAXCategoryPillScrollToStart_Staged": {
    "mechanism": "Adjusts the scroll position of category pills in the UI.",
    "purpose": "Improves user experience by ensuring the first category is visible when opened."
  },
  "DFFlagVoiceSdpCompressionSendProtoParseErrorTelemetry_Staged": {
    "mechanism": "Tracks errors in voice communication data parsing.",
    "purpose": "Helps developers identify and fix issues with voice chat functionality."
  },
  "FFlagFixDisplaySizeVR2_Staged": {
    "mechanism": "Corrects the display size settings for VR devices.",
    "purpose": "Enhances visual clarity and comfort for players using virtual reality."
  },
  "FFlagStudioTasksFutureShareMutexes": {
    "mechanism": "Implements a system for managing shared tasks in the development environment.",
    "purpose": "Improves performance and stability in Roblox Studio for developers."
  },
  "DFIntLoadTestParticipationPerMillionUsers_PlaceFilter": {
    "mechanism": "Sets a limit on how many users can participate in load tests based on user count.",
    "purpose": "Ensures fair testing conditions for games by filtering participants effectively."
  },
  "FFlagEnableSocialSelfProfileViewExposureEvents": {
    "mechanism": "Tracks when players view their own profiles for analytics.",
    "purpose": "Helps improve social features by understanding how players interact with their profiles."
  },
  "FFlagSlimServiceEnableUploadsInNonEditMode": {
    "mechanism": "Allows users to upload assets even when not in edit mode.",
    "purpose": "Makes it easier for players to add content without needing to enter editing mode."
  },
  "FFlagAXCatalogReactPerfIXPEnabledV3_Staged": {
    "mechanism": "Implements performance improvements for the catalog using React.",
    "purpose": "Enhances the speed and responsiveness of the catalog for a smoother shopping experience."
  },
  "FFlagFixDisplaySizeEnum": {
    "mechanism": "Corrects the enumeration of display sizes for devices.",
    "purpose": "Ensures that games display correctly on various devices, improving overall gameplay experience."
  }
}