{
  "FFlagEnableSocialSelfProfileViewExposureEvents": {
    "mechanism": "Tracks when players view their own profiles for analytics.",
    "purpose": "Helps improve social features by understanding how players interact with their profiles."
  },
  "DFFlagVoiceSdpCompressionSendProtoParseErrorTelemetry": {
    "mechanism": "Collects data on errors related to voice communication setup.",
    "purpose": "Enhances voice chat reliability by identifying and fixing issues."
  },
  "FFlagRemoveUpdatePromptChild_Staged": {
    "mechanism": "Disables prompts for child accounts to update settings.",
    "purpose": "Reduces interruptions for younger players while they are playing."
  },
  "FFlagFixDisplaySizeVR2_Staged": {
    "mechanism": "Adjusts the display settings for virtual reality experiences.",
    "purpose": "Improves visual clarity and comfort for VR users."
  },
  "FFlagAXCategoryPillScrollToStart": {
    "mechanism": "Changes how category selections are displayed in the UI.",
    "purpose": "Makes it easier for players to navigate and find categories in the interface."
  },
  "FFlagEnableSocialSelfProfileViewExposureEvents_Staged": {
    "mechanism": "Tracks when players view their own profiles.",
    "purpose": "Helps improve social features by understanding how players interact with their profiles."
  },
  "DFStringFlagRepoGitHashDynamicString": {
    "mechanism": "Stores a dynamic string related to the version control system.",
    "purpose": "Ensures that players receive the latest updates and features reliably."
  },
  "FFlagAXCatalogCategoryPillsIXP": {
    "mechanism": "Introduces new category navigation pills in the catalog.",
    "purpose": "Makes it easier for players to browse and find items in the catalog."
  },
  "FFlagFixDisplaySizeEnum_Staged": {
    "mechanism": "Corrects the way display sizes are categorized.",
    "purpose": "Improves the visual experience for players by ensuring accurate display settings."
  },
  "FFlagVoiceConnectionApiSendSdpParsingErrorTelemetry_Staged": {
    "mechanism": "Sends data when there are errors in voice connection setup.",
    "purpose": "Helps developers fix voice chat issues, enhancing communication for players."
  },
  "FFlagNativeDialogManager": {
    "mechanism": "Implements a new system for managing dialog boxes natively within the platform.",
    "purpose": "Improves the user experience by making dialog boxes more responsive and visually appealing."
  },
  "DFFlagVoiceSdpCompressionSendSizeTelemetry_Staged": {
    "mechanism": "Tracks the size of voice data being sent for compression analysis.",
    "purpose": "Enhances voice chat quality by optimizing data transmission for clearer audio."
  },
  "DFIntLoadTestParticipationPerMillionUsers_PlaceFilter": {
    "mechanism": "Controls the number of users participating in load tests based on specific place filters.",
    "purpose": "Ensures smoother gameplay by testing server performance with a targeted group of players."
  },
  "FFlagRemoveUpdatePromptChild": {
    "mechanism": "Removes the child component that prompts users for updates.",
    "purpose": "Reduces interruptions during gameplay by eliminating unnecessary update notifications."
  },
  "FFlagNativeDialogManager_Staged": {
    "mechanism": "A staged rollout of the new native dialog management system for testing.",
    "purpose": "Allows gradual improvements to dialog boxes while gathering player feedback."
  },
  "FFlagAXUnifiedLoggingValidation1": {
    "mechanism": "Consolidates logging processes for better data validation.",
    "purpose": "Improves the accuracy of logs, helping developers troubleshoot issues more effectively."
  },
  "FFlagProfilePlatformEnableClickToCopyUsername": {
    "mechanism": "Adds a feature to copy usernames with a click.",
    "purpose": "Makes it easier for players to share their usernames without typing them out."
  },
  "DFFlagVoiceSdpCompressionRemoteEventFieldReceivesUnexpectedValue_Staged": {
    "mechanism": "Addresses issues with unexpected data in voice communication.",
    "purpose": "Enhances the reliability of voice chat by fixing data handling problems."
  },
  "FFlagStudioActionsMultiplePayloads_Staged": {
    "mechanism": "Allows multiple actions to be processed in one go.",
    "purpose": "Streamlines the development process in Studio, making it faster for creators."
  },
  "FFlagStudioTasksFutureShareMutexes": {
    "mechanism": "Implements a system to manage shared resources among tasks.",
    "purpose": "Improves performance and stability in Studio by preventing conflicts between tasks."
  },
  "FFlagCallVoiceLeaveOnNetworkDisconnect2": {
    "mechanism": "Automatically disconnects voice chat when the network connection is lost.",
    "purpose": "Ensures players don't stay in voice chat when they can't communicate properly."
  },
  "FFlagMediaPlaybackStopsWhenJoiningExperience": {
    "mechanism": "Pauses any media playback when a player joins a new game.",
    "purpose": "Prevents interruptions and allows players to focus on the new experience."
  },
  "FFlagMediaPlaybackStopsWhenJoiningExperience_Staged": {
    "mechanism": "Similar to the previous flag, but used in a testing environment.",
    "purpose": "Helps developers test how media behaves when players join, ensuring a smooth experience."
  },
  "FFlagCallVoiceLeaveOnNetworkDisconnect2_Staged": {
    "mechanism": "A testing version of the voice chat disconnection feature for network issues.",
    "purpose": "Allows developers to evaluate the voice chat experience during network disruptions."
  },
  "DFFlagVoiceSdpCompressionSendProtoParseErrorTelemetry_Staged": {
    "mechanism": "Collects data on errors related to voice chat compression during testing.",
    "purpose": "Helps developers identify and fix issues with voice chat quality."
  },
  "FFlagSTM6819Enabled": {
    "mechanism": "Enables a new system for managing player data more efficiently.",
    "purpose": "Improves game performance and reduces loading times for players."
  },
  "FFlagProfilePlatformEnableClickToCopyUsername_Staged": {
    "mechanism": "Adds a feature that allows players to click on usernames to copy them to the clipboard.",
    "purpose": "Makes it easier for players to share usernames with friends."
  },
  "FFlagMicroprofilerBigButtons": {
    "mechanism": "Introduces larger buttons in the microprofiler tool for better accessibility.",
    "purpose": "Enhances usability for developers analyzing game performance."
  },
  "FFlagAXCatalogCategoryPillsIXP_Staged": {
    "mechanism": "Changes the layout of catalog categories to a pill-style format.",
    "purpose": "Improves navigation and makes it easier for players to find items in the catalog."
  },
  "FFlagMicroprofilerBigButtons_Staged": {
    "mechanism": "Further refines the size and design of buttons in the microprofiler.",
    "purpose": "Provides a more user-friendly interface for developers monitoring game metrics."
  },
  "FFlagAXCategoryPillScrollToStart_Staged": {
    "mechanism": "Adjusts the scrolling behavior of category pills in the UI.",
    "purpose": "Improves navigation by ensuring the selected category is visible at the start."
  },
  "FFlagAXCatalogReactPerfIXPEnabledV3_Staged": {
    "mechanism": "Enhances performance of the catalog using updated React components.",
    "purpose": "Provides a smoother browsing experience in the catalog."
  },
  "FFlagFixToggleMenuIconForTheFive_Staged": {
    "mechanism": "Corrects the icon display in the toggle menu for a specific feature.",
    "purpose": "Ensures players see the correct icons, improving usability."
  },
  "FFlagAXCatalogReactPerfIXPEnabledV3": {
    "mechanism": "Activates advanced performance optimizations for the catalog interface.",
    "purpose": "Makes the catalog faster and more responsive for users."
  },
  "DFFlagVoiceSdpCompressionRemoteEventFieldReceivesUnexpectedValue": {
    "mechanism": "Fixes an issue where a remote event receives incorrect data related to voice chat.",
    "purpose": "Enhances voice chat reliability by preventing unexpected errors."
  },
  "FFlagSlimServiceEnableUploadsInNonEditMode_Staged": {
    "mechanism": "Allows uploads to occur even when the game is not in editing mode.",
    "purpose": "Enables players to upload assets more flexibly without needing to be in edit mode."
  },
  "FFlagVoiceConnectionApiSendSdpParsingErrorTelemetry": {
    "mechanism": "Tracks and sends data about errors in parsing voice connection information.",
    "purpose": "Improves voice chat reliability by identifying and fixing connection issues."
  },
  "FFlagStudioActionsMultiplePayloads": {
    "mechanism": "Supports sending multiple actions or commands at once in the studio.",
    "purpose": "Enhances efficiency for developers by allowing batch actions, saving time."
  },
  "DFFlagVoiceSdpCompressionSendSizeTelemetry": {
    "mechanism": "Collects data on the size of compressed voice connection information.",
    "purpose": "Helps optimize voice chat performance by analyzing data transfer sizes."
  },
  "FStringFlipTimeStampFastString": {
    "mechanism": "Improves the speed of string operations related to timestamps.",
    "purpose": "Makes time-related features run faster and smoother for players."
  },
  "FFlagStudioTasksFutureShareMutexes_Staged": {
    "mechanism": "Enables a new way to manage tasks in the studio using mutexes for better performance.",
    "purpose": "Improves the efficiency of the Roblox Studio, making it faster and more responsive for developers."
  },
  "DFStringFlipTimeStampDynamicString": {
    "mechanism": "Changes how timestamps are handled in dynamic strings for better data management.",
    "purpose": "Ensures that players see up-to-date information in real-time, enhancing the gaming experience."
  },
  "FStringFlagRepoGitHashFastString": {
    "mechanism": "Optimizes the retrieval of version information from the repository using fast strings.",
    "purpose": "Allows for quicker updates and fixes, leading to a smoother experience for players."
  },
  "FFlagFixDisplaySizeVR2": {
    "mechanism": "Addresses issues with display sizes in virtual reality settings.",
    "purpose": "Enhances the visual experience for VR users, making games more immersive and enjoyable."
  },
  "FFlagSTM6819Enabled_Staged": {
    "mechanism": "Activates a new system for managing state transitions in the game engine.",
    "purpose": "Improves game stability and performance, leading to a better overall experience for players."
  },
  "DFIntLoadTestStartTimeUnix_PlaceFilter": {
    "mechanism": "Filters places based on a specific start time for loading tests.",
    "purpose": "Helps developers test their games more effectively by focusing on specific timeframes."
  },
  "FFlagSlimServiceEnableUploadsInNonEditMode": {
    "mechanism": "Allows users to upload assets even when not in edit mode.",
    "purpose": "Makes it easier for players to add content without needing to enter editing mode."
  },
  "FFlagAXUnifiedLoggingValidation1_Staged": {
    "mechanism": "Implements a unified logging system for better data tracking.",
    "purpose": "Improves the reliability of game data, helping developers understand player behavior."
  },
  "FFlagFixDisplaySizeEnum": {
    "mechanism": "Corrects the enumeration of display sizes in the system.",
    "purpose": "Ensures that display sizes are accurately represented, enhancing user experience on different devices."
  }
}