{
  "DFIntAssetProviderCdnBytesThrottleHundrethsPercent2": {
    "mechanism": "Limits the amount of data sent from the asset provider to reduce server load.",
    "purpose": "Improves game performance by managing data flow, leading to smoother gameplay."
  },
  "FFlagEnableSocialSelfProfileViewExposureEvents_Staged": {
    "mechanism": "Tracks when players view their own profiles for analytics.",
    "purpose": "Helps improve social features by understanding how players interact with their profiles."
  },
  "FFlagSlimServiceEnableUploadsInNonEditMode_Staged": {
    "mechanism": "Allows players to upload assets even when not in edit mode.",
    "purpose": "Provides more flexibility for creators to manage their assets without needing to enter edit mode."
  },
  "DFFlagInferredCrashReportToBacktraceRegister": {
    "mechanism": "Sends crash reports to a service for better tracking and analysis.",
    "purpose": "Helps developers fix bugs faster, leading to a more stable gaming experience."
  },
  "FStringEngineVoiceSdpCompressionIxpLayer_Staged": {
    "mechanism": "Implements a compression method for voice data during transmission.",
    "purpose": "Enhances voice chat quality while reducing lag and data usage."
  },
  "FFlagFixLockCenterMouseClickAndScroll": {
    "mechanism": "Fixes the mouse locking behavior to ensure consistent scrolling and clicking.",
    "purpose": "Improves user experience by making mouse interactions smoother and more reliable."
  },
  "FFlagEnableProfilePlatformDualCta_v5_Staged": {
    "mechanism": "Introduces a new call-to-action button layout for profiles on different platforms.",
    "purpose": "Enhances navigation and engagement on player profiles, making it easier to connect with friends."
  },
  "DFIntRobloxTelemetryLoadTestStartThrottleHundredthsPercent_PlaceFilter": {
    "mechanism": "Adjusts the telemetry data collection rate for specific places during load testing.",
    "purpose": "Helps improve game performance by optimizing data collection, leading to a smoother gameplay experience."
  },
  "FFlagAXEnableCategoryPills4": {
    "mechanism": "Enables a new visual style for category navigation in the game interface.",
    "purpose": "Makes it easier for players to find and explore different game categories, enhancing discoverability."
  },
  "FFlagCachelessPluginLoading2": {
    "mechanism": "Loads plugins without relying on cached data, ensuring the latest version is always used.",
    "purpose": "Provides players with the most up-to-date features and fixes in plugins, improving overall game functionality."
  },
  "FFlagAXCategoryPillAnimationsUserMotionSettings": {
    "mechanism": "Enables animations based on user motion settings for category pills.",
    "purpose": "Improves visual feedback and responsiveness of category selections."
  },
  "FFlagFixKeyboardFocusInfiniteLoop": {
    "mechanism": "Fixes a bug that caused keyboard focus to loop endlessly in certain scenarios.",
    "purpose": "Ensures smoother navigation and control for players using keyboards."
  },
  "FFlagCallVoiceLeaveOnNetworkDisconnect2": {
    "mechanism": "Automatically disconnects voice chat when the network connection drops.",
    "purpose": "Prevents players from being stuck in voice chat during connection issues."
  },
  "FFlagUseClientSettingAPI_IXP": {
    "mechanism": "Utilizes a new API for managing client settings.",
    "purpose": "Enhances the customization options available to players for their game experience."
  },
  "FFlagVideoWinEncodeSampleTracking": {
    "mechanism": "Tracks video encoding samples for better performance analysis.",
    "purpose": "Improves video quality and streaming experience for players."
  },
  "FFlagVideoEncoderScopedOutputBuffer": {
    "mechanism": "Uses a specific memory buffer for video encoding to improve performance.",
    "purpose": "Enhances video quality and reduces lag during video uploads."
  },
  "DFFlagMoveOctreeChecks": {
    "mechanism": "Adjusts how the game checks for object placement and collisions in a 3D space.",
    "purpose": "Improves game performance and reduces glitches when moving objects."
  },
  "FFlagFallbackGenericAbuseReporting": {
    "mechanism": "Enables a standard method for reporting inappropriate behavior in games.",
    "purpose": "Makes it easier for players to report issues and maintain a safe gaming environment."
  },
  "DFFlagVideoSandboxPreviewVideos": {
    "mechanism": "Allows users to preview videos in a controlled environment before publishing.",
    "purpose": "Gives creators a chance to check their videos for quality before sharing them."
  },
  "FFlagAXFixManageOutfitPageFocusLostBehind": {
    "mechanism": "Fixes focus issues on the outfit management page when switching tabs.",
    "purpose": "Improves user experience by ensuring players can easily manage their outfits without interruptions."
  },
  "DFFlagISRBlockStaleCFrameImprovements": {
    "mechanism": "Improves the way stale CFrame data is handled in the game engine.",
    "purpose": "Reduces glitches and improves the accuracy of player movements."
  },
  "DFFlagEnableContextForGenerateList": {
    "mechanism": "Allows context to be passed when generating lists in the game.",
    "purpose": "Enhances the flexibility and customization of in-game lists for developers."
  },
  "DFIntDataStoreOrderedGetFixedRequestLimit_PlaceFilter": {
    "mechanism": "Adjusts the request limits for data storage with a focus on place filtering.",
    "purpose": "Improves performance and efficiency when accessing game data."
  },
  "FFlagFFlagIconHostSetZIndexToDefault": {
    "mechanism": "Sets the default stacking order for icons in the UI.",
    "purpose": "Ensures that icons are displayed correctly and consistently in the user interface."
  },
  "FFlagNativeDialogManager": {
    "mechanism": "Introduces a new system for managing native dialog windows.",
    "purpose": "Provides a smoother and more integrated experience for players when interacting with dialogs."
  },
  "FFlagCustomDspBaseSupportsSidechain": {
    "mechanism": "Enables sidechain audio processing in custom DSPs.",
    "purpose": "Allows developers to create more dynamic and responsive audio effects in games."
  },
  "DFFlagLoadTestingEnabled3": {
    "mechanism": "Activates a feature for testing game load performance.",
    "purpose": "Helps developers ensure their games can handle many players without crashing."
  },
  "FFlagLuauNoConstraintGenRecursionLimitIce_Staged": {
    "mechanism": "Removes recursion limits in the Luau scripting engine for constraints.",
    "purpose": "Allows for more complex and flexible scripting without hitting limits."
  },
  "FFlagAXCatalogCategoryPillsIXP_Staged": {
    "mechanism": "Introduces a new way to display categories in the asset catalog.",
    "purpose": "Improves user experience by making it easier to find and browse assets."
  },
  "FFlagPlaceVersionHistoryMetadataRCC": {
    "mechanism": "Adds metadata tracking for place version history.",
    "purpose": "Enables players to see changes and updates made to a game over time."
  },
  "DFFlagWriteTombstoneAfterDynamicFetch_Staged": {
    "mechanism": "Enables a system to log errors after fetching data dynamically.",
    "purpose": "Helps improve stability by recording issues, leading to a smoother experience for players."
  },
  "FFlagAXMigrateItemOwnerShipPageToAutofocus": {
    "mechanism": "Changes the item ownership page to automatically focus on the main input field.",
    "purpose": "Makes it easier for players to interact with the page, enhancing usability."
  },
  "FFlagCallVoiceLeaveOnNetworkDisconnect2_Staged": {
    "mechanism": "Triggers a voice chat leave function when a network disconnection occurs.",
    "purpose": "Ensures players are removed from voice chat when they lose connection, preventing confusion."
  },
  "FStringLuaOTATag_Staged": {
    "mechanism": "Introduces a tagging system for Lua scripts in the game.",
    "purpose": "Allows for better organization and management of scripts, improving game performance."
  },
  "FFlagAXMigrateItemDetailsFullToAutoFocus": {
    "mechanism": "Updates the item details page to automatically focus on key information.",
    "purpose": "Enhances the player experience by making important details more accessible."
  },
  "FFlagAXMigrateEmoteMenuFromRoactGamepad": {
    "mechanism": "Moves the emote menu to a new system for better gamepad support.",
    "purpose": "Improves the experience of using emotes for players using game controllers."
  },
  "FFlagExtendedLightRangesFixDirtyCrash": {
    "mechanism": "Fixes a bug related to lighting that could cause crashes.",
    "purpose": "Enhances game stability and prevents unexpected crashes during gameplay."
  },
  "DFStringAllowedPublicFlags": {
    "mechanism": "Allows certain flags to be publicly accessible as strings.",
    "purpose": "Enables developers to use specific features more easily in their games."
  },
  "FFlagLuaAppAddSchemaFieldsToGameClicks": {
    "mechanism": "Adds new data fields to track player clicks in games.",
    "purpose": "Provides developers with better analytics on player interactions."
  },
  "FFlagFoundationPseudoChildSelectors": {
    "mechanism": "Introduces new CSS-like selectors for styling elements.",
    "purpose": "Gives developers more flexibility in designing user interfaces."
  },
  "FFlagAXRemoveTryOnManagerAvatarScreen": {
    "mechanism": "Removes the Try-On Manager from the Avatar Screen interface.",
    "purpose": "Simplifies the avatar customization process for players."
  },
  "FFlagChatIntegrationFixShortcut": {
    "mechanism": "Fixes a shortcut issue in the chat integration system.",
    "purpose": "Improves the chat experience, making it easier for players to communicate."
  },
  "FFlagAddTopBarScrim": {
    "mechanism": "Adds a visual overlay (scrim) to the top bar of the interface.",
    "purpose": "Enhances the visual appeal and usability of the top bar for players."
  },
  "DFFlagISRAdjustMtu": {
    "mechanism": "Adjusts the Maximum Transmission Unit (MTU) settings for better network performance.",
    "purpose": "Improves connection stability and reduces lag for players."
  },
  "FFlagSTM6819Enabled_Staged": {
    "mechanism": "Enables a new feature or system related to the game engine.",
    "purpose": "Brings new functionalities or improvements to enhance gameplay for players."
  },
  "DFFlagVoiceChatSendHttpErrorsTelemetry_Staged": {
    "mechanism": "Tracks and sends data about voice chat errors to improve the system.",
    "purpose": "Helps ensure a better voice chat experience by identifying and fixing issues."
  },
  "FFlagUIEditorActionURI": {
    "mechanism": "Enables a new way to handle actions in the UI editor using URIs.",
    "purpose": "Makes it easier for developers to manage and navigate their UI elements."
  },
  "DFIntVoiceChatHttpErrorsTelemetryThrottleHundredthsPercent_Staged": {
    "mechanism": "Limits the frequency of error reporting for voice chat to reduce overload.",
    "purpose": "Improves system performance by managing how often errors are logged."
  },
  "FFlagEnableAdOpportunityTracker4_PlaceFilter": {
    "mechanism": "Introduces a new tracking system for ad opportunities based on specific places.",
    "purpose": "Helps developers better understand ad performance in different game locations."
  },
  "DFFlagWriteFlagCacheAfterFlagFetch": {
    "mechanism": "Updates the cache with flag data immediately after it is retrieved.",
    "purpose": "Ensures players have the most current features and settings available."
  },
  "FFlagAXEnableCategoryPills4_Staged": {
    "mechanism": "Enables a new design for category navigation in the user interface.",
    "purpose": "Improves how players browse and select categories, making it easier to find what they want."
  },
  "FFlagCommunicationsFixLastInputMode": {
    "mechanism": "Fixes the input mode tracking for communication features.",
    "purpose": "Ensures that players can communicate more reliably without input issues."
  },
  "FFlagAXOutlineSubcategoryPill": {
    "mechanism": "Adds an outline to subcategory buttons in the interface.",
    "purpose": "Enhances visibility of subcategories, helping players navigate more effectively."
  },
  "FFlagEnableNoiseReductionForAudioDeviceInput": {
    "mechanism": "Implements noise reduction technology for audio input devices.",
    "purpose": "Reduces background noise during voice chat, improving clarity for players."
  },
  "FFlagVoiceChatClientRewrite_OneFlagToRuleThemAll_Client2_IXP": {
    "mechanism": "Consolidates various voice chat features into a single framework.",
    "purpose": "Streamlines voice chat functionality, providing a smoother experience for players."
  },
  "FFlagVideoGamePreviewSessionTracking_Staged": {
    "mechanism": "Tracks user sessions during game previews for analytics.",
    "purpose": "Helps developers understand player engagement in preview sessions."
  },
  "FStringEngineVoiceSdpCompressionIxpLayer": {
    "mechanism": "Implements compression for voice data in the game engine.",
    "purpose": "Improves voice chat quality and reduces data usage."
  },
  "FFlagAppChatFixPaddingWhenScaling": {
    "mechanism": "Adjusts chat interface padding when the app is resized.",
    "purpose": "Ensures chat looks good and is usable on different screen sizes."
  },
  "FFlagAXUseDefaultFocusHandlerInFocusedWidgetTopContent": {
    "mechanism": "Utilizes a standard focus handler for top content in widgets.",
    "purpose": "Enhances navigation and accessibility for users interacting with widgets."
  },
  "DFFlagVoiceChatSendHttpErrorsTelemetry": {
    "mechanism": "Sends data about HTTP errors related to voice chat.",
    "purpose": "Helps improve voice chat reliability by tracking issues."
  },
  "FFlagCapturesAddSavePromptVideoLog": {
    "mechanism": "Adds a prompt to save video logs when capturing gameplay.",
    "purpose": "Helps players keep a record of their gameplay for sharing or reviewing."
  },
  "FFlagVoiceChatClientRewrite_OneFlagToRuleThemAll_Client2": {
    "mechanism": "Implements a comprehensive update to the voice chat system.",
    "purpose": "Improves voice chat reliability and performance for better communication."
  },
  "FFlagFlyweightTrackId_Staged": {
    "mechanism": "Optimizes how track IDs are managed in the game engine.",
    "purpose": "Enhances performance by reducing memory usage during gameplay."
  },
  "FFlagRemoveUpdatePromptChild": {
    "mechanism": "Removes the child element from the update prompt system.",
    "purpose": "Simplifies the update process for players, making it less intrusive."
  },
  "FFlagMigrateEmptyResultsViewToFoundation": {
    "mechanism": "Moves the empty results view to a new foundational system.",
    "purpose": "Improves the user experience when no results are found in searches."
  },
  "DFFlagRemoveTemporaryScreenshotFilePresave_Staged": {
    "mechanism": "Disables the temporary screenshot file creation before saving.",
    "purpose": "Reduces unnecessary file clutter and improves performance when taking screenshots."
  },
  "FFlagRbxthumbForAlbumArt": {
    "mechanism": "Enables the use of Roblox thumbnails for album art.",
    "purpose": "Enhances the visual appeal of music albums with recognizable Roblox images."
  },
  "FFlagAXCatalogCategoryPillsShowAllCategory": {
    "mechanism": "Displays all categories in the catalog using pill-shaped buttons.",
    "purpose": "Makes it easier for players to navigate and find items in the catalog."
  },
  "FFlagVoiceChatClientRewrite_OneFlagToRuleThemAll_Client2_Staged": {
    "mechanism": "Implements a comprehensive update to the voice chat system.",
    "purpose": "Improves the reliability and quality of voice chat for players."
  },
  "FFlagCoreComponentManagerEmitAssetDMKeyTelemetry": {
    "mechanism": "Tracks and reports data related to asset management.",
    "purpose": "Helps developers understand asset usage better, leading to improved game experiences."
  },
  "DFStringFlagRepoGitHashDynamicString": {
    "mechanism": "Stores a dynamic string that represents the current version of the code.",
    "purpose": "Helps developers track changes and ensure players are using the latest features."
  },
  "DFFlagSkipSavingEmptyCapture": {
    "mechanism": "Prevents the system from saving data if no changes were made.",
    "purpose": "Reduces unnecessary data storage, improving performance and efficiency for players."
  },
  "FFlagUpdateViewportOnUse3DPanelsChanged": {
    "mechanism": "Updates the game view when 3D panels are used.",
    "purpose": "Enhances the visual experience by ensuring players see the latest changes in the game environment."
  },
  "FStringIxpNewLayersForRegistration": {
    "mechanism": "Introduces new layers for user registration processes.",
    "purpose": "Improves the onboarding experience for new players, making it easier to join games."
  },
  "DFFlagAndroidDebugHeapTelemetry": {
    "mechanism": "Collects data on memory usage for debugging on Android devices.",
    "purpose": "Helps developers optimize game performance on Android, leading to a smoother experience for players."
  },
  "DFFlagSolverV2CleanupPendingModelStreamingModeModels": {
    "mechanism": "Improves the way models are streamed and cleaned up in the game environment.",
    "purpose": "Enhances performance by reducing lag and loading times for players."
  },
  "FFlagEnableSpatialUIScalingFix": {
    "mechanism": "Adjusts the scaling of user interface elements based on player position in the game.",
    "purpose": "Provides a better visual experience by ensuring UI elements are appropriately sized and positioned."
  },
  "DFIntVoiceChatHttpErrorsTelemetryThrottleHundredthsPercent": {
    "mechanism": "Monitors and limits the frequency of voice chat error reports to improve system efficiency.",
    "purpose": "Ensures smoother voice chat functionality by reducing unnecessary error notifications."
  },
  "FFlagAXDisableGamepadPanning": {
    "mechanism": "Disables the ability to pan the camera using gamepad controls.",
    "purpose": "Creates a more consistent gameplay experience for players using gamepads."
  },
  "FFlagEnableProfilePlatformDualCta_v5": {
    "mechanism": "Introduces a new call-to-action feature for player profiles on multiple platforms.",
    "purpose": "Encourages players to engage more with profiles, enhancing social interactions."
  },
  "FFlagVoiceAddWebrtClosedTransitionEnabled_Staged": {
    "mechanism": "Enables a smoother transition when closing voice chat using WebRTC technology.",
    "purpose": "Provides players with a more seamless experience when they stop using voice chat."
  },
  "FFlagLuaAppsServerTriggeredModals": {
    "mechanism": "Allows server-side scripts to trigger modal pop-ups in Lua applications.",
    "purpose": "Enhances interactivity by enabling notifications or prompts to players during gameplay."
  },
  "DFFlagEnableUpdateClientFeatureTimeoutListener2": {
    "mechanism": "Implements a listener that tracks timeouts for client feature updates.",
    "purpose": "Improves the reliability of updates, ensuring players receive new features without delays."
  },
  "DFFlagWriteFlagCacheAfterDynamicFetch_Staged": {
    "mechanism": "Stores flag settings in a cache after they are dynamically retrieved.",
    "purpose": "Speeds up access to flag settings, improving game performance for players."
  },
  "DFFlagRbxStorageRemoveOldCacheSkipEmpty": {
    "mechanism": "Removes outdated cached data from storage while skipping empty entries.",
    "purpose": "Optimizes storage space, ensuring players have a smoother experience without unnecessary data clutter."
  },
  "FFlagAXDisableHiddenCatalogCategoryPills": {
    "mechanism": "Disables the display of hidden category indicators in the catalog.",
    "purpose": "Makes the catalog cleaner by removing unnecessary category pills that users can't access."
  },
  "FFlagFixEmoteWarningSize_Staged": {
    "mechanism": "Adjusts the size of warning messages related to emotes.",
    "purpose": "Improves user experience by ensuring warnings are appropriately sized and easier to read."
  },
  "FFlagRemoveLeaveShortcutFromLeaveConfirm": {
    "mechanism": "Removes the shortcut option to leave a game from the confirmation dialog.",
    "purpose": "Prevents accidental game exits by requiring users to confirm their choice more deliberately."
  },
  "FFlagVoiceChatEnableSdpCompressionMaster3_Staged": {
    "mechanism": "Enables advanced compression for voice chat data.",
    "purpose": "Enhances voice chat quality and reduces lag for a smoother communication experience."
  },
  "FFlagFixTexturePackLoadingRetries": {
    "mechanism": "Improves the method for retrying failed texture pack loads.",
    "purpose": "Ensures that players can load their texture packs more reliably, enhancing visual experience."
  },
  "FFlagCorrectGuiStateMouseDownAndroid": {
    "mechanism": "Fixes the GUI state handling when a mouse button is pressed on Android devices.",
    "purpose": "Improves the responsiveness and accuracy of user interface interactions on Android."
  },
  "FFlagFixIsrDeferredPropResize": {
    "mechanism": "Addresses issues with resizing properties in deferred rendering scenarios.",
    "purpose": "Enhances visual stability and performance during property changes in games."
  },
  "FFlagPurchasePromptPriceShouldUseProductInfoPrice2": {
    "mechanism": "Updates the purchase prompt to display the correct product price from the product info.",
    "purpose": "Ensures players see the accurate price when making purchases, reducing confusion."
  },
  "FFlagAXMigrateResellersCardToAutofocus": {
    "mechanism": "Changes the focus behavior of reseller cards to automatically focus on the card when opened.",
    "purpose": "Makes it easier for players to interact with reseller cards without extra clicks."
  },
  "FFlagVoiceChatEnableSdpCompressionMaster3_IXP": {
    "mechanism": "Implements compression for voice chat data to optimize bandwidth usage.",
    "purpose": "Improves voice chat quality and reduces lag during conversations."
  },
  "FFlagVoiceConnectionApiSendSdpParsingErrorTelemetry": {
    "mechanism": "Sends error reports when there's an issue parsing connection data for voice chat.",
    "purpose": "Helps improve voice chat reliability by identifying and fixing connection issues."
  },
  "FFlagPerformanceTelemetryHandleSpuriousWake": {
    "mechanism": "Tracks and manages unexpected activity that wakes up the system to optimize performance.",
    "purpose": "Enhances game performance by reducing unnecessary wake-ups, leading to smoother gameplay."
  },
  "FFlagLuaAppEdpBackendV2HydrateLegacyIxp4": {
    "mechanism": "Updates the backend system to better support older game features.",
    "purpose": "Ensures older games continue to work well with new systems, improving overall player experience."
  },
  "FFlagLrMainMetrics": {
    "mechanism": "Collects and analyzes key performance data from the game.",
    "purpose": "Provides insights to improve game performance and player satisfaction."
  },
  "FFlagProfilePlatformEnableClickToCopyUsername": {
    "mechanism": "Allows users to easily copy usernames with a click.",
    "purpose": "Makes it simpler for players to share their usernames with friends."
  },
  "FFlagRemoveUpdatePromptChild_Staged": {
    "mechanism": "Removes the child update prompt from the user interface.",
    "purpose": "Simplifies the update process for players by reducing interruptions."
  },
  "FFlagAXMIgrateItemDetailsModalToAutofocus": {
    "mechanism": "Changes the item details modal to automatically focus on the main input field.",
    "purpose": "Makes it easier for players to interact with item details without extra clicks."
  },
  "FFlagRefactorIsTopBarFocused": {
    "mechanism": "Reorganizes how the focus state of the top bar is managed.",
    "purpose": "Improves navigation and usability of the top bar for players."
  },
  "DFIntTextChatCommandClientSentThrottlePermyriad": {
    "mechanism": "Limits how often chat commands can be sent from the client.",
    "purpose": "Prevents spam and ensures a smoother chat experience for players."
  },
  "FFlagSduiSupportArrayParsing": {
    "mechanism": "Enables the parsing of arrays in the SDUI (Service Display User Interface).",
    "purpose": "Enhances the flexibility and functionality of user interfaces for players."
  },
  "DFFlagEnableGameJoinChatTimeoutEvent_Staged": {
    "mechanism": "Triggers a timeout event for chat when joining a game.",
    "purpose": "Improves chat reliability by ensuring players are notified if chat fails to connect quickly."
  },
  "DFFlagRemoveTemporaryScreenshotFilePresave": {
    "mechanism": "Eliminates the temporary storage of screenshots before saving.",
    "purpose": "Streamlines the screenshot process, making it faster for players to save their images."
  },
  "FFlagEnableClientSettingAPIInProduction_IXP": {
    "mechanism": "Activates a new API for client settings in the live environment.",
    "purpose": "Allows players to customize their game settings more easily and efficiently."
  },
  "FFlagRemoveiOS13DeprecatedCode_Staged": {
    "mechanism": "Removes outdated code that is no longer supported in iOS 13.",
    "purpose": "Enhances app performance and stability for players using newer iOS versions."
  },
  "DFFlagVideoWinHwEncoderDeleteIfNoPool_Staged": {
    "mechanism": "Deletes hardware encoder resources if they are not in use.",
    "purpose": "Optimizes video processing, leading to smoother gameplay and better video quality for players."
  },
  "FFlagDisableRejoinGroupIdDoubleRead": {
    "mechanism": "Prevents the system from reading group ID information twice during rejoining a game.",
    "purpose": "Improves game performance by reducing unnecessary data processing when players rejoin."
  },
  "FFlagIsrMainMetrics_Staged": {
    "mechanism": "Enables a new method for collecting main gameplay metrics for analysis.",
    "purpose": "Helps developers understand player behavior better, leading to improved game experiences."
  },
  "FFlagFixDisplaySizeVR2": {
    "mechanism": "Adjusts the display size settings for virtual reality to ensure proper scaling.",
    "purpose": "Enhances the visual experience for VR players by making sure things look right in their headset."
  },
  "FFlagFCSkeletonIgnoreUnusedPartsCheckFaceControls_Staged": {
    "mechanism": "Allows the system to skip checks on unused parts of character skeletons in face controls.",
    "purpose": "Improves performance and responsiveness in facial animations for characters."
  },
  "DFStringAllowedPublicFlags_Staged": {
    "mechanism": "Defines a list of public flags that can be used in the game settings.",
    "purpose": "Gives developers more flexibility in customizing game features that players can access."
  },
  "FFlagProfilePlatformEnableEditAvatar_IXP": {
    "mechanism": "Enables the avatar editing feature on specific platforms.",
    "purpose": "Allows players to customize their avatars directly from those platforms."
  },
  "FFlagStudioFixStandalonePluginUnloadingAsync3_Staged": {
    "mechanism": "Improves the way plugins are unloaded in Roblox Studio, making it more efficient.",
    "purpose": "Reduces crashes and improves stability for developers using plugins in Studio."
  },
  "FFlagInitializeAutocompleteOnlyIfEnabledV3": {
    "mechanism": "Activates the autocomplete feature for coding only if it is turned on in settings.",
    "purpose": "Enhances the coding experience by providing suggestions only when desired."
  },
  "DFFlagLoadTestingEnabled3_PlaceFilter": {
    "mechanism": "Introduces a filtering system for load testing places.",
    "purpose": "Helps developers test specific places more effectively by filtering out unnecessary data."
  },
  "FFlagAXUnifiedLoggingValidation1": {
    "mechanism": "Standardizes the logging process for analytics across the platform.",
    "purpose": "Improves data tracking and analysis for better insights into player behavior."
  },
  "FFlagPassTextAlignmentRelevancyInfo": {
    "mechanism": "Improves how text alignment settings are passed to UI components.",
    "purpose": "Ensures that text in games displays correctly according to player settings."
  },
  "DFIntDataStoreFixedRequestLimit_PlaceFilter": {
    "mechanism": "Adjusts the request limits for data storage based on game place filters.",
    "purpose": "Enhances performance by allowing better data management for specific game areas."
  },
  "FFlagLuaAppShowAgeRatingWithPlayButtonOnTileHoverWithHiddenMetadata": {
    "mechanism": "Displays age ratings when hovering over game tiles with a play button.",
    "purpose": "Helps players quickly see if a game is suitable for their age before playing."
  },
  "FFlagStudioTasksFutureShareMutexes_Staged": {
    "mechanism": "Implements a system for managing simultaneous tasks in the development studio.",
    "purpose": "Improves the efficiency of game development by preventing conflicts when sharing resources."
  },
  "FFlagLuauOccursCheckInCommit": {
    "mechanism": "Enables checks for specific events during code commits in the Luau programming language.",
    "purpose": "Enhances code reliability by ensuring that important checks are performed before finalizing changes."
  },
  "FFlagNewBindToMessageError_Staged": {
    "mechanism": "Improves error handling when binding messages in the game.",
    "purpose": "Helps developers identify and fix message-related issues more easily."
  },
  "FFlagAXMarketplaceCategoryPillTooltip": {
    "mechanism": "Adds tooltips to marketplace category pills for better information.",
    "purpose": "Gives players more context about different categories in the marketplace."
  },
  "FFlagAppChatEnableHandheldScalingFixes": {
    "mechanism": "Adjusts chat scaling on handheld devices for better visibility.",
    "purpose": "Enhances the chat experience on mobile devices, making it easier to read."
  },
  "FFlagLuaAppFocusFixTopBanner": {
    "mechanism": "Fixes focus issues with the top banner in Lua applications.",
    "purpose": "Improves user interaction with the top banner for a smoother experience."
  },
  "DFFlagEnableUpdateClientFeatureTimeoutListener2_Staged": {
    "mechanism": "Implements a timeout listener for client updates to improve responsiveness.",
    "purpose": "Ensures players receive timely updates, enhancing overall game performance."
  },
  "DFFlagVoiceSdpCompressionSendSizeTelemetry_Staged": {
    "mechanism": "Tracks the size of voice data sent for compression.",
    "purpose": "Improves voice chat quality by optimizing data transmission."
  },
  "FFlagAXCategoryPillColorAnimationInstantOff": {
    "mechanism": "Changes the animation timing for category pill colors to be immediate.",
    "purpose": "Makes the interface more responsive and visually appealing."
  },
  "FFlagRemoveRespawnShortcutFromRespawnConfirmation": {
    "mechanism": "Removes the shortcut option during respawn confirmation.",
    "purpose": "Ensures players make a deliberate choice before respawning."
  },
  "DFFlagProductInfoBatchingEnabled2_PlaceFilter": {
    "mechanism": "Groups product information requests to improve efficiency.",
    "purpose": "Speeds up the loading of product details in the game."
  },
  "FFlagMediaPlaybackStopsWhenJoiningExperience_Staged": {
    "mechanism": "Stops media playback when a player joins a new game.",
    "purpose": "Prevents audio overlap and enhances the gaming experience."
  },
  "FFlagEnableAppChatFocusableFixes2": {
    "mechanism": "Improves focus handling in the chat interface.",
    "purpose": "Makes it easier for players to interact with chat without losing focus."
  },
  "FFlagEngineVoiceSdpCompressionIxpEnabled_Staged": {
    "mechanism": "Enables compression for voice data in the engine.",
    "purpose": "Reduces lag and improves voice chat quality for players."
  },
  "FFlagEnableCVSUrlForOtaPatch_Staged": {
    "mechanism": "Allows the use of a specific URL for over-the-air updates.",
    "purpose": "Ensures players receive timely updates and fixes automatically."
  },
  "DFFlagUseVisBugChecks_PlaceFilter": {
    "mechanism": "Implements visual bug checks when filtering places.",
    "purpose": "Helps players find places without visual issues, enhancing their experience."
  },
  "FFlagAXCategoryPillColorAnimationInstantOff_Staged": {
    "mechanism": "Changes the animation timing for category pill colors.",
    "purpose": "Provides a smoother visual transition for players when selecting categories."
  },
  "FFlagUKOSALegacyReportMenu_Staged": {
    "mechanism": "Updates the report menu to a legacy version for testing.",
    "purpose": "Improves the reporting experience for users by using a familiar interface."
  },
  "FFlagFixDisplaySizeEnum_Staged": {
    "mechanism": "Corrects the enumeration of display sizes in the system.",
    "purpose": "Ensures players see accurate size options for their devices."
  },
  "FFlagFixEmoteWarningSize": {
    "mechanism": "Adjusts the size of warnings related to emotes.",
    "purpose": "Enhances visibility and clarity of emote warnings for players."
  },
  "FFlagAXDisableCategoryPillsOnCatalogSearch": {
    "mechanism": "Removes category pills from the search results in the catalog.",
    "purpose": "Simplifies the search experience for players, making it easier to find items."
  },
  "FFlagEnableFAECancellationAnalytics": {
    "mechanism": "Tracks data on cancellations in the FAE process.",
    "purpose": "Helps improve the user experience by understanding why players cancel actions."
  },
  "FFlagProductInfoBatchingCoalescingEnabled_PlaceFilter": {
    "mechanism": "Groups product info requests to reduce server load.",
    "purpose": "Improves performance by speeding up product info retrieval for players."
  },
  "DFFlagVideoSandboxPreviewVideos_Staged": {
    "mechanism": "Allows testing of video previews in a controlled environment.",
    "purpose": "Enhances video experience by ensuring quality before public release."
  },
  "FFlagAppChatIllustrationsUpdate": {
    "mechanism": "Updates the visuals in chat with new illustrations.",
    "purpose": "Makes chat more engaging and visually appealing for players."
  },
  "DFFlagFixImageContentInvalid": {
    "mechanism": "Corrects issues with displaying invalid image content.",
    "purpose": "Ensures players see the correct images without errors."
  },
  "FFlagLuauCompileVectorLerp_Staged": {
    "mechanism": "Improves the way vector interpolation is processed in scripts.",
    "purpose": "Enhances the smoothness of movements and animations in games."
  },
  "DFFlagEnableCancelTouchesOnGameViewControllerDisappear_Staged": {
    "mechanism": "Cancels touch inputs when the game view controller is closed.",
    "purpose": "Prevents unintended actions when players exit the game interface."
  },
  "FIntServerTriggeredModalTrafficPercent": {
    "mechanism": "Controls the percentage of players who see server-triggered pop-ups.",
    "purpose": "Allows for targeted notifications or messages to players based on server conditions."
  },
  "FFlagProductInfoBatchingCoalescingEnabled": {
    "mechanism": "Groups multiple product information requests into a single call.",
    "purpose": "Reduces loading times and improves performance when accessing product details."
  },
  "DFStringLoadTestingUniverseId_PlaceFilter": {
    "mechanism": "Filters places based on a specific universe ID during load testing.",
    "purpose": "Helps developers test specific game environments more efficiently."
  },
  "FFlagUITextureRendererUseNewRenderPath_Staged": {
    "mechanism": "Switches to a new method for rendering user interface textures.",
    "purpose": "Enhances the visual quality and performance of UI elements for players."
  },
  "FFlagReconnectToSameServer": {
    "mechanism": "Allows players to reconnect to the same game server they were on before disconnecting.",
    "purpose": "Players can continue their game without losing progress or being moved to a different server."
  },
  "DFFlagISRPerfPass": {
    "mechanism": "Implements performance improvements for in-game rendering and interactions.",
    "purpose": "Enhances the overall gameplay experience by making the game run smoother and faster."
  },
  "FFlagReCacheIconsOnThemeChange": {
    "mechanism": "Updates and refreshes icons when the game's visual theme is changed.",
    "purpose": "Ensures that players see the correct icons that match the current theme, improving visual consistency."
  },
  "FFlagAXCategoryPillScrollToStart_Staged": {
    "mechanism": "Modifies the scrolling behavior of category selections in the user interface.",
    "purpose": "Makes it easier for players to navigate through categories by automatically scrolling to the start."
  },
  "FFlagAXCatalogReactPerfIXPEnabledV3": {
    "mechanism": "Optimizes the performance of the catalog interface using React technology.",
    "purpose": "Provides a faster and more responsive experience when browsing items in the catalog."
  },
  "FFlagVideoEncoderScopedOutputBuffer_Staged": {
    "mechanism": "Improves video encoding by using a more efficient output buffer.",
    "purpose": "Enhances video quality and reduces lag during gameplay."
  },
  "FFlagFixLockCenterMouseClickAndScroll_Staged": {
    "mechanism": "Fixes issues with mouse click and scrolling behavior in the game.",
    "purpose": "Provides a smoother and more responsive user interface for players."
  },
  "DFStringDataStoreRdbShadowTrafficRolloutConfig_PlaceFilter": {
    "mechanism": "Implements a filtering system for data storage based on specific places.",
    "purpose": "Improves data management and performance for game developers."
  },
  "DFIntTextChatMessageClientReceivedThrottlePermyriad_Staged": {
    "mechanism": "Limits the rate at which chat messages are processed on the client side.",
    "purpose": "Reduces chat spam and enhances the overall chat experience for players."
  },
  "FFlagLrMainMetrics_Staged": {
    "mechanism": "Collects and analyzes main performance metrics of the game.",
    "purpose": "Helps developers optimize game performance for a better player experience."
  },
  "DFIntISRInstanceBlockTimeoutWorldSteps": {
    "mechanism": "Sets a timeout for instance blocking during world steps.",
    "purpose": "Improves performance by preventing long delays in instance processing."
  },
  "FFlagUITextureRendererUseNewRenderPath": {
    "mechanism": "Switches to a new method for rendering UI textures.",
    "purpose": "Enhances visual quality and responsiveness of user interfaces."
  },
  "FFlagAXMigrateCenteredModalViewToAutoFocus": {
    "mechanism": "Automatically focuses on the centered modal view when opened.",
    "purpose": "Makes it easier for players to interact with modals without extra clicks."
  },
  "FStringFlipTimeStampFastString": {
    "mechanism": "Optimizes the way timestamps are processed in strings.",
    "purpose": "Increases speed and efficiency when handling time-related data."
  },
  "DFStringLoadTestName_PlaceFilter": {
    "mechanism": "Adds a filter for loading test names in places.",
    "purpose": "Helps developers manage and organize test names more effectively."
  },
  "FFlagEnableAudioSpeechToText_PlaceFilter": {
    "mechanism": "Enables speech-to-text conversion for audio in specific places.",
    "purpose": "Allows players to communicate using their voice, which gets converted to text in chat."
  },
  "FFlagAXExternalItemDetailsOverlay": {
    "mechanism": "Introduces a new overlay for displaying details of external items.",
    "purpose": "Enhances the user experience by providing more information about items without leaving the game."
  },
  "DFStringLoadTestArguments_PlaceFilter": {
    "mechanism": "Loads specific test arguments for string processing in designated places.",
    "purpose": "Improves performance and reliability of string handling in certain game areas."
  },
  "DFFlagISRDoNotCrashCanSkipNewInstanceCheckIfPropNull": {
    "mechanism": "Prevents crashes by allowing the system to skip checks if a property is null.",
    "purpose": "Increases game stability by reducing the chances of unexpected crashes during gameplay."
  },
  "FFlagLuauTypeCheckerVectorLerp": {
    "mechanism": "Enhances the type checking for vector linear interpolation functions.",
    "purpose": "Improves code accuracy and reduces errors for developers using vector lerp functions."
  },
  "DFIntDataStoreOrderedSetFixedRequestLimit_PlaceFilter": {
    "mechanism": "Limits the number of requests to the data store for specific places.",
    "purpose": "Improves performance by ensuring that data requests are handled efficiently."
  },
  "DFFlagEnableContextForGenerateList_Staged": {
    "mechanism": "Adds context options for generating lists in the game.",
    "purpose": "Enhances user experience by allowing more customization when creating lists."
  },
  "FFlagFixToggleMenuIconForTheFive_Staged": {
    "mechanism": "Corrects the icon display in the toggle menu for a specific feature.",
    "purpose": "Provides a clearer interface for players when using the toggle menu."
  },
  "FFlagAXAddStyleToItemCardPriceLine": {
    "mechanism": "Applies new styling to the price line on item cards.",
    "purpose": "Makes item prices more visually appealing and easier to read for players."
  },
  "FFlagStudioUseUIThread_Staged": {
    "mechanism": "Switches certain operations to run on the UI thread for better responsiveness.",
    "purpose": "Improves the overall performance and responsiveness of the game studio interface."
  },
  "DFFlagEnableGameJoinChatTimeoutEvent": {
    "mechanism": "Triggers an event when a player takes too long to join a game chat.",
    "purpose": "Helps players know if they need to retry joining the chat if it takes too long."
  },
  "FFlagFixBlurryImages": {
    "mechanism": "Improves the rendering of images to make them clearer.",
    "purpose": "Enhances the visual quality of images in games, making them look sharper."
  },
  "FFlagPlaceVersionHistoryMetadataRCC_Staged": {
    "mechanism": "Adds metadata for tracking different versions of a game.",
    "purpose": "Allows developers to manage and revert to previous versions of their games more easily."
  },
  "FFlagProfilePlatformEnableChipSocialRow_v6_IXP": {
    "mechanism": "Updates the social features on player profiles to a new design.",
    "purpose": "Makes it easier for players to connect and interact with friends on their profiles."
  },
  "FFlagAXCatalogCategoryPillsIXP": {
    "mechanism": "Introduces a new layout for browsing catalog categories.",
    "purpose": "Improves the shopping experience by making it simpler to find items in the catalog."
  },
  "FFlagStudioFixStandalonePluginUnloadingAsync3": {
    "mechanism": "Improves the process of unloading plugins in Studio to be asynchronous.",
    "purpose": "Allows for a smoother experience when using and switching between plugins in Roblox Studio."
  },
  "FFlagAXEnableItemDetailsTryOnPage2": {
    "mechanism": "Enables a new page layout for trying on items in the avatar shop.",
    "purpose": "Provides players with a better interface to preview and try on clothing and accessories."
  },
  "FFlagLuauTypeCheckerVectorLerp_Staged": {
    "mechanism": "Enhances type checking for the Vector Lerp function in Luau scripting.",
    "purpose": "Helps developers catch errors earlier, leading to more reliable scripts and smoother gameplay."
  },
  "FStringTextureTranscodeFidelityETC": {
    "mechanism": "Improves the quality of texture transcoding for certain image formats.",
    "purpose": "Enhances the visual quality of textures in games, making them look better for players."
  },
  "DFIntJoinLimitWin32x64": {
    "mechanism": "Sets a limit on the number of players that can join a game on 64-bit Windows systems.",
    "purpose": "Ensures better performance and stability by controlling player capacity in games."
  },
  "FFlagOnlyVisibleFramesAllowModal": {
    "mechanism": "Restricts modal dialogs to only appear in visible frames.",
    "purpose": "Improves user experience by ensuring modals don't pop up in hidden areas."
  },
  "FFlagDisableGalleryStopGap": {
    "mechanism": "Removes a delay in loading gallery images.",
    "purpose": "Makes image loading faster, allowing players to see content more quickly."
  },
  "FFlagProfilePlatformEnableClickToCopyUsername_Staged": {
    "mechanism": "Enables a feature to copy usernames with a click.",
    "purpose": "Simplifies sharing usernames, making it easier for players to connect."
  },
  "FFlagEnableAutomaticGainControlForAudioDeviceInput": {
    "mechanism": "Adjusts audio input levels automatically.",
    "purpose": "Enhances voice chat quality by balancing sound levels for clearer communication."
  },
  "FFlagNativeDialogManager_Staged": {
    "mechanism": "Implements a new system for managing dialog boxes.",
    "purpose": "Provides a smoother and more consistent experience when interacting with dialogs."
  },
  "DFStringFlipTimeStampDynamicString": {
    "mechanism": "Enables dynamic updates to timestamp strings in real-time.",
    "purpose": "Players see accurate, up-to-date time information without needing to refresh."
  },
  "FFlagNetworkInterface_Staged": {
    "mechanism": "Implements a new network interface for better data handling.",
    "purpose": "Improves game performance and reduces lag for a smoother gameplay experience."
  },
  "FFlagAppChatConversationOverlayRefactor": {
    "mechanism": "Redesigns the chat overlay for better usability.",
    "purpose": "Makes chatting easier and more intuitive for players during gameplay."
  },
  "FFlagLuaAppRecommendedGamesCollectionCarousel": {
    "mechanism": "Adds a carousel feature for displaying recommended games.",
    "purpose": "Helps players discover new games they might enjoy more easily."
  },
  "FFlagReconnectToSameServer_Staged": {
    "mechanism": "Allows players to reconnect to the same server after disconnection.",
    "purpose": "Ensures players can return to their game without losing progress or having to find a new server."
  },
  "FFlagAXCategoryPillPositionAnimation": {
    "mechanism": "Enables animated transitions for category pill positions in the UI.",
    "purpose": "Makes the user interface smoother and more visually appealing when navigating categories."
  },
  "DFFlagAndroidOomScoreTelemetry": {
    "mechanism": "Collects data on memory usage on Android devices to improve performance.",
    "purpose": "Helps optimize the game experience on Android by preventing crashes due to low memory."
  },
  "FFlagLuaAppFixSearchTextBoxWidth": {
    "mechanism": "Adjusts the width of the search text box in the Lua application.",
    "purpose": "Improves usability by ensuring the search box fits properly and is easier to use."
  },
  "FFlagAXCategoryPillPadding": {
    "mechanism": "Adjusts the spacing around category pills in the UI.",
    "purpose": "Enhances the layout for better readability and interaction in the interface."
  },
  "FFlagISREarlyFilterAnimatedJoints": {
    "mechanism": "Enables early filtering for animated joints in the game's rendering process.",
    "purpose": "Improves animation performance and responsiveness in games, making them feel more fluid."
  },
  "DFIntLoadTestStartTimeUnix_PlaceFilter": {
    "mechanism": "Filters places based on a specific start time for load testing.",
    "purpose": "Helps developers test their games more effectively by focusing on specific timeframes."
  },
  "FFlagExtendLightRangeTo120HideRolloutPropertyAndEnable": {
    "mechanism": "Increases the range of light sources in the game to 120 units.",
    "purpose": "Enhances visual quality by allowing better lighting effects in games."
  },
  "DFStringLoadTestingUniverseId_Staged": {
    "mechanism": "Uses a specific universe ID for load testing purposes.",
    "purpose": "Allows developers to test their games in a controlled environment before full release."
  },
  "FFlagEngineVoiceChatClientRewriteIxpEnabled_IXP": {
    "mechanism": "Implements a new system for voice chat functionality in the game engine.",
    "purpose": "Improves voice chat performance and reliability for players."
  },
  "FFlagUKOSALegacyReportMenu": {
    "mechanism": "Enables an older version of the reporting menu for user issues.",
    "purpose": "Provides familiarity for players who prefer the classic reporting interface."
  },
  "FFlagStudioActionsMultiplePayloads": {
    "mechanism": "Allows multiple actions to be sent in one request to the studio.",
    "purpose": "Improves efficiency when making changes in the studio, saving time for developers."
  },
  "FFlagEnableSocialSelfProfileViewExposureEvents": {
    "mechanism": "Tracks when users view their own profiles on the platform.",
    "purpose": "Helps improve social features by understanding user behavior better."
  },
  "FFlagEnableProfilePlatformDualCta_v5_IXP": {
    "mechanism": "Introduces two call-to-action buttons on user profiles for better engagement.",
    "purpose": "Encourages players to interact more with profiles, enhancing social connectivity."
  },
  "FFlagAXUnifiedLoggingValidation1_Staged": {
    "mechanism": "Standardizes the way logs are validated across different systems.",
    "purpose": "Improves reliability and consistency in tracking events for better user experience."
  },
  "FFlagLuauNoConstraintGenRecursionLimitIce": {
    "mechanism": "Removes limits on recursion for constraint generation in the Luau scripting language.",
    "purpose": "Allows developers to create more complex scripts without running into technical limitations."
  },
  "FFlagStudioActionsMultiplePayloads_Staged": {
    "mechanism": "Allows multiple actions to be sent at once in the studio.",
    "purpose": "Improves efficiency for developers by reducing the time needed to perform multiple tasks."
  },
  "DFIntLoadTestParticipationPerMillionUsers_PlaceFilter": {
    "mechanism": "Filters places based on user participation in load tests.",
    "purpose": "Helps ensure that only popular places are tested, improving the quality of the platform."
  },
  "FFlagEngineVoiceSdpCompressionIxpEnabled_IXP": {
    "mechanism": "Enables compression for voice data in the engine.",
    "purpose": "Reduces bandwidth usage for voice chat, leading to clearer audio and less lag."
  },
  "FFlagEnableCVSUrlForOtaPatch": {
    "mechanism": "Allows the use of a specific URL for over-the-air updates.",
    "purpose": "Ensures players receive timely updates and fixes without needing to manually download them."
  },
  "FFlagUIBloxFixModalBottomSheetSelectable": {
    "mechanism": "Fixes selection issues in modal bottom sheets within the UI framework.",
    "purpose": "Enhances user experience by making it easier to interact with modal dialogs."
  },
  "FFlagCreateConnectionInternalEarlierServer": {
    "mechanism": "Establishes server connections sooner in the game startup process.",
    "purpose": "Reduces waiting time for players to join games."
  },
  "FFlagRbxthumbForAlbumArt_Staged": {
    "mechanism": "Uses updated thumbnail images for album art in the platform.",
    "purpose": "Enhances visual appeal and improves user experience when browsing music."
  },
  "FFlagEnableFAECancellationAnalytics_Staged": {
    "mechanism": "Tracks and analyzes when players cancel actions in the game.",
    "purpose": "Helps developers understand player behavior to improve game design."
  },
  "FFlagMicroprofilerBigButtons": {
    "mechanism": "Introduces larger buttons in the microprofiler tool for easier interaction.",
    "purpose": "Makes it simpler for developers to analyze game performance."
  },
  "FFlagLuauRefineDistributesOverUnions": {
    "mechanism": "Refines how the Luau programming language handles distributions over unions.",
    "purpose": "Improves coding efficiency and reduces errors for developers."
  },
  "FFlagAXSendLegacyWidgetImpressions": {
    "mechanism": "Sends data about widget views using an older method.",
    "purpose": "Helps track how often players see certain widgets."
  },
  "DFIntRobloxTelemetryLoadTestEndThrottleHundredthsPercent_PlaceFilter": {
    "mechanism": "Adjusts the rate of data collection during load tests based on specific place filters.",
    "purpose": "Improves performance by managing how much data is collected during testing."
  },
  "FFlagFFlagFixLayeredSorting": {
    "mechanism": "Corrects the order in which layered clothing is displayed on avatars.",
    "purpose": "Ensures that clothing appears in the right order, enhancing avatar appearance."
  },
  "FFlagConvertVariantToCorrectType": {
    "mechanism": "Changes the data type of certain game elements to match their intended use.",
    "purpose": "Improves game functionality and reduces errors in gameplay."
  },
  "DFFlagVoiceSdpCompressionSendSizeTelemetry": {
    "mechanism": "Tracks the size of voice data being sent after compression.",
    "purpose": "Helps optimize voice chat performance and quality for players."
  },
  "FFlagAXMigrateEmoteMenuFromRoactGamepad_Staged": {
    "mechanism": "Moves the emote menu to a new system for better performance on gamepads.",
    "purpose": "Improves the experience of using emotes for players using game controllers."
  },
  "FFlagSlimServiceEnableUploadsInNonEditMode": {
    "mechanism": "Allows players to upload content even when not in edit mode.",
    "purpose": "Enables players to share their creations more easily without needing to enter editing tools."
  },
  "DFFlagWriteFlagCacheAfterDynamicFetch": {
    "mechanism": "Updates the system to save flag settings after they are retrieved dynamically.",
    "purpose": "Ensures players have consistent experiences by remembering their settings across sessions."
  },
  "FFlagIsrMainMetrics": {
    "mechanism": "Implements a new method for tracking main usage metrics.",
    "purpose": "Helps developers understand player behavior better, leading to improved game features."
  },
  "FFlagShowSocialContextToastToAll_Staged": {
    "mechanism": "Displays social notifications to all players instead of just a select few.",
    "purpose": "Keeps all players informed about social interactions, enhancing community engagement."
  },
  "DFFlagEnableCancelTouchesOnGameViewControllerDisappear": {
    "mechanism": "Allows touch inputs to be canceled when the game view controller is closed.",
    "purpose": "Prevents unintended actions when the game is closed, improving user experience."
  },
  "FFlagMicroprofilerBigButtons_Staged": {
    "mechanism": "Introduces larger buttons in the microprofiler for easier interaction.",
    "purpose": "Makes it simpler for developers to analyze performance metrics during game development."
  },
  "DFIntAcousticSimulationForegroundCost": {
    "mechanism": "Adjusts the resource cost for sound simulations while the game is active.",
    "purpose": "Optimizes sound quality without significantly impacting game performance."
  },
  "FFlagAXAddOverlayFocusHandlerToPurchaseLookPrompt": {
    "mechanism": "Adds a focus handler for overlays during purchase prompts.",
    "purpose": "Enhances accessibility by improving navigation for players using assistive technologies."
  },
  "FFlagFixDisplaySizeEnum": {
    "mechanism": "Corrects the enumeration of display sizes used in the game.",
    "purpose": "Ensures that games display correctly across different screen sizes, improving visual consistency."
  },
  "DFFlagEditableMeshFastClusterSkipLoD_Staged": {
    "mechanism": "Improves performance by skipping certain detail levels in mesh rendering.",
    "purpose": "Players experience faster loading times and smoother graphics in games with complex meshes."
  },
  "FFlagFixDisplaySizeVR2_Staged": {
    "mechanism": "Adjusts the display size settings for VR to ensure proper scaling.",
    "purpose": "Enhances the visual experience for VR users by making objects appear at the correct size."
  },
  "DFIntBadgeServiceMaximumBadgeGetCount_PlaceFilter": {
    "mechanism": "Sets a limit on the number of badges that can be retrieved based on specific game filters.",
    "purpose": "Ensures players can only access relevant badges, improving organization and clarity."
  },
  "FFlagNewBindToMessageError": {
    "mechanism": "Introduces a new method for handling errors related to messaging in scripts.",
    "purpose": "Helps developers troubleshoot issues more effectively, leading to smoother gameplay for players."
  },
  "FFlagAXMigrateQuickButtonsToGlobalAutoFocus": {
    "mechanism": "Moves quick action buttons to a global focus system for better accessibility.",
    "purpose": "Makes it easier for players to interact with buttons, enhancing the overall user experience."
  },
  "FFlagAppChatEnableHandheldScalingFixes_Staged": {
    "mechanism": "Adjusts chat interface scaling for handheld devices.",
    "purpose": "Improves chat readability and usability on mobile devices."
  },
  "FFlagLuaAppFocusFixTopBanner_Staged": {
    "mechanism": "Resolves focus issues with the top banner in Lua applications.",
    "purpose": "Enhances user experience by ensuring the top banner is always accessible."
  },
  "FFlagFixKeyboardFocusInfiniteLoop_Staged": {
    "mechanism": "Prevents keyboard focus from getting stuck in a loop.",
    "purpose": "Ensures players can navigate the game smoothly without focus issues."
  },
  "FFlagProductInfoBatchingCoalescingEnabled_Staged": {
    "mechanism": "Groups multiple product info requests to reduce server load.",
    "purpose": "Speeds up product information loading times for players."
  },
  "FFlagAppChatFixPaddingWhenScaling_Staged": {
    "mechanism": "Adjusts padding in the chat interface when the screen size changes.",
    "purpose": "Ensures chat messages are displayed properly without clipping or overflow."
  },
  "DFIntTextChatCommandClientSentThrottlePermyriad_Staged": {
    "mechanism": "Limits the number of chat commands a player can send in a given time frame.",
    "purpose": "Prevents spam and ensures a smoother chat experience."
  },
  "FFlagLuaAppSupportEmptyStringFooterMetadata": {
    "mechanism": "Allows the Lua app to handle empty string metadata without errors.",
    "purpose": "Improves app stability and user experience when no metadata is available."
  },
  "DFFlagAudioSpeechToTextRequireVoiceChat2": {
    "mechanism": "Requires players to use voice chat for speech-to-text features.",
    "purpose": "Enhances communication by ensuring only voice chat users can access this feature."
  },
  "FFlagAXCategoryPillColorAnimation": {
    "mechanism": "Enables animated color transitions for category pills in the UI.",
    "purpose": "Makes the interface more visually appealing and engaging for players."
  },
  "DFFlagVoiceSdpCompressionRemoteEventFieldReceivesUnexpectedValue_Staged": {
    "mechanism": "Fixes issues where unexpected values are received in voice communication events.",
    "purpose": "Improves voice chat reliability and performance for users."
  },
  "FFlagLuaAppAddSortDataToSocialCarouselClicks": {
    "mechanism": "Adds sorting data to the social carousel click events in the Lua app.",
    "purpose": "Improves the organization of social interactions, making it easier for players to find friends and connections."
  },
  "FFlagNetworkInterface": {
    "mechanism": "Introduces a new network interface for better communication between game clients and servers.",
    "purpose": "Enhances game performance and stability, leading to a smoother gaming experience for players."
  },
  "DFFlagVoiceSdpCompressionRemoteEventFieldReceivesUnexpectedValue": {
    "mechanism": "Addresses issues with unexpected values in remote events related to voice data compression.",
    "purpose": "Ensures more reliable voice communication during gameplay, improving player interactions."
  },
  "FFlagFCSkeletonIgnoreUnusedPartsCheckFaceControls": {
    "mechanism": "Modifies the skeleton system to ignore checks on unused parts for face controls.",
    "purpose": "Optimizes character animations and controls, allowing for more fluid and responsive movements."
  },
  "DFFlagVoiceSdpCompressionSendProtoParseErrorTelemetry_Staged": {
    "mechanism": "Collects telemetry data on parsing errors related to voice data compression.",
    "purpose": "Helps developers identify and fix voice communication issues, enhancing the overall player experience."
  },
  "DFFlagEditableMeshFastClusterSkipLoD": {
    "mechanism": "Optimizes mesh rendering by skipping certain detail levels.",
    "purpose": "Improves performance and loading times for complex 3D models."
  },
  "FFlagRemoveiOS13DeprecatedCode": {
    "mechanism": "Removes outdated code that is no longer supported on iOS.",
    "purpose": "Ensures smoother gameplay and better compatibility for iOS users."
  },
  "FFlagVoiceConnectionApiSendSdpParsingErrorTelemetry_Staged": {
    "mechanism": "Tracks errors in voice connection setup for debugging.",
    "purpose": "Helps improve voice chat reliability by identifying issues."
  },
  "FixIsolatedGmaSdkCleanDisconnect": {
    "mechanism": "N/A (invalid)",
    "purpose": "N/A (invalid)"
  },
  "FFlagSongbirdPopoverSubmenu2": {
    "mechanism": "Introduces a new submenu for managing songbird features.",
    "purpose": "Provides players with easier access to music-related settings and options."
  },
  "FFlagLuauCompileVectorLerp": {
    "mechanism": "Enables a more efficient way to calculate vector interpolation in the Luau scripting language.",
    "purpose": "Improves performance and responsiveness in games that use vector calculations."
  },
  "DFFlagVoiceSdpCompressionSendProtoParseErrorTelemetry": {
    "mechanism": "Tracks and reports errors related to voice chat data processing.",
    "purpose": "Helps developers identify and fix voice chat issues, enhancing communication quality for players."
  },
  "DFFlagSkipSavingEmptyCapture_Staged": {
    "mechanism": "Prevents saving empty data captures during game testing.",
    "purpose": "Reduces unnecessary data storage, making game testing more efficient."
  },
  "FFlagReverbAbsorptionField": {
    "mechanism": "Introduces a new audio feature that simulates sound absorption in environments.",
    "purpose": "Enhances the realism of sound in games, making audio experiences more immersive."
  },
  "UseApplicationLifecycleCallbacks": {
    "mechanism": "N/A (invalid)",
    "purpose": "N/A (invalid)"
  },
  "DFIntProductInfoBatchingMaxSize_PlaceFilter": {
    "mechanism": "Limits the number of product info requests processed at once for specific places.",
    "purpose": "Improves performance by reducing server load when fetching product information."
  },
  "FFlagAXBackgroundSceneManagerRevamp3_Staged": {
    "mechanism": "Updates the way background scenes are managed in the game engine.",
    "purpose": "Enhances visual quality and performance of background scenes in games."
  },
  "FFlagStudioUseUIThread": {
    "mechanism": "Enables the use of the user interface thread for certain operations in the studio.",
    "purpose": "Makes the development environment more responsive and smoother for creators."
  },
  "FFlagAXCategoryPillScrollToStart": {
    "mechanism": "Allows category pills in the UI to scroll back to the start position.",
    "purpose": "Improves navigation for players when browsing categories in the interface."
  },
  "FFlagInternalExportHandleMisnamedR15Bones": {
    "mechanism": "Fixes issues with exporting models that have incorrectly named R15 bones.",
    "purpose": "Ensures smoother exporting of character models for developers, reducing errors."
  },
  "DFFlagCLI169073": {
    "mechanism": "Enables a command line interface feature for developers.",
    "purpose": "Improves the development experience by allowing easier access to commands."
  },
  "FStringTutorialUpsellPlaceId": {
    "mechanism": "Links tutorial prompts to specific game places.",
    "purpose": "Encourages players to try out tutorials in relevant games."
  },
  "FFlagUnsyncBreakpointsInClonedScripts": {
    "mechanism": "Allows breakpoints in scripts to remain active even when cloned.",
    "purpose": "Helps developers debug more effectively by maintaining breakpoints."
  },
  "FFlagAddFriendsConsistentFocusActions": {
    "mechanism": "Standardizes friend-related actions across the platform.",
    "purpose": "Makes it easier for players to manage their friends list consistently."
  },
  "DFFlagVideoWinHwEncoderDeleteIfNoPool": {
    "mechanism": "Removes unused video encoding resources when not needed.",
    "purpose": "Optimizes performance by freeing up resources for better gameplay."
  },
  "FFlagEnableConfirmButtonIconOnPlaystation": {
    "mechanism": "Displays a confirm button icon specifically for Playstation controllers.",
    "purpose": "Helps players easily identify the confirm action while using a Playstation controller."
  },
  "DFStringLoadTestingUniverseId": {
    "mechanism": "Loads a specific universe ID for testing purposes.",
    "purpose": "Allows developers to test features in a controlled environment before public release."
  },
  "DFFlagEnableGenerateRecommendationItemListFromRcc2": {
    "mechanism": "Generates a list of recommended items based on user preferences using RCC2.",
    "purpose": "Provides players with personalized item suggestions to enhance their experience."
  },
  "FFlagAXFixFocusNavigationShiftingWidgetList": {
    "mechanism": "Fixes navigation issues when focusing on widget lists.",
    "purpose": "Improves accessibility and usability for players navigating through lists."
  },
  "FFlagLuaAppAddSortDataToPymkCarouselClicks": {
    "mechanism": "Adds sorting data to clicks on the 'People You May Know' carousel.",
    "purpose": "Enhances the relevance of suggestions shown to players, making it easier to connect with friends."
  },
  "DFIntJoinLimitWin32x64_Staged": {
    "mechanism": "Limits the number of players joining a game on 64-bit Windows systems.",
    "purpose": "Ensures smoother gameplay by managing server load."
  },
  "FFlagLuauVectorLerp": {
    "mechanism": "Introduces a new method for smoothly transitioning between two points in 3D space.",
    "purpose": "Enhances animations and movements for a more fluid gaming experience."
  },
  "FFlagSolverV2RefactorReplicationStateUpdate": {
    "mechanism": "Improves how game state updates are synchronized across players.",
    "purpose": "Reduces lag and ensures all players see the same game events simultaneously."
  },
  "FFlagVoiceAddWebrtClosedTransitionEnabled": {
    "mechanism": "Implements a new method for handling voice chat transitions.",
    "purpose": "Improves the quality and reliability of voice communication in games."
  },
  "FFlagReverbAbsorptionFieldFileFormat": {
    "mechanism": "Changes the file format for sound reverb settings in games.",
    "purpose": "Allows for more realistic sound effects, enhancing the overall audio experience."
  },
  "FFlagAXQuickButtonsFrameShouldAlwaysExist": {
    "mechanism": "Ensures that the quick buttons frame is always present in the user interface.",
    "purpose": "Players will have consistent access to quick action buttons, improving gameplay efficiency."
  },
  "FStringLuaOTATag": {
    "mechanism": "Tags certain Lua scripts for easier identification and management.",
    "purpose": "Helps developers organize and optimize scripts, leading to smoother game performance for players."
  },
  "FFlagSelfieConsentDialogDontUsePortal": {
    "mechanism": "Changes how the selfie consent dialog is displayed, avoiding the use of a portal.",
    "purpose": "Provides a more straightforward experience for players when taking selfies, enhancing user experience."
  },
  "FIntOcclusionSolverInitialMaxSearchIterations": {
    "mechanism": "Adjusts the maximum number of iterations for the occlusion solver in rendering.",
    "purpose": "Improves the visual performance of games, making them run smoother and look better for players."
  },
  "FFlagFCDecrementVertexCount": {
    "mechanism": "Reduces the number of vertices in 3D models to optimize performance.",
    "purpose": "Helps games run more efficiently, leading to faster load times and better frame rates for players."
  },
  "FFlagFixTexturePackLoadingRetries_Staged": {
    "mechanism": "Improves the retry logic for loading texture packs if they fail initially.",
    "purpose": "Ensures players can load texture packs more reliably, enhancing visual experiences."
  },
  "FFlagFCDecrementVertexCount_Staged": {
    "mechanism": "Reduces the number of vertices in 3D models to optimize performance.",
    "purpose": "Improves game performance, leading to smoother gameplay for players."
  },
  "FFlagPerfDataOnTelemetryV2": {
    "mechanism": "Collects more detailed performance data for analysis.",
    "purpose": "Helps developers identify and fix performance issues, resulting in a better gaming experience."
  },
  "FStringFlagRepoGitHashFastString": {
    "mechanism": "Utilizes a fast string representation of the Git hash for version tracking.",
    "purpose": "Ensures players benefit from the latest updates and fixes quickly."
  },
  "FFlagAddDismissTopBarFocus": {
    "mechanism": "Adds functionality to dismiss focus from the top bar in the UI.",
    "purpose": "Improves user interface interaction, making it easier for players to navigate the game."
  },
  "DFFlagBacktraceAPIQueryParamFix": {
    "mechanism": "Fixes how error tracking parameters are handled in API calls.",
    "purpose": "Improves the accuracy of error reporting, helping developers fix bugs faster."
  },
  "FIntServerTriggeredModalTrafficPercent_Staged": {
    "mechanism": "Controls the percentage of players who see server-triggered pop-up modals.",
    "purpose": "Allows for testing new features gradually, ensuring a smoother experience for players."
  },
  "FFlagAddSwitchTabHintsToIEM2": {
    "mechanism": "Adds hints for switching tabs in the user interface.",
    "purpose": "Enhances user navigation, making it easier for players to find and switch between different game sections."
  },
  "FFlagFixHapticWaveformReplication": {
    "mechanism": "Improves the way haptic feedback is sent and received across devices.",
    "purpose": "Provides a more consistent and immersive tactile experience for players using compatible devices."
  },
  "FFlagEnableAppNavGamepadRemoval": {
    "mechanism": "Removes the gamepad navigation option from the app interface.",
    "purpose": "Streamlines the user interface for players who do not use gamepads, improving usability."
  },
  "FFlagLuauVectorLerp_Staged": {
    "mechanism": "Enables a new method for smoothly transitioning between vector positions in scripts.",
    "purpose": "Improves the visual quality of movements and animations in games."
  },
  "FFlagFlyweightTrackId": {
    "mechanism": "Optimizes how track IDs are managed in the game engine, reducing memory usage.",
    "purpose": "Enhances game performance, leading to smoother gameplay experiences."
  },
  "FFlagSTM6819Enabled": {
    "mechanism": "Activates a specific feature set related to state management in game scripts.",
    "purpose": "Allows developers to create more complex and responsive game mechanics."
  },
  "FFlagAXSavePreviousPageFromQuickMenu": {
    "mechanism": "Saves the last accessed page in the quick menu for easier navigation.",
    "purpose": "Makes it quicker for players to return to their previous menu selections."
  },
  "FFlagMediaPlaybackStopsWhenJoiningExperience": {
    "mechanism": "Pauses any media playback when a player joins a game.",
    "purpose": "Prevents distractions from ongoing media, ensuring a smoother transition into the game."
  },
  "FFlagSelfieConsentDontMountUnused": {
    "mechanism": "Prevents unnecessary mounting of selfie consent UI elements.",
    "purpose": "Improves performance by not loading unused UI components for players."
  },
  "DFIntTextChatMessageClientReceivedThrottlePermyriad": {
    "mechanism": "Limits the rate at which chat messages are processed on the client side.",
    "purpose": "Reduces spam and improves chat experience by controlling message flow."
  },
  "FFlagPassTextAlignmentRelevancyInfo_Staged": {
    "mechanism": "Enhances text alignment features in the game engine.",
    "purpose": "Allows for better text formatting, making in-game messages clearer and more visually appealing."
  },
  "FFlagStudioTasksFutureShareMutexes": {
    "mechanism": "Implements mutexes for task sharing in the development studio.",
    "purpose": "Enhances collaboration features for developers, making it easier to work together on projects."
  },
  "FFlagBuyActionBarShouldNotUnrenderInFullscreenMode": {
    "mechanism": "Ensures the buy action bar remains visible in fullscreen mode.",
    "purpose": "Improves user experience by keeping essential purchase options accessible while playing."
  },
  "DFFlagLoadTestingEnabled3_Staged": {
    "mechanism": "Enables a feature for testing game performance under load conditions.",
    "purpose": "Helps developers ensure their games run smoothly even with many players."
  },
  "FFlagCleanUpMouseWrapMode": {
    "mechanism": "Modifies how the mouse cursor behaves when it reaches the screen edges.",
    "purpose": "Improves player experience by making mouse control more intuitive."
  },
  "FStringEngineVoiceSdpCompressionIxpLayer_IXP": {
    "mechanism": "Implements a specific compression method for voice chat data.",
    "purpose": "Enhances voice chat quality and reduces lag during conversations."
  },
  "DFFlagFixImageContentInvalid_Staged": {
    "mechanism": "Addresses issues with displaying images that are not loading correctly.",
    "purpose": "Ensures players see the correct images in games, improving visual experience."
  },
  "FFlagAndroidTrimMemoryCounters": {
    "mechanism": "Tracks and manages memory usage on Android devices more effectively.",
    "purpose": "Helps games run better on mobile by preventing crashes due to memory overload."
  },
  "FFlagAXFixBuyActionBarNotAppearing2": {
    "mechanism": "Fixes a bug that prevents the buy action bar from showing up in certain situations.",
    "purpose": "Ensures players can easily access the buy options when they need to purchase items."
  },
  "AndroidAddActivityManagerMemoryClassifications": {
    "mechanism": "N/A (invalid)",
    "purpose": "N/A (invalid)"
  },
  "FFlagAXSendLegacyWidgetImpressions_Staged": {
    "mechanism": "Sends data about widget impressions using an older method for testing.",
    "purpose": "Helps developers understand how players interact with widgets, leading to better designs."
  },
  "FFlagAddFriendsEmptyStateUpdate": {
    "mechanism": "Updates the display when a player has no friends added.",
    "purpose": "Provides a clearer message to players about adding friends, encouraging social interaction."
  },
  "FFlagAXCatalogReactPerfIXPEnabledV3_Staged": {
    "mechanism": "Enhances the performance of the catalog using a new technology.",
    "purpose": "Makes browsing and purchasing items in the catalog faster and smoother for players."
  },
  "FFlagAXMigrateCommunityAvatarEntryButtonToLocalRef": {
    "mechanism": "Moves the button for community avatars to a local reference for faster access.",
    "purpose": "Improves the speed and reliability of accessing community avatar features."
  },
  "FFlagLuaAppsServerTriggeredModals_Staged": {
    "mechanism": "Enables server-triggered pop-up modals in Lua apps for better user interaction.",
    "purpose": "Enhances user experience by allowing important notifications or actions to appear at the right time."
  },
  "FFlagAXCategoryPillInstantFadeOut": {
    "mechanism": "Changes the visual effect of category pills to fade out instantly instead of gradually.",
    "purpose": "Provides a smoother and quicker visual transition when categories are changed."
  },
  "DFFlagWriteTombstoneAfterDynamicFetch": {
    "mechanism": "Writes a record (tombstone) after fetching data dynamically to manage data integrity.",
    "purpose": "Ensures that data is accurately tracked and managed, improving overall game stability."
  },
  "FFlagShowSocialContextToastToAll": {
    "mechanism": "Displays social context notifications to all players instead of just a select few.",
    "purpose": "Keeps all players informed about social interactions, enhancing community engagement."
  },
  "DFIntProductIdProductInfoCacheLifetimeSeconds_PlaceFilter": {
    "mechanism": "Caches product information for a set duration to reduce server requests.",
    "purpose": "Improves loading times for players by quickly accessing product info without repeated server calls."
  },
  "DFFlagEnableGenerateRecommendationItemListFromRcc2_Staged": {
    "mechanism": "Generates a list of recommended items based on player preferences using a new system.",
    "purpose": "Provides players with personalized item suggestions to enhance their shopping experience."
  },
  "FFlagSongbirdPopoverSubmenu2_Staged": {
    "mechanism": "Introduces a new submenu in the Songbird interface for easier navigation.",
    "purpose": "Makes it simpler for players to find and access different features within the Songbird system."
  },
  "FFlagIncreaseEffectiveLightGridRadius": {
    "mechanism": "Expands the area where lighting effects are applied in the game.",
    "purpose": "Enhances the visual quality of games by improving lighting effects over a larger area."
  },
  "FFlagUIBloxTruncateExperienceTileMetadataTextFooter": {
    "mechanism": "Shortens text in the footer of experience tiles to fit better within the UI.",
    "purpose": "Improves the appearance and readability of experience tiles for players."
  },
  "FFlagVideoGamePreviewSessionTracking": {
    "mechanism": "Tracks player sessions during video game previews for analytics.",
    "purpose": "Helps developers understand player engagement in game previews."
  },
  "FFlagSduiSupportArrayParsing_Staged": {
    "mechanism": "Enables parsing of arrays in the new UI system for better data handling.",
    "purpose": "Improves the user interface by allowing more complex data structures."
  },
  "DFFlagProductInfoBatchingEnabled_PlaceFilter": {
    "mechanism": "Groups product information requests to optimize data retrieval.",
    "purpose": "Makes loading product information faster and smoother for players."
  },
  "FFlagColorPickerUseGridLayout": {
    "mechanism": "Changes the layout of the color picker to a grid format.",
    "purpose": "Provides a more organized and visually appealing way to select colors."
  },
  "FFlagSduiComponentSkipParseLocalProps": {
    "mechanism": "Skips parsing local properties in certain UI components for efficiency.",
    "purpose": "Enhances performance by reducing unnecessary processing in the UI."
  },
  "FFlagDisableEtcFallback": {
    "mechanism": "Disables the fallback mechanism for certain features in the game engine.",
    "purpose": "Improves game performance by ensuring that only the intended features are used, reducing potential errors."
  }
}