{
  "FFlagUseNewCorrelateProfilerDataFunction_Staged": {
    "mechanism": "Implements a new function to gather performance data more effectively.",
    "purpose": "Helps developers optimize games by providing better insights into performance issues."
  },
  "FFlagStatusFileMutex": {
    "mechanism": "Introduces a locking mechanism to prevent file access conflicts.",
    "purpose": "Ensures smoother operation by avoiding errors when multiple processes try to access the same files."
  },
  "DFFlagEnableContentTypeInRegister_Staged": {
    "mechanism": "Allows content types to be specified during the registration of assets.",
    "purpose": "Improves organization and management of assets for developers, making it easier to find and use them."
  },
  "DFFlagAddTranslationDisplayMode_PlaceFilter": {
    "mechanism": "Adds a new mode for displaying translations in the place filter.",
    "purpose": "Enhances user experience by allowing players to find games in their preferred language more easily."
  },
  "FFlagSettingsPageScaleTextSize_Staged": {
    "mechanism": "Enables scaling of text size on the settings page based on user preferences.",
    "purpose": "Improves accessibility for players by allowing them to adjust text size for better readability."
  },
  "DFIntPerfDataGlobalThrottleHundredthsPercent": {
    "mechanism": "Limits the performance data collection to a percentage of the total to reduce server load.",
    "purpose": "Improves game performance by minimizing the impact of data tracking on server resources."
  },
  "FFlagDisableNpotException": {
    "mechanism": "Disables a specific error that occurs when using non-power-of-two textures.",
    "purpose": "Allows developers to use a wider range of textures without encountering errors, enhancing game visuals."
  },
  "FFlagAXGeneralizeInventoryItemsList": {
    "mechanism": "Modifies how inventory items are retrieved and displayed in a more flexible format.",
    "purpose": "Provides a better and more organized inventory experience for players."
  },
  "DFFlagParseDepartureIntentAsEnum": {
    "mechanism": "Changes how departure intents are interpreted into a standardized format.",
    "purpose": "Improves the accuracy of player actions and enhances overall gameplay experience."
  },
  "DFFlagClientScriptTimeout": {
    "mechanism": "Sets a maximum time limit for client scripts to run before they are automatically stopped.",
    "purpose": "Prevents scripts from hanging indefinitely, ensuring smoother gameplay and responsiveness."
  },
  "DFFlagDeserializeMetadataCLI171425": {
    "mechanism": "Enables the system to read and process metadata more efficiently.",
    "purpose": "Improves the loading speed and performance of games by handling data better."
  },
  "FFlagEnableTelemetryIntegrationCheck": {
    "mechanism": "Activates checks for data collection and analysis tools.",
    "purpose": "Helps developers understand player behavior and improve game features."
  },
  "DFFlagCLI171730AddSizeCheck": {
    "mechanism": "Adds a verification step to ensure game assets are within size limits.",
    "purpose": "Prevents performance issues by ensuring that game files are not too large."
  },
  "FIntImprovedStrokesBetaFeatureRolloutPercent": {
    "mechanism": "Gradually introduces a new feature to a percentage of players.",
    "purpose": "Allows players to experience enhanced drawing tools in games."
  },
  "FFlagAXFixReactPerfExperimentCounter_Staged": {
    "mechanism": "Implements fixes to improve performance in React-based components.",
    "purpose": "Enhances the responsiveness and smoothness of user interfaces in games."
  },
  "FFlagGetGameIconsFromThumbnailsDeliveryApiIxp": {
    "mechanism": "Fetches game icons using a new API for thumbnails.",
    "purpose": "Improves the speed and quality of game icons displayed to players."
  },
  "FFlagTopBarSignalizeSetCores_IXP": {
    "mechanism": "Updates the top bar to reflect changes in core features.",
    "purpose": "Provides players with clearer notifications about important updates and features."
  },
  "FFlagAXAvatarTileNoDefaultOutfitInfo": {
    "mechanism": "Removes default outfit information from avatar tiles.",
    "purpose": "Gives players a cleaner and more personalized view of avatars without clutter."
  },
  "FFlagAXPrefetchMarketplaceIXP2_Staged": {
    "mechanism": "Preloads marketplace items to enhance loading times.",
    "purpose": "Allows players to access marketplace items faster, improving their shopping experience."
  },
  "FFlagAXMigrateTryOnItemScreenToAutofocus_Staged": {
    "mechanism": "Changes the item try-on screen to automatically focus on the item.",
    "purpose": "Makes it easier for players to see and try on items without extra clicks."
  },
  "FFlagDisableNpotException_Staged": {
    "mechanism": "Prevents errors related to non-power-of-two textures.",
    "purpose": "Improves game stability by reducing crashes from texture issues."
  },
  "FFlagFoundationDialogHeroImageOnlyFix": {
    "mechanism": "Fixes the display of hero images in dialog boxes.",
    "purpose": "Enhances the visual experience by ensuring images load correctly."
  },
  "DFFlagSupportNetworkValueFormatRandom2_Staged": {
    "mechanism": "Introduces a new format for displaying network values.",
    "purpose": "Makes network data easier to understand for players."
  },
  "DFFlagProcessStatisticsMemoryFix_Staged": {
    "mechanism": "Addresses memory usage issues in process statistics.",
    "purpose": "Improves performance by reducing memory-related problems."
  },
  "FFlagRefactorHelpPage5_IXP": {
    "mechanism": "Updates the structure of the help page.",
    "purpose": "Provides clearer information and better navigation for players seeking help."
  },
  "FFlagNativePurchaseRobuxPageWrapperEnableTelemetry": {
    "mechanism": "Enables tracking of user interactions on the Robux purchase page.",
    "purpose": "Helps improve the purchase experience by understanding how players use the page."
  },
  "FFlagFlagRolloutTestStaticBool16_Staged": {
    "mechanism": "Tests a specific feature rollout using a static boolean value.",
    "purpose": "Allows developers to experiment with new features safely before full release."
  },
  "FFlagFriendsRoduxFixBlock": {
    "mechanism": "Fixes issues in the friends system using a state management approach.",
    "purpose": "Ensures a smoother experience when managing and interacting with friends."
  },
  "FFlagFoundationDialogBodyUpdate": {
    "mechanism": "Updates the content and layout of dialog boxes in the user interface.",
    "purpose": "Enhances clarity and usability of dialog boxes for better player interaction."
  },
  "DFFlagCLI172177": {
    "mechanism": "Enables a specific command-line interface feature for developers.",
    "purpose": "Improves developer tools, leading to better game development experiences."
  },
  "FFlagStreamJobRefactorSetCollection": {
    "mechanism": "Refactors how job data is collected and managed in streaming.",
    "purpose": "Improves the efficiency and reliability of game data handling during streaming."
  },
  "FIntImprovedStrokesBetaFeatureRolloutPercent_Staged": {
    "mechanism": "Gradually introduces a new feature related to strokes in the game.",
    "purpose": "Enhances drawing or painting tools for players, making them more effective."
  },
  "FFlagFixDelayAfterPurchaseFlowComplete_Staged": {
    "mechanism": "Addresses delays that occur after completing a purchase in the game.",
    "purpose": "Provides a smoother and faster experience for players after they buy items."
  },
  "DFFlagHttpCurlHttp2Enabled2": {
    "mechanism": "Enables the use of HTTP/2 for improved data transfer.",
    "purpose": "Reduces loading times and improves the speed of online interactions in games."
  },
  "FFlagFixXboxActiveGamepadMismatch": {
    "mechanism": "Fixes issues where the wrong gamepad is recognized on Xbox.",
    "purpose": "Ensures players can use their intended gamepad without issues, enhancing gameplay."
  },
  "FFlagExplorerFilterActionContext_Staged": {
    "mechanism": "Enables a new context menu for filtering items in the Explorer.",
    "purpose": "Helps developers quickly find and manage their game objects."
  },
  "FFlagHelpPageIXPExposure_Staged": {
    "mechanism": "Increases visibility of help pages for new users.",
    "purpose": "Provides better support and guidance for players learning the platform."
  },
  "FFlagHelpPageMountVR3_IXP": {
    "mechanism": "Integrates VR help pages into the existing help system.",
    "purpose": "Offers tailored assistance for players using virtual reality."
  },
  "FFlagSettingsPageScaleTextSize": {
    "mechanism": "Allows users to adjust the text size on the settings page.",
    "purpose": "Improves accessibility for players with different visual needs."
  },
  "FFlagFixDelayAfterPurchaseFlowComplete": {
    "mechanism": "Reduces the waiting time after completing a purchase.",
    "purpose": "Enhances the shopping experience by making it faster for players to continue playing."
  },
  "FFlagInExperienceContainerScreenSizeReducer_Staged": {
    "mechanism": "Reduces the size of the experience container for better layout management.",
    "purpose": "Improves the visual experience by making better use of screen space."
  },
  "FFlagSwapAppGameTileAndSduiGameTileInRFY_Staged": {
    "mechanism": "Swaps the display of game tiles in the app and SDUI for consistency.",
    "purpose": "Enhances user experience by providing a uniform look across different interfaces."
  },
  "FFlagMoveNewPlayerListDividers": {
    "mechanism": "Adjusts the positioning of dividers in the new player list.",
    "purpose": "Makes it easier for players to navigate and find friends in the player list."
  },
  "FFlagLuaAppScrollableDesktopCarousels2_Staged": {
    "mechanism": "Introduces scrollable carousels in the desktop app using Lua.",
    "purpose": "Allows players to easily browse through content without cluttering the screen."
  },
  "FFlagAEGetEditableOutfitsType_Staged": {
    "mechanism": "Enables access to different types of editable outfits for players.",
    "purpose": "Gives players more customization options for their avatars."
  },
  "DFFlagNoCallstackAppendTarget_Staged": {
    "mechanism": "Prevents adding extra information to error messages.",
    "purpose": "Makes error messages clearer and easier to understand for developers."
  },
  "FFlagAXMigrateItemDetailsPeekViewToAutoFocus": {
    "mechanism": "Changes how item details are displayed to automatically focus on the most relevant information.",
    "purpose": "Improves the user experience by making it easier to view important item details quickly."
  },
  "FFlagAXPeekViewContentShouldNotBeSelectable_Staged": {
    "mechanism": "Disables text selection in certain preview views.",
    "purpose": "Enhances usability by preventing accidental text selection, allowing for a smoother browsing experience."
  },
  "FFlagEnableMultipartForMeshImage": {
    "mechanism": "Allows images to be split into multiple parts for better performance.",
    "purpose": "Improves loading times and visual quality of images in games."
  },
  "DFIntClientScriptTimeoutValueMsec_Staged": {
    "mechanism": "Sets a limit on how long client scripts can run before timing out.",
    "purpose": "Prevents scripts from running indefinitely, ensuring smoother gameplay and better performance."
  },
  "FFlagEnableBacktraceMetricKitReporter3_Staged": {
    "mechanism": "Enables a reporting tool to track errors and performance issues in the game.",
    "purpose": "Helps developers identify and fix problems faster, leading to a smoother gameplay experience."
  },
  "FFlagInExperienceContainerScreenSizeReducer": {
    "mechanism": "Adjusts the size of the game container based on the player's screen size.",
    "purpose": "Improves the visual layout and usability for players on different devices."
  },
  "DFIntPhoto2AvatarErrorEventsThrottleHundredthsPercent_Staged": {
    "mechanism": "Limits the frequency of error reports related to avatar photo uploads.",
    "purpose": "Reduces spam in error reporting, allowing for more focused troubleshooting of avatar issues."
  },
  "FFlagPropertiesMixStylingAndPackageDefaultsCorrectly": {
    "mechanism": "Ensures that custom styles and default settings for packages are applied correctly.",
    "purpose": "Enhances the appearance and functionality of player avatars and items."
  },
  "FFlagAvatarGenerationFailedEvents": {
    "mechanism": "Tracks and reports when avatar generation fails.",
    "purpose": "Informs developers about issues with avatar creation, improving reliability for players."
  },
  "FFlagCheckPillSelectedPressedState": {
    "mechanism": "Checks the state of selected UI elements when interacted with.",
    "purpose": "Improves user interface responsiveness for better player experience."
  },
  "FFlagGetGameIconsFromThumbnailsDeliveryApiIxp_Staged": {
    "mechanism": "Fetches game icons using a new delivery API.",
    "purpose": "Enhances the speed and quality of game icon loading for players."
  },
  "DFFlagCLI172177_Staged": {
    "mechanism": "Introduces changes to the command line interface for developers.",
    "purpose": "Provides developers with improved tools for game creation, indirectly benefiting players with better games."
  },
  "FFlagLuaAppHandleMouseCursor2": {
    "mechanism": "Improves how the Lua application manages mouse cursor interactions.",
    "purpose": "Offers smoother cursor control for players during gameplay."
  },
  "FFlagStatusFileMutex_Staged": {
    "mechanism": "Implements a locking mechanism for status files to prevent conflicts.",
    "purpose": "Ensures more reliable game status updates, leading to a more stable gaming experience."
  },
  "FFlagHelpPageIXPExposure": {
    "mechanism": "Enables a new help page feature for users.",
    "purpose": "Provides players with better access to support and guidance."
  },
  "FFlagAEGetEditableOutfitsType": {
    "mechanism": "Allows users to retrieve and edit their outfit types more easily.",
    "purpose": "Gives players more control over customizing their avatars."
  },
  "FFlagRenderParticlesSimulateNonVisible6": {
    "mechanism": "Improves how particle effects are rendered, even when objects are not visible.",
    "purpose": "Enhances visual effects in games, making them look better during gameplay."
  },
  "FFlagLuauAutocompleteAttributes_Staged": {
    "mechanism": "Introduces autocomplete suggestions for attributes in the Luau scripting language.",
    "purpose": "Makes it easier for developers to write scripts by suggesting code automatically."
  },
  "FFlagAvatarGenBodyColorFix_Staged": {
    "mechanism": "Fixes issues with body color generation for avatars.",
    "purpose": "Ensures that players' avatars display the correct colors as intended."
  },
  "FFlagFixCdsduiRFYGridItemsPerRowLogic_Staged": {
    "mechanism": "Adjusts the logic for displaying grid items based on rows.",
    "purpose": "Improves the layout of items in the user interface for better visibility."
  },
  "FFlagCASButtonsOnWindowsTouch_Staged": {
    "mechanism": "Enables touch-friendly buttons on Windows devices.",
    "purpose": "Enhances user experience for players using touch screens on Windows."
  },
  "FFlagVoiceForceRunOnLeave": {
    "mechanism": "Forces voice chat to continue running even when a player leaves a game.",
    "purpose": "Allows players to stay connected and communicate even after leaving a game."
  },
  "DFFlagEnableContentTypeInRegister": {
    "mechanism": "Adds content type information during user registration.",
    "purpose": "Helps in better categorizing and managing user-generated content."
  },
  "FFlagVideoHandleEarlyServiceShutdown_Staged": {
    "mechanism": "Implements a system to manage video playback during unexpected service shutdowns.",
    "purpose": "Ensures a smoother video experience for players, reducing interruptions."
  },
  "FFlagAXPrefetchMarketplaceIXP2": {
    "mechanism": "Preloads marketplace data to improve loading times.",
    "purpose": "Players experience faster access to marketplace items."
  },
  "FFlagTopBarSignalizeMenuOpen_IXP": {
    "mechanism": "Adds visual indicators when the top menu is opened.",
    "purpose": "Players can easily see when the menu is active."
  },
  "FFlagEnableBackgroundSignatureVerification": {
    "mechanism": "Checks the authenticity of data in the background.",
    "purpose": "Players benefit from enhanced security and trust in transactions."
  },
  "FFlagLuauIndividualRecursionLimits": {
    "mechanism": "Sets specific limits on how deep functions can call themselves.",
    "purpose": "Players experience fewer game crashes due to excessive function calls."
  },
  "DFFlagSplineClampForNaNInput": {
    "mechanism": "Prevents invalid input values from affecting spline calculations.",
    "purpose": "Players enjoy smoother and more reliable animations in games."
  },
  "FFlagComponentManagerAddSupportStopSubtree2": {
    "mechanism": "Enhances the component manager to better handle stopping a subtree of components.",
    "purpose": "Improves performance and stability when managing complex UI components."
  },
  "FFlagBootcampCLI167628": {
    "mechanism": "Updates the command line interface for the Bootcamp feature.",
    "purpose": "Provides a smoother and more efficient experience for new developers learning Roblox."
  },
  "DFIntBacktraceMetricKitUploadHundrethsPercent": {
    "mechanism": "Adjusts the frequency of backtrace metrics uploads to a finer granularity.",
    "purpose": "Helps developers diagnose issues more accurately by providing detailed performance data."
  },
  "DFLogBootcampCLI167628Log": {
    "mechanism": "Enables logging for the Bootcamp command line interface.",
    "purpose": "Allows tracking of actions and errors, aiding in better support and troubleshooting."
  },
  "FFlagAXEnableInitialTopLevelPageCounter_Staged": {
    "mechanism": "Introduces a counter for the initial top-level page loads.",
    "purpose": "Helps measure and improve the loading performance of the Roblox platform."
  },
  "FFlagAXAddInventoryItemsListProps_IXP": {
    "mechanism": "Adds new properties to the inventory items list for better data handling.",
    "purpose": "Improves the way players view and manage their inventory items."
  },
  "DFFlagVoiceChatSendHttpErrorsTelemetry2": {
    "mechanism": "Tracks and sends data about voice chat errors to improve system reliability.",
    "purpose": "Enhances the voice chat experience by identifying and fixing issues faster."
  },
  "FFlagLuauIndividualRecursionLimits_Staged": {
    "mechanism": "Implements specific limits on how deep functions can call themselves in scripts.",
    "purpose": "Prevents script errors and crashes, making gameplay smoother for players."
  },
  "FFlagExpChatUseUpdatedMessageRendered": {
    "mechanism": "Switches to a new method for displaying chat messages in the game.",
    "purpose": "Provides a more modern and efficient chat experience for players."
  },
  "DFIntJoinLimitWin32x64": {
    "mechanism": "Sets a limit on the number of players that can join a game on 64-bit Windows systems.",
    "purpose": "Ensures better performance and stability during gameplay for players on these systems."
  },
  "FFlagCapturesCloseGalleryTooltipWhenCarouselOpen_Staged": {
    "mechanism": "Enables a tooltip to be displayed when the gallery is open and the close button is clicked.",
    "purpose": "Helps players understand what happens when they close the gallery, improving user experience."
  },
  "FFlagAXGeneralizeInventoryItemsList_IXP": {
    "mechanism": "Modifies the inventory system to handle various item types more uniformly.",
    "purpose": "Makes it easier for players to manage and view different types of items in their inventory."
  },
  "DFFlagCLI171730AddSizeCheck_Staged": {
    "mechanism": "Implements a size check for certain commands in the command line interface.",
    "purpose": "Prevents errors by ensuring commands are within acceptable size limits, leading to smoother gameplay."
  },
  "DFFlagReportInstanceMemoryToES_Staged": {
    "mechanism": "Sends memory usage data of game instances to the analytics system.",
    "purpose": "Helps developers optimize games by providing insights into memory usage, improving performance for players."
  },
  "FFlagTexturePackGeneratorFix": {
    "mechanism": "Fixes issues in the texture pack generation process.",
    "purpose": "Ensures that texture packs are created correctly, enhancing the visual quality of games for players."
  },
  "FFlagPropertiesMixStylingAndPackageDefaultsCorrectly_Staged": {
    "mechanism": "Adjusts how styles and default settings are combined in packages.",
    "purpose": "Ensures that players see consistent and visually appealing styles in games."
  },
  "FFlagCustomizedLandingLaunchGame_Staged": {
    "mechanism": "Allows developers to set a custom game that players see when launching Roblox.",
    "purpose": "Provides a personalized experience for players by directing them to specific games."
  },
  "FFlagFixMediaKeysMapping_Staged": {
    "mechanism": "Corrects the mapping of media keys for better functionality.",
    "purpose": "Enhances player experience by ensuring media controls work properly while playing."
  },
  "FFlagAXRootSlotBasedEditorFlag5_IXP": {
    "mechanism": "Implements a new slot-based system in the editor for better organization.",
    "purpose": "Improves the editing experience for developers, making it easier to manage game elements."
  },
  "DFFlagDCDReadLegacyWithDecoder": {
    "mechanism": "Enables reading of older data formats using a decoder.",
    "purpose": "Ensures compatibility with older games, allowing players to access and enjoy them."
  },
  "FFlagEnableNapIxpLayerExposure_IXP": {
    "mechanism": "Enables a new layer for exposure settings in the IXP system.",
    "purpose": "Improves the way players experience lighting and visual effects in games."
  },
  "DFFlagSplineClampForNaNInput_Staged": {
    "mechanism": "Prevents errors by clamping spline calculations when inputs are not numbers.",
    "purpose": "Ensures smoother gameplay by avoiding crashes or glitches caused by invalid inputs."
  },
  "FFlagDynamicTranslationAlwaysRetranslate_Staged": {
    "mechanism": "Forces dynamic translations to update continuously.",
    "purpose": "Enhances the responsiveness of in-game text and UI elements for players."
  },
  "DFFlagProcessStatisticsMemoryFix": {
    "mechanism": "Fixes memory usage issues in the statistics processing system.",
    "purpose": "Reduces lag and improves performance during gameplay by optimizing memory management."
  },
  "FFlagIASFixDirection3DHandedness_Staged": {
    "mechanism": "Corrects the handedness of 3D direction calculations in the input system.",
    "purpose": "Provides a more intuitive control experience for players, especially in 3D environments."
  },
  "FFlagAXGeneralizeInventoryItemsList_Staged": {
    "mechanism": "Standardizes how inventory items are listed across different platforms.",
    "purpose": "Provides a consistent and improved experience for players when viewing their inventory."
  },
  "FFlagLuaAppLayoutParamsInContext_Staged": {
    "mechanism": "Allows layout parameters to be set within the context of the app.",
    "purpose": "Enhances the flexibility and responsiveness of app layouts for better usability."
  },
  "FFlagWebBrowserWinExecuteJavaScriptNullGuard_Staged": {
    "mechanism": "Implements a safeguard when executing JavaScript in web browser windows.",
    "purpose": "Increases security and stability when using web features in Roblox."
  },
  "DFFlagFixPrimitiveShapeInertiaMigration_Staged": {
    "mechanism": "Corrects the behavior of primitive shapes during physics interactions.",
    "purpose": "Improves the realism and predictability of object movements in games."
  },
  "FFlagPluginGuiPointerEvents_Staged": {
    "mechanism": "Enables pointer events for GUI elements in plugins.",
    "purpose": "Allows for more interactive and responsive user interfaces in plugin tools."
  },
  "FFlagAXEnablePrefetchMarketplaceFailsafe_Staged": {
    "mechanism": "Enables a backup system to load marketplace items faster if the main system fails.",
    "purpose": "Helps players access and purchase items more reliably, reducing wait times."
  },
  "FFlagMakeupUVBoundsStretchAfterCrop_Staged": {
    "mechanism": "Adjusts how makeup textures are displayed after being resized.",
    "purpose": "Ensures that makeup looks good on characters even after changes, enhancing customization."
  },
  "FFlagIASFixStudioKeyCodeDisplay": {
    "mechanism": "Fixes the display of key codes in the development studio.",
    "purpose": "Makes it easier for developers to see and use the correct key codes, improving game creation."
  },
  "FFlagCASButtonsOnWindowsTouch": {
    "mechanism": "Enables touch-friendly buttons for character customization on Windows devices.",
    "purpose": "Allows players using touch screens to easily customize their characters."
  },
  "FFlagCheckPillSelectedPressedState_Staged": {
    "mechanism": "Implements a check to see if a selection button is pressed or selected.",
    "purpose": "Improves user interface feedback, making it clearer when options are selected in games."
  },
  "DFStringFlagRepoGitHashDynamicString": {
    "mechanism": "Stores dynamic string values from a Git repository.",
    "purpose": "Allows for easier updates and management of string data in games."
  },
  "FFlagWebBrowserWinExecuteJavaScriptNullGuard": {
    "mechanism": "Prevents errors when executing JavaScript in web browsers on Windows.",
    "purpose": "Improves stability and user experience when using web features in games."
  },
  "FFlagAXFixFlashingNoItemsFound": {
    "mechanism": "Fixes a bug that causes flashing when no items are found in a list.",
    "purpose": "Enhances visual clarity and reduces distractions for players when searching for items."
  },
  "FFlagVideoHandleEarlyServiceShutdown": {
    "mechanism": "Manages video playback when a service unexpectedly shuts down.",
    "purpose": "Ensures smoother video experiences and reduces interruptions for players."
  },
  "DFFlagClientScriptTimeout_Staged": {
    "mechanism": "Implements a timeout for client scripts to prevent them from running indefinitely.",
    "purpose": "Improves game performance and responsiveness by stopping stuck scripts."
  },
  "FFlagPlayerFeedbackPromptEnabled": {
    "mechanism": "Enables a prompt for players to provide feedback after gameplay.",
    "purpose": "Encourages players to share their thoughts, helping improve the game experience."
  },
  "FFlagToolboxWebViewTutorial4_Staged": {
    "mechanism": "Introduces a new tutorial in the Toolbox that uses a web view.",
    "purpose": "Guides users more effectively on how to use the Toolbox features."
  },
  "FFlagUsernameValidatorSelectorPaddingFix_Staged": {
    "mechanism": "Fixes the padding in the username validation selector interface.",
    "purpose": "Improves the visual layout, making it easier for players to enter usernames."
  },
  "FFlagCarouselUseNewUserTileWithPresenceIcon_IXP": {
    "mechanism": "Updates the user tile in the carousel to show presence icons for new users.",
    "purpose": "Helps players see which friends are online, enhancing social interaction."
  },
  "DFFlagSimGeometryDeterministicSampling_Staged": {
    "mechanism": "Implements a consistent method for sampling geometry in simulations.",
    "purpose": "Ensures more reliable and predictable results in game simulations."
  },
  "FFlagAXFixOrganicTTILogging": {
    "mechanism": "Fixes logging issues in the organic TTI (Time to Interactive) metrics.",
    "purpose": "Improves the accuracy of performance data, helping developers optimize game loading times."
  },
  "FFlagToolboxRetryReloadFailures3_Staged": {
    "mechanism": "Allows the toolbox to retry loading assets if the initial attempt fails.",
    "purpose": "Enhances the reliability of asset loading, ensuring players have access to necessary tools without interruptions."
  },
  "DFIntPerfDataGlobalThrottleHundredthsPercent_Staged": {
    "mechanism": "Adjusts the performance data throttling settings to optimize data collection.",
    "purpose": "Improves the overall performance of games by fine-tuning how performance data is gathered."
  },
  "FFlagEnableBacktraceMetricKitReporter3": {
    "mechanism": "Enables a new reporting tool for tracking backtrace metrics.",
    "purpose": "Helps developers identify and fix errors more efficiently, leading to a smoother gameplay experience."
  },
  "FFlagSquadStartedCardBgFixEnabled": {
    "mechanism": "Fixes background issues on the squad started cards in the UI.",
    "purpose": "Enhances the visual presentation of squad cards, making it easier for players to navigate and interact with their teams."
  },
  "FFlagRbxStorageSkipPermOrphanedFiles": {
    "mechanism": "Bypassing permission checks for unused files in storage.",
    "purpose": "Improves loading times by skipping unnecessary checks for orphaned files."
  },
  "FFlagToolboxWebViewTutorial4": {
    "mechanism": "Enabling a new tutorial interface in the toolbox using web technologies.",
    "purpose": "Helps users learn how to use the toolbox more effectively with an updated guide."
  },
  "FFlagAXFixReactPerfExperimentCounter": {
    "mechanism": "Adjusting performance counters in a React-based system.",
    "purpose": "Enhances the performance of applications, leading to smoother gameplay experiences."
  },
  "FFlagAXMigrateTryOnItemScreenToAutofocus": {
    "mechanism": "Automatically focusing on the item screen when trying on items.",
    "purpose": "Makes it easier for players to try on items without extra clicks."
  },
  "FFlagEnableTelemetryIntegrationCheck_Staged": {
    "mechanism": "Integrating telemetry checks into the system for monitoring.",
    "purpose": "Improves system reliability and performance by tracking usage data."
  },
  "DFFlagEnableLuaApiToRegisterEncryptedAssets_PlaceFilter": {
    "mechanism": "Allows scripts to register encrypted assets with a specific filter for places.",
    "purpose": "Enhances security by ensuring only authorized assets can be used in games."
  },
  "FFlagAddFriendsFixText_Staged": {
    "mechanism": "Fixes the text display for adding friends in the user interface.",
    "purpose": "Improves clarity and usability when players try to add friends."
  },
  "FFlagCachelessPluginLoading3_Staged": {
    "mechanism": "Loads plugins without relying on cached data, ensuring fresh content each time.",
    "purpose": "Provides players with the latest updates and features from plugins immediately."
  },
  "FStringFlagRepoGitHashFastString": {
    "mechanism": "Utilizes a fast string representation of the repository's Git hash.",
    "purpose": "Improves performance by quickly identifying the version of the game assets."
  },
  "DFFlagUseModelInsteadOfItsParent_Staged": {
    "mechanism": "Changes the way models are referenced, using the model directly instead of its parent object.",
    "purpose": "Simplifies asset management and improves performance in games."
  },
  "FFlagLuaAppUpdateCollectionHeader2": {
    "mechanism": "Updates the header design in the collection section of the Lua app.",
    "purpose": "Enhances the visual appeal and usability of the collection interface for players."
  },
  "FFlagRemoveMeInParent2_Staged": {
    "mechanism": "Removes the 'Me' section from the parent view in the user interface.",
    "purpose": "Simplifies the navigation for players by decluttering the interface."
  },
  "FFlagAXFixFlashingNoItemsFound_Staged": {
    "mechanism": "Fixes a bug that caused flashing when no items were found in certain sections.",
    "purpose": "Provides a smoother experience by eliminating distracting visual glitches."
  },
  "FFlagLuaAppUpdateCollectionHeader2_Staged": {
    "mechanism": "Implements an updated header for the collection section in the Lua app.",
    "purpose": "Improves the organization and aesthetics of the collection area for users."
  },
  "FFlagWindowsInstallerPostWebLaunch": {
    "mechanism": "Modifies the installation process for Windows users after launching from the web.",
    "purpose": "Streamlines the installation experience for players using Windows."
  },
  "FFlagLuauAutocompleteAttributes": {
    "mechanism": "Enhances the code editor to suggest attributes while coding in Luau.",
    "purpose": "Makes coding easier and faster by providing helpful suggestions."
  },
  "FFlagUseGeneralizedFileCulling": {
    "mechanism": "Improves how files are managed and loaded in the game engine.",
    "purpose": "Reduces loading times and improves game performance for players."
  },
  "FFlagUseNewHapticServiceInUA3_Staged": {
    "mechanism": "Introduces a new system for providing tactile feedback through controllers.",
    "purpose": "Enhances gameplay experience by making actions feel more immersive."
  },
  "FFlagDifferentiateSharingBaseOnPlatform": {
    "mechanism": "Changes how sharing features work based on the player's device.",
    "purpose": "Improves user experience by tailoring sharing options to specific platforms."
  },
  "FFlagVideoPlaybackManager2": {
    "mechanism": "Updates the system that handles video playback in games.",
    "purpose": "Provides smoother and more reliable video playback for players."
  },
  "FFlagWindowsInstallerPostWebLaunch_Staged": {
    "mechanism": "Enables a new installer for Windows that runs after the web launch.",
    "purpose": "Improves the installation experience for players on Windows."
  },
  "FFlagDynamicTranslationAlwaysRetranslate": {
    "mechanism": "Forces the game to retranslate text dynamically every time it loads.",
    "purpose": "Ensures players see the most accurate translations in their preferred language."
  },
  "FStringIxpNewLayersForRegistration_Staged": {
    "mechanism": "Introduces new layers in the registration process for better organization.",
    "purpose": "Streamlines the registration experience for new players."
  },
  "FFlagUsernameValidatorSelectorPaddingFix": {
    "mechanism": "Fixes padding issues in the username validation interface.",
    "purpose": "Enhances the visual layout, making it easier for players to enter their usernames."
  },
  "DFIntReverbCameraPushForwardStudsHundredths_Staged": {
    "mechanism": "Adjusts the camera's position in relation to sound reverb effects.",
    "purpose": "Improves audio experience by making sounds feel more immersive and realistic."
  },
  "FFlagNativePurchaseRobuxPageWrapperEnableTelemetry_Staged": {
    "mechanism": "Enables tracking of user interactions on the Robux purchase page.",
    "purpose": "Improves the purchase experience by understanding user behavior."
  },
  "FFlagLuaAppScrollableDesktopCarousels2": {
    "mechanism": "Introduces a new scrolling feature for carousels in the Lua app on desktop.",
    "purpose": "Enhances navigation and browsing of content for players."
  },
  "FFlagStreamJobRefactorSetCollection_Staged": {
    "mechanism": "Refactors how collections of jobs are managed in streaming.",
    "purpose": "Optimizes performance and reliability of job streaming for smoother gameplay."
  },
  "FFlagAXPeekViewContentShouldNotBeSelectable": {
    "mechanism": "Prevents content in peek views from being selected or interacted with.",
    "purpose": "Improves user experience by reducing accidental selections."
  },
  "DFFlagPMDHeaderGeomTypeReading_Staged": {
    "mechanism": "Changes how header geometry types are read in the platform.",
    "purpose": "Ensures better rendering and layout of headers for a more polished look."
  },
  "FFlagAXRootSlotBasedEditorFlag5_Staged": {
    "mechanism": "Enables a new editor layout that organizes tools in slots.",
    "purpose": "Improves user experience by making it easier to find and use editing tools."
  },
  "FFlagUseNewHapticServiceInUA3": {
    "mechanism": "Integrates a new system for providing tactile feedback through controllers.",
    "purpose": "Enhances gameplay by allowing players to feel vibrations and sensations during interactions."
  },
  "FFlagToolboxRetryReloadFailures3": {
    "mechanism": "Allows the toolbox to automatically retry loading items if it fails initially.",
    "purpose": "Ensures players can access their tools and assets more reliably without manual refresh."
  },
  "DFFlagEarlyReturnScrollingDisabled2": {
    "mechanism": "Disables an early return feature in scrolling functions.",
    "purpose": "Improves scrolling performance and responsiveness in user interfaces."
  },
  "FFlagAddFriendsUserTileRefactor_Staged": {
    "mechanism": "Updates the layout and functionality of user tiles for adding friends.",
    "purpose": "Makes it easier and more intuitive for players to add friends on the platform."
  },
  "DFFlagDCDReadLegacyWithDecoder_Staged": {
    "mechanism": "Allows the system to read older data formats using a specific decoder.",
    "purpose": "Ensures compatibility with older game data, making it easier for developers to access and use legacy content."
  },
  "FFlagLuauResumeFix_PlaceFilter": {
    "mechanism": "Fixes issues in the Luau scripting language related to filtering places.",
    "purpose": "Improves the reliability of place filtering, enhancing the experience for players searching for games."
  },
  "FFlagPluginGuiPointerEvents": {
    "mechanism": "Enables GUI elements in plugins to respond to mouse and touch events.",
    "purpose": "Allows developers to create more interactive and responsive user interfaces in their plugins."
  },
  "FFlagMakeupUVBoundsStretchAfterCrop": {
    "mechanism": "Adjusts the UV mapping of makeup textures after they are cropped.",
    "purpose": "Ensures that makeup looks correct on avatars, improving the visual quality of character customization."
  },
  "FFlagEnableMultipartForMeshImage_Staged": {
    "mechanism": "Activates support for multipart images on mesh objects.",
    "purpose": "Enhances the visual detail of mesh objects by allowing the use of multiple images, improving overall aesthetics."
  },
  "FFlagAvatarGenBodyColorFix": {
    "mechanism": "Corrects the body color generation for avatars.",
    "purpose": "Ensures that avatars display their intended body colors accurately."
  },
  "DFFlagWriteFlagCacheAfterFlagFetch_Staged": {
    "mechanism": "Updates the flag cache after fetching new flag values.",
    "purpose": "Improves the efficiency of flag management, leading to smoother gameplay."
  },
  "DFFlagSupportNetworkValueFormatRandom2": {
    "mechanism": "Enhances the way network values are formatted for randomization.",
    "purpose": "Allows for more varied and dynamic game experiences through better random value handling."
  },
  "FFlagIASFixDirection3DHandedness": {
    "mechanism": "Fixes issues with 3D directional input based on handedness.",
    "purpose": "Improves control responsiveness for players using different hand orientations."
  },
  "FFlagFoundationDialogActionsUpdate": {
    "mechanism": "Updates the dialog action system for better interaction.",
    "purpose": "Provides players with a more intuitive and streamlined way to interact with game dialogs."
  },
  "FFlagFixCdsduiRFYGridItemsPerRowLogic": {
    "mechanism": "Adjusts the calculation for how many items fit in a grid layout.",
    "purpose": "Ensures items are displayed correctly in rows, improving visual organization."
  },
  "FFlagFoundationPopoverContentToggleOnAnchorClick": {
    "mechanism": "Enables popover content to show or hide when the associated anchor is clicked.",
    "purpose": "Makes it easier for players to access additional information without cluttering the screen."
  },
  "FFlagRemoveMeInParent2": {
    "mechanism": "Removes a specific outdated feature from the parent object structure.",
    "purpose": "Streamlines the game development process, reducing confusion for developers."
  },
  "FFlagLuaAppLayoutParamsInContext": {
    "mechanism": "Allows layout parameters to be set within the context of Lua applications.",
    "purpose": "Improves flexibility for developers in designing user interfaces in games."
  },
  "FFlagCeaseUAPresenceRealtimeNotificationUpdatesInGameV2_IXP": {
    "mechanism": "Stops real-time notifications related to user presence from being sent during gameplay.",
    "purpose": "Reduces distractions for players, allowing for a smoother gaming experience."
  },
  "FFlagAddFriendsFixText": {
    "mechanism": "Updates the text displayed when adding friends to ensure clarity.",
    "purpose": "Makes it easier for players to understand the friend request process."
  },
  "DFIntBacktraceMetricKitUploadHundrethsPercent_Staged": {
    "mechanism": "Improves the data upload process for tracking performance metrics.",
    "purpose": "Helps developers identify and fix issues faster, leading to a smoother gaming experience."
  },
  "DFFlagReportInstanceMemoryToES": {
    "mechanism": "Collects memory usage data from game instances for analysis.",
    "purpose": "Allows developers to optimize games, reducing lag and improving performance for players."
  },
  "DFFlagWriteFlagCacheAfterFlagFetch": {
    "mechanism": "Stores flag data after retrieving it to speed up future access.",
    "purpose": "Enhances game performance by reducing load times for players."
  },
  "FFlagEnableUISoundAndHaptics10": {
    "mechanism": "Activates sound effects and haptic feedback in the user interface.",
    "purpose": "Provides a more immersive and engaging experience for players through audio and tactile feedback."
  },
  "FFlagDisableImageHash": {
    "mechanism": "Disables the use of hashed values for image URLs.",
    "purpose": "Improves image loading speed and reliability for players."
  },
  "FFlagDeprecateExperienceInterventionNamespace": {
    "mechanism": "Removes an old system for managing game interventions.",
    "purpose": "Streamlines game management, leading to a smoother player experience."
  },
  "FFlagAddAccountLinkingAlertAnalytics": {
    "mechanism": "Tracks alerts related to linking accounts for analytics.",
    "purpose": "Helps improve the account linking process for players by understanding usage patterns."
  },
  "FFlagEnableBackgroundSignatureVerification_Staged": {
    "mechanism": "Implements a system to verify signatures in the background.",
    "purpose": "Enhances security for players by ensuring safer transactions and interactions."
  },
  "FIntHelpPageThrottleHundredthsPercent_IXP": {
    "mechanism": "Limits the frequency of help page requests to reduce server load.",
    "purpose": "Ensures players can access help resources without overwhelming the system."
  },
  "FFlagSwapAppGameTileAndSduiGameTileInRFY": {
    "mechanism": "Replaces the layout of game tiles in the app with a new design.",
    "purpose": "Improves the visual presentation of games, making it easier for players to find and select games."
  },
  "DFFlagFixPrimitiveShapeInertiaMigration": {
    "mechanism": "Addresses issues with how basic shapes behave when moved or interacted with.",
    "purpose": "Enhances the stability and realism of shape movements in games, leading to a smoother gameplay experience."
  },
  "FFlagPropertyDescriptorsToArray3": {
    "mechanism": "Changes how properties of game objects are organized into arrays for better access.",
    "purpose": "Streamlines the way developers manage game object properties, potentially leading to better game performance and features."
  },
  "FFlagCapturesCloseGalleryTooltipWhenCarouselOpen": {
    "mechanism": "Ensures that tooltips remain visible when a gallery is open and being navigated.",
    "purpose": "Provides players with consistent information about items while browsing, enhancing usability."
  },
  "FFlagAXAddInventoryItemsListProps": {
    "mechanism": "Introduces new properties for managing inventory items in the game.",
    "purpose": "Gives players more control and customization options for their inventory, improving the overall user experience."
  },
  "FFlagTopBarSignalizeHealthBar3_IXP": {
    "mechanism": "Updates the top bar to visually indicate health changes.",
    "purpose": "Helps players quickly see their health status during gameplay."
  },
  "FFlagTopBarSignalizeScreenSize2_IXP": {
    "mechanism": "Modifies the top bar to reflect changes in screen size.",
    "purpose": "Improves user experience by ensuring the interface adapts to different screen sizes."
  },
  "FFlagAddNewPlayerListFocusNav": {
    "mechanism": "Introduces a new navigation feature for the player list.",
    "purpose": "Makes it easier for players to find and interact with others in the game."
  },
  "FFlagAXFixOrganicTTILogging_Staged": {
    "mechanism": "Fixes issues with logging for certain analytics.",
    "purpose": "Enhances the accuracy of data tracking, improving game performance and player experience."
  },
  "FFlagCachelessPluginLoading3": {
    "mechanism": "Allows plugins to load without relying on cached data.",
    "purpose": "Ensures that players always have the latest version of plugins, reducing errors and improving gameplay."
  },
  "DFIntPhoto2AvatarErrorEventsThrottleHundredthsPercent": {
    "mechanism": "Limits the frequency of avatar photo error events to reduce server load.",
    "purpose": "Improves game performance by preventing too many error messages at once."
  },
  "DFIntExpChatMessageClientRenderedThrottlePermyriad": {
    "mechanism": "Controls how often chat messages are rendered on the client side.",
    "purpose": "Enhances chat performance by reducing lag when many messages are sent."
  },
  "FFlagDeprecateExperienceInterventionNamespace_Staged": {
    "mechanism": "Phases out an old system for handling experience interventions.",
    "purpose": "Streamlines game experiences by removing outdated features."
  },
  "FFlagMoveNewPlayerListDividers_Staged": {
    "mechanism": "Changes the layout of player list dividers in the user interface.",
    "purpose": "Makes it easier for players to see and manage their friends and other players."
  },
  "FStringFlipTimeStampFastString": {
    "mechanism": "Optimizes how timestamps are formatted as strings.",
    "purpose": "Improves the speed of displaying time-related information in games."
  },
  "DFIntClientScriptTimeoutValueMsec": {
    "mechanism": "Sets the maximum time a client script can run before it is stopped.",
    "purpose": "Prevents scripts from running too long, improving game performance and responsiveness."
  },
  "FFlagAvatarGenerationFailedEvents_Staged": {
    "mechanism": "Enables events to trigger when avatar generation fails.",
    "purpose": "Allows developers to handle errors better, ensuring players receive feedback if their avatar can't be created."
  },
  "EnableExitImmediatelyOnBackgroundingOnQuest": {
    "mechanism": "N/A (invalid)",
    "purpose": "N/A (invalid)"
  },
  "DFIntConvexDecompCompressionSelector_Staged": {
    "mechanism": "Selects a method for compressing complex shapes in the game.",
    "purpose": "Optimizes game performance by reducing the size of shape data, leading to smoother gameplay."
  },
  "FFlagAXAddInventoryItemsListProps_Staged": {
    "mechanism": "Adds additional properties to the inventory items list for better management.",
    "purpose": "Enhances the inventory system, making it easier for players to organize and access their items."
  },
  "FFlagLuauResumeFix_Staged": {
    "mechanism": "Fixes issues in the Luau scripting engine related to resuming functions.",
    "purpose": "Improves the reliability of scripts, making games run smoother."
  },
  "DFFlagParseDepartureIntentAsEnum_Staged": {
    "mechanism": "Changes how player departure intents are processed by using an enumeration.",
    "purpose": "Enhances the accuracy of player status updates, leading to better game experiences."
  },
  "FFlagFixSliceCenterWarningOnNegativeSize": {
    "mechanism": "Addresses warnings related to negative sizes in UI elements.",
    "purpose": "Reduces confusion for developers, ensuring UI elements display correctly."
  },
  "DFIntConvexDecompCompressionSelector": {
    "mechanism": "Implements a selector for different compression methods in convex decomposition.",
    "purpose": "Optimizes performance for complex shapes in games, improving gameplay fluidity."
  },
  "FFlagUseNewCorrelateProfilerDataFunction": {
    "mechanism": "Utilizes a new function for correlating profiling data for performance analysis.",
    "purpose": "Helps developers identify and fix performance issues more effectively."
  },
  "FStringIxpNewLayersForRegistration": {
    "mechanism": "Introduces new layers in the registration process to enhance data handling.",
    "purpose": "Improves user registration experience by making it smoother and more efficient."
  },
  "FFlagAXMigrateAXFocusBehaviorRoot_Staged": {
    "mechanism": "Changes how focus behavior is managed in the user interface for better accessibility.",
    "purpose": "Enhances navigation for players, making it easier to interact with the game."
  },
  "DFFlagVoiceChatSendHttpErrorsTelemetry2_Staged": {
    "mechanism": "Collects data on HTTP errors related to voice chat for better troubleshooting.",
    "purpose": "Helps improve voice chat reliability, ensuring clearer communication between players."
  },
  "FFlagDifferentiateSharingBaseOnPlatform_Staged": {
    "mechanism": "Modifies sharing features to vary based on the platform being used.",
    "purpose": "Provides a tailored sharing experience for players depending on their device."
  },
  "FFlagTexturePackGeneratorFix_Staged": {
    "mechanism": "Fixes issues in the texture pack generation process for better performance.",
    "purpose": "Ensures players have access to high-quality textures, enhancing visual experience."
  },
  "FFlagAXIncreaseDefaultPeekViewHeight_IXP": {
    "mechanism": "Increases the default height of the camera view when peeking in games.",
    "purpose": "Allows players to see more of their surroundings while peeking, enhancing gameplay."
  },
  "FFlagCustomizedLandingLaunchGame": {
    "mechanism": "Enables personalized landing pages for games when launched.",
    "purpose": "Improves the first impression for players by showcasing unique game features."
  },
  "FFlagAXEnablePrefetchMarketplaceFailsafe": {
    "mechanism": "Implements a backup system to pre-load marketplace data.",
    "purpose": "Ensures players can access marketplace items more reliably, reducing loading issues."
  },
  "FStringHelpPageIxpLayer_Staged": {
    "mechanism": "Updates the help page with new information layers.",
    "purpose": "Provides players with better guidance and support within the game."
  },
  "DFFlagUseModelInsteadOfItsParent": {
    "mechanism": "Switches the rendering from a parent object to its child model.",
    "purpose": "Improves visual fidelity and performance by focusing on the specific model."
  },
  "FFlagAXItemDetailsShouldNotHaveQuickMenuButton": {
    "mechanism": "Removes the quick menu button from item details in the UI.",
    "purpose": "Simplifies the item details view for players, making it easier to focus on the item itself."
  },
  "FFlagLuauResumeFix": {
    "mechanism": "Fixes an issue with the Luau scripting language that caused problems when resuming scripts.",
    "purpose": "Improves script reliability, allowing developers to create smoother gameplay experiences."
  },
  "DFFlagNoCallstackAppendTarget": {
    "mechanism": "Disables appending a target to call stacks in error messages.",
    "purpose": "Makes error messages cleaner for developers, helping them to debug more effectively."
  },
  "FFlagPlayerFeedbackPromptEnabled_Staged": {
    "mechanism": "Enables a prompt for players to give feedback during gameplay.",
    "purpose": "Encourages players to share their thoughts, helping developers improve the game based on player input."
  },
  "DFFlagPMDHeaderGeomTypeReading": {
    "mechanism": "Allows reading of geometric types in the PMD (Player Model Data) header.",
    "purpose": "Enhances the way player models are processed, leading to better character customization options."
  },
  "FStringHelpPageIxpLayer": {
    "mechanism": "Updates the help page to use a new layout system.",
    "purpose": "Makes it easier for players to find information and get help."
  },
  "FFlagRenderParticlesSimulateNonVisible6_Staged": {
    "mechanism": "Improves how particles are rendered even when they are not visible.",
    "purpose": "Enhances visual effects in games, making them look better and more realistic."
  },
  "DFIntReverbCameraPushForwardStudsHundredths": {
    "mechanism": "Adjusts the camera's position based on sound reverb effects.",
    "purpose": "Creates a more immersive audio experience by changing how players perceive sound in relation to their surroundings."
  },
  "FFlagTopBarSignalizeKeepOutAreas5_IXP": {
    "mechanism": "Adds visual indicators on the top bar for restricted areas.",
    "purpose": "Helps players avoid entering areas they shouldn't, improving gameplay safety."
  },
  "FFlagAXMigrateItemDetailsPeekViewToAutoFocus_Staged": {
    "mechanism": "Changes item detail views to automatically focus on important information.",
    "purpose": "Makes it easier for players to see and understand item details quickly."
  },
  "FFlagLuaAppHandleMouseCursor2_Staged": {
    "mechanism": "Improves how the game handles mouse cursor interactions in Lua applications.",
    "purpose": "Provides a smoother and more responsive mouse cursor experience for players."
  },
  "FFlagFriendsRoduxFixBlock_Staged": {
    "mechanism": "Fixes issues in the friends list management system using Rodux.",
    "purpose": "Ensures players can better manage their friends and see updates without glitches."
  },
  "FFlagAddNewPlayerListFocusNav_Staged": {
    "mechanism": "Introduces new navigation options for the player list interface.",
    "purpose": "Makes it easier for players to navigate and interact with their friends in the player list."
  },
  "FFlagExplorerFilterActionContext": {
    "mechanism": "Adds filtering options to the Explorer tool for better organization.",
    "purpose": "Helps players quickly find and manage items in their game projects."
  },
  "FFlagEnableUISoundAndHaptics10_Staged": {
    "mechanism": "Enables new sound and haptic feedback features in the user interface.",
    "purpose": "Enhances the overall gaming experience with better audio cues and tactile feedback."
  },
  "FFlagAddFriendsUserTileRefactor": {
    "mechanism": "Updates the layout and design of the friends list user tiles.",
    "purpose": "Improves the visual experience and usability when viewing friends on the platform."
  },
  "FFlagIASFixStudioKeyCodeDisplay_Staged": {
    "mechanism": "Fixes how key codes are displayed in the studio interface.",
    "purpose": "Ensures developers see accurate key codes, making it easier to script controls."
  },
  "DFFlagSimGeometryDeterministicSampling": {
    "mechanism": "Changes how simulation geometry is sampled for consistency.",
    "purpose": "Provides a more reliable and predictable gameplay experience."
  },
  "FFlagNetworkSchemaVersionServerBit": {
    "mechanism": "Introduces a new versioning system for network schemas.",
    "purpose": "Enhances compatibility and performance of networked games."
  },
  "FFlagSTM6798Enabled": {
    "mechanism": "Activates a specific feature or update related to the game engine.",
    "purpose": "Improves overall game performance and stability for players."
  },
  "FFlagAXIncreaseDefaultPeekViewHeight_Staged": {
    "mechanism": "Increases the height of the peek view for items in the game.",
    "purpose": "Allows players to see more details about items without needing to open them fully."
  },
  "FFlagSquadStartedCardBgFixEnabled_Staged": {
    "mechanism": "Fixes the background display of squad cards in the UI.",
    "purpose": "Improves the visual appearance of squad cards for a better user experience."
  },
  "FFlagAXItemDetailsShouldNotHaveQuickMenuButton_Staged": {
    "mechanism": "Removes the quick menu button from item detail views.",
    "purpose": "Streamlines the item detail interface, making it simpler for players to navigate."
  },
  "FFlagAXEnableInitialTopLevelPageCounter": {
    "mechanism": "Introduces a counter for the top-level pages in the UI.",
    "purpose": "Helps players track how many pages they have accessed, enhancing navigation."
  },
  "FFlagStreamJobRefactorSetCollection_PlaceFilter": {
    "mechanism": "Refactors the job stream to include a filter for collections in places.",
    "purpose": "Allows players to more easily find and manage collections of items within different places."
  },
  "FFlagAXRootSlotBasedEditorFlag5": {
    "mechanism": "Enables a slot-based system for organizing assets in the editor.",
    "purpose": "Helps creators manage their game assets more efficiently."
  },
  "FFlagEnableNotApprovedPageV2_IXP": {
    "mechanism": "Activates a new version of the page for unapproved content.",
    "purpose": "Improves the experience for users by providing clearer information about unapproved items."
  },
  "DFStringFlipTimeStampDynamicString": {
    "mechanism": "Changes how timestamps are displayed in dynamic strings.",
    "purpose": "Enhances readability of time-related information for players."
  },
  "FFlagSTM6798Enabled_Staged": {
    "mechanism": "Enables a specific feature related to state management in games.",
    "purpose": "Improves game performance and stability for players."
  },
  "FFlagVoiceForceRunOnLeave_Staged": {
    "mechanism": "Forces voice chat to continue running even when a player leaves a game.",
    "purpose": "Allows players to maintain communication with friends even after leaving a game."
  }
}