{
  "FFlagCapturesCloseGalleryTooltipWhenCarouselOpen_Staged": {
    "mechanism": "Enables a tooltip to appear when the gallery is open and the close button is clicked.",
    "purpose": "Helps players understand what the close button does while using the gallery."
  },
  "DFFlagParseDepartureIntentAsEnum": {
    "mechanism": "Changes how the system interprets player departure actions by using an enumeration.",
    "purpose": "Improves the accuracy of tracking why players leave the game."
  },
  "FFlagEnableBackgroundSignatureVerification": {
    "mechanism": "Adds a security check for background processes to verify signatures.",
    "purpose": "Enhances player security by ensuring that only verified processes run in the background."
  },
  "FFlagAXMigrateItemDetailsPeekViewToAutoFocus_Staged": {
    "mechanism": "Automatically focuses on item details when they are viewed.",
    "purpose": "Makes it easier for players to see important information about items quickly."
  },
  "FFlagVideoHandleEarlyServiceShutdown": {
    "mechanism": "Implements a method to manage video playback during unexpected service interruptions.",
    "purpose": "Ensures a smoother video experience for players even if the service has issues."
  },
  "FStringIxpNewLayersForRegistration_Staged": {
    "mechanism": "Introduces new layers in the registration process to enhance user experience.",
    "purpose": "Makes it easier for new players to sign up and start playing."
  },
  "FFlagFriendsRoduxFixBlock": {
    "mechanism": "Fixes issues in the friends system using a new data management approach.",
    "purpose": "Improves the reliability of friend interactions and notifications."
  },
  "FFlagAXEnableInitialTopLevelPageCounter": {
    "mechanism": "Adds a counter to track visits to the main page of the site.",
    "purpose": "Helps players see how popular the main page is and encourages exploration."
  },
  "FStringHelpPageIxpLayer_Staged": {
    "mechanism": "Updates the help page layout to provide better information access.",
    "purpose": "Makes it easier for players to find help and support when needed."
  },
  "FFlagAXGeneralizeInventoryItemsList_Staged": {
    "mechanism": "Standardizes how inventory items are displayed and managed.",
    "purpose": "Enhances the organization and usability of players' inventory."
  },
  "DFFlagPMDHeaderGeomTypeReading": {
    "mechanism": "Enables reading of geometry types from PMD headers in models.",
    "purpose": "Improves model compatibility and rendering accuracy."
  },
  "FFlagCachelessPluginLoading3_Staged": {
    "mechanism": "Allows plugins to load without using cached data.",
    "purpose": "Reduces loading times for plugins, enhancing user experience."
  },
  "DFIntReverbCameraPushForwardStudsHundredths": {
    "mechanism": "Adjusts camera position based on reverb settings in hundredths of studs.",
    "purpose": "Enhances audio immersion by aligning camera movement with sound effects."
  },
  "DFFlagClientScriptTimeout": {
    "mechanism": "Sets a timeout limit for client scripts to prevent them from running indefinitely.",
    "purpose": "Improves game performance by avoiding script hang-ups."
  },
  "FFlagLuaAppHandleMouseCursor2": {
    "mechanism": "Updates how the Lua application manages mouse cursor visibility and behavior.",
    "purpose": "Provides a smoother and more responsive cursor experience for players."
  },
  "FFlagGetGameIconsFromThumbnailsDeliveryApiIxp_Staged": {
    "mechanism": "Fetches game icons using a new thumbnails delivery API.",
    "purpose": "Improves the speed and quality of game icons displayed to players."
  },
  "FFlagAXGeneralizeInventoryItemsList_IXP": {
    "mechanism": "Standardizes how inventory items are listed across different systems.",
    "purpose": "Makes it easier for players to view and manage their inventory items."
  },
  "DFFlagNoCallstackAppendTarget_Staged": {
    "mechanism": "Removes additional data from error reports.",
    "purpose": "Simplifies error messages for developers, leading to faster fixes and better player experiences."
  },
  "DFFlagSupportNetworkValueFormatRandom2_Staged": {
    "mechanism": "Introduces a new format for network values in games.",
    "purpose": "Enhances the way game data is handled, improving performance and reliability for players."
  },
  "FFlagNativePurchaseRobuxPageWrapperEnableTelemetry_Staged": {
    "mechanism": "Enables tracking of user interactions on the Robux purchase page.",
    "purpose": "Helps improve the purchasing experience by analyzing player behavior."
  },
  "FFlagLuaAppLayoutParamsInContext_Staged": {
    "mechanism": "Adjusts layout parameters for Lua applications in a specific context.",
    "purpose": "Improves the visual arrangement of game interfaces for better user experience."
  },
  "FFlagAXEnableInitialTopLevelPageCounter_Staged": {
    "mechanism": "Enables a counter for tracking the initial top-level pages in the application.",
    "purpose": "Helps developers understand user navigation patterns, leading to better game design."
  },
  "FFlagInExperienceContainerScreenSizeReducer_Staged": {
    "mechanism": "Reduces the screen size of the experience container for better performance.",
    "purpose": "Enhances game performance on lower-end devices, making it accessible to more players."
  },
  "DFFlagReportInstanceMemoryToES_Staged": {
    "mechanism": "Sends memory usage data of game instances to an external service.",
    "purpose": "Allows developers to monitor and optimize memory usage, improving game stability."
  },
  "DFIntPerfDataGlobalThrottleHundredthsPercent": {
    "mechanism": "Sets a global throttle limit on performance data collection.",
    "purpose": "Ensures that performance monitoring does not negatively impact game performance."
  },
  "FFlagAddNewPlayerListFocusNav_Staged": {
    "mechanism": "Introduces a new navigation system for the player list.",
    "purpose": "Improves player experience by making it easier to find and interact with other players."
  },
  "FFlagAXAddInventoryItemsListProps_Staged": {
    "mechanism": "Adds new properties to the inventory items list for better data handling.",
    "purpose": "Enhances the inventory interface, allowing players to manage their items more efficiently."
  },
  "FFlagToolboxRetryReloadFailures3_Staged": {
    "mechanism": "Implements a retry mechanism for loading toolbox assets.",
    "purpose": "Ensures that players can access their toolbox items more reliably, reducing frustration."
  },
  "FFlagCheckPillSelectedPressedState_Staged": {
    "mechanism": "Checks the state of selected UI elements in the game.",
    "purpose": "Improves UI responsiveness, making it clearer when options are selected or pressed."
  },
  "FFlagStreamJobRefactorSetCollection_PlaceFilter": {
    "mechanism": "Refactors how collections of game places are filtered during streaming.",
    "purpose": "Optimizes game loading times, providing a smoother experience for players when accessing different game areas."
  },
  "FFlagInExperienceContainerScreenSizeReducer": {
    "mechanism": "Reduces the size of the experience container on the screen.",
    "purpose": "Improves the layout and visibility of game elements for players."
  },
  "FFlagLuaAppHandleMouseCursor2_Staged": {
    "mechanism": "Updates how the Lua app manages mouse cursor interactions.",
    "purpose": "Enhances the responsiveness and accuracy of mouse controls in games."
  },
  "FFlagEnableBacktraceMetricKitReporter3_Staged": {
    "mechanism": "Activates a tool for tracking errors and performance issues.",
    "purpose": "Helps developers fix problems faster, leading to a smoother gameplay experience."
  },
  "FFlagFixCdsduiRFYGridItemsPerRowLogic_Staged": {
    "mechanism": "Corrects the logic for how items are displayed in a grid format.",
    "purpose": "Ensures items are organized correctly, making it easier for players to navigate and find what they need."
  },
  "FFlagDisableNpotException": {
    "mechanism": "Turns off a specific error that occurs with non-power-of-two textures.",
    "purpose": "Prevents crashes or issues when using certain textures, improving game stability."
  },
  "FFlagDynamicTranslationAlwaysRetranslate_Staged": {
    "mechanism": "Enables constant re-evaluation of translations for dynamic content.",
    "purpose": "Ensures players always see the most accurate translations in real-time."
  },
  "FFlagRemoveMeInParent2": {
    "mechanism": "Removes a specific legacy feature from the parent object structure.",
    "purpose": "Streamlines the game development process for creators by simplifying object management."
  },
  "DFStringFlagRepoGitHashDynamicString": {
    "mechanism": "Links dynamic strings to a specific version in the code repository.",
    "purpose": "Allows players to benefit from the latest updates and features based on the current code version."
  },
  "FFlagCustomizedLandingLaunchGame_Staged": {
    "mechanism": "Introduces personalized landing pages for games upon launch.",
    "purpose": "Enhances player experience by providing tailored game introductions and information."
  },
  "FFlagLuauAutocompleteAttributes": {
    "mechanism": "Improves code editor features to suggest attributes while coding in Luau.",
    "purpose": "Helps developers write code faster and more accurately, improving game quality."
  },
  "FFlagPropertiesMixStylingAndPackageDefaultsCorrectly_Staged": {
    "mechanism": "Adjusts how styles and default settings are combined for properties in packages.",
    "purpose": "Ensures that styles and defaults look consistent and work well together in games."
  },
  "FFlagUseNewCorrelateProfilerDataFunction_Staged": {
    "mechanism": "Implements a new function to gather and analyze performance data more effectively.",
    "purpose": "Helps developers understand game performance better, leading to smoother gameplay for players."
  },
  "FFlagFixDelayAfterPurchaseFlowComplete": {
    "mechanism": "Reduces the waiting time after a purchase is completed in the game.",
    "purpose": "Makes the buying process faster and more seamless for players."
  },
  "FFlagDeprecateExperienceInterventionNamespace_Staged": {
    "mechanism": "Removes an outdated system for managing game interventions.",
    "purpose": "Streamlines game management, potentially improving game stability for players."
  },
  "FFlagFixDelayAfterPurchaseFlowComplete_Staged": {
    "mechanism": "Addresses issues causing delays after a purchase is finalized.",
    "purpose": "Enhances the user experience by speeding up the post-purchase process for players."
  },
  "FFlagFixCdsduiRFYGridItemsPerRowLogic": {
    "mechanism": "Adjusts the logic for how items are arranged in a grid layout.",
    "purpose": "Ensures that items display correctly in rows, improving the visual organization."
  },
  "DFFlagFixPrimitiveShapeInertiaMigration_Staged": {
    "mechanism": "Updates the physics behavior of basic shapes to improve consistency.",
    "purpose": "Enhances the stability and realism of object interactions in the game."
  },
  "FFlagCheckPillSelectedPressedState": {
    "mechanism": "Implements a check for the selected state of UI elements when pressed.",
    "purpose": "Improves the responsiveness and feedback of UI elements for players."
  },
  "DFFlagSimGeometryDeterministicSampling": {
    "mechanism": "Changes how geometric shapes are sampled for simulation to ensure consistent results.",
    "purpose": "Provides more reliable and predictable physics behavior in the game."
  },
  "FFlagIASFixDirection3DHandedness_Staged": {
    "mechanism": "Corrects the handling of 3D directional inputs for user interfaces.",
    "purpose": "Improves the accuracy of controls, making gameplay feel more intuitive."
  },
  "FFlagAddNewPlayerListFocusNav": {
    "mechanism": "Adds a new navigation feature to the player list interface.",
    "purpose": "Helps players easily find and focus on other players in the game."
  },
  "FFlagAXEnablePrefetchMarketplaceFailsafe": {
    "mechanism": "Implements a backup system for loading marketplace items.",
    "purpose": "Ensures players can still access items even if the main loading fails."
  },
  "FFlagEnableMultipartForMeshImage": {
    "mechanism": "Allows multiple parts to be combined into a single mesh image.",
    "purpose": "Improves the visual quality and performance of 3D models in games."
  },
  "FFlagTexturePackGeneratorFix": {
    "mechanism": "Fixes issues in the tool that creates texture packs.",
    "purpose": "Ensures players can create and use texture packs without problems."
  },
  "FFlagAXPrefetchMarketplaceIXP2_Staged": {
    "mechanism": "Enhances the preloading process for marketplace items in a staged manner.",
    "purpose": "Speeds up item loading times for players browsing the marketplace."
  },
  "DFFlagParseDepartureIntentAsEnum_Staged": {
    "mechanism": "Changes how departure intents are interpreted by using an enumeration.",
    "purpose": "Improves the accuracy of player departure actions, leading to better game behavior."
  },
  "EnableExitImmediatelyOnBackgroundingOnQuest": {
    "mechanism": "N/A (invalid)",
    "purpose": "N/A (invalid)"
  },
  "FFlagAddFriendsFixText": {
    "mechanism": "Fixes text issues related to adding friends in the interface.",
    "purpose": "Makes it clearer and easier for players to understand how to add friends."
  },
  "FFlagCASButtonsOnWindowsTouch": {
    "mechanism": "Enables touch-friendly buttons for character customization on Windows devices.",
    "purpose": "Improves accessibility for players using touch screens to customize their characters."
  },
  "DFFlagUseModelInsteadOfItsParent_Staged": {
    "mechanism": "Changes the way models are referenced in the game, using the model directly instead of its parent object.",
    "purpose": "Enhances performance and stability by streamlining how models are handled in the game."
  },
  "FFlagAXRootSlotBasedEditorFlag5_IXP": {
    "mechanism": "Enables a new editor interface for placing objects in a slot-based system.",
    "purpose": "Makes it easier for developers to organize and place objects in their games."
  },
  "DFIntConvexDecompCompressionSelector": {
    "mechanism": "Selects a method for compressing complex shapes in 3D models.",
    "purpose": "Improves game performance by reducing the size of 3D models."
  },
  "DFFlagCLI172177_Staged": {
    "mechanism": "Introduces a staged rollout for new command line interface features.",
    "purpose": "Allows developers to test new features gradually before full release."
  },
  "FFlagCustomizedLandingLaunchGame": {
    "mechanism": "Enables customized landing pages for games when launched.",
    "purpose": "Enhances the player experience by providing tailored content on game launch."
  },
  "FFlagEnableUISoundAndHaptics10": {
    "mechanism": "Activates sound effects and haptic feedback for user interface interactions.",
    "purpose": "Improves player engagement by adding audio and tactile responses to UI actions."
  },
  "FFlagWindowsInstallerPostWebLaunch": {
    "mechanism": "Enables a new installer for Windows that runs after a web launch.",
    "purpose": "Improves the installation process for players using Windows."
  },
  "FFlagDeprecateExperienceInterventionNamespace": {
    "mechanism": "Removes an old system for handling experience interventions.",
    "purpose": "Streamlines the experience for players by eliminating outdated features."
  },
  "FFlagNativePurchaseRobuxPageWrapperEnableTelemetry": {
    "mechanism": "Adds tracking to the Robux purchase page to gather usage data.",
    "purpose": "Helps improve the purchasing experience for players by analyzing how they interact with it."
  },
  "FFlagCASButtonsOnWindowsTouch_Staged": {
    "mechanism": "Introduces new touch-friendly buttons for Windows devices.",
    "purpose": "Enhances usability for players on touch-enabled Windows devices."
  },
  "FFlagTexturePackGeneratorFix_Staged": {
    "mechanism": "Fixes issues in the texture pack generation system.",
    "purpose": "Ensures smoother creation of texture packs for players, improving customization options."
  },
  "FFlagHelpPageIXPExposure_Staged": {
    "mechanism": "Enables a new version of the help page for testing.",
    "purpose": "Provides players with improved help resources and support."
  },
  "DFStringFlipTimeStampDynamicString": {
    "mechanism": "Changes how timestamps are displayed dynamically in strings.",
    "purpose": "Enhances the readability of time-related information for players."
  },
  "DFFlagVoiceChatSendHttpErrorsTelemetry2": {
    "mechanism": "Collects data on HTTP errors related to voice chat.",
    "purpose": "Helps improve voice chat reliability by identifying issues."
  },
  "FFlagLuaAppUpdateCollectionHeader2": {
    "mechanism": "Updates the header for Lua app collections.",
    "purpose": "Improves organization and accessibility of Lua app collections for users."
  },
  "FFlagLuauAutocompleteAttributes_Staged": {
    "mechanism": "Enables enhanced autocomplete features for attributes in Luau.",
    "purpose": "Makes coding easier for developers by suggesting attributes automatically."
  },
  "FFlagVoiceForceRunOnLeave_Staged": {
    "mechanism": "Forces voice chat to continue running even when a player leaves a game.",
    "purpose": "Allows players to maintain voice communication with friends even after they exit a game."
  },
  "DFIntBacktraceMetricKitUploadHundrethsPercent": {
    "mechanism": "Adjusts the frequency of uploading performance metrics to improve stability.",
    "purpose": "Helps developers track and improve game performance for a smoother player experience."
  },
  "FFlagAXItemDetailsShouldNotHaveQuickMenuButton_Staged": {
    "mechanism": "Removes the quick menu button from item detail views in the catalog.",
    "purpose": "Simplifies the item detail page for players, making it easier to focus on item information."
  },
  "DFIntConvexDecompCompressionSelector_Staged": {
    "mechanism": "Changes how 3D models are compressed for better performance.",
    "purpose": "Improves loading times and performance of games with complex models for players."
  },
  "DFFlagSplineClampForNaNInput_Staged": {
    "mechanism": "Prevents errors in spline calculations when invalid numbers are used.",
    "purpose": "Ensures smoother gameplay by avoiding glitches caused by unexpected input values."
  },
  "FFlagAXItemDetailsShouldNotHaveQuickMenuButton": {
    "mechanism": "Removes the quick menu button from item detail views.",
    "purpose": "Simplifies the item details interface for a cleaner experience."
  },
  "DFFlagCLI171730AddSizeCheck": {
    "mechanism": "Implements a size check in the command line interface.",
    "purpose": "Ensures that commands are processed correctly without errors related to size limits."
  },
  "FFlagAXFixFlashingNoItemsFound_Staged": {
    "mechanism": "Fixes a visual issue where a 'no items found' message would flash unexpectedly.",
    "purpose": "Provides a smoother user experience by eliminating distracting visual glitches."
  },
  "FFlagLuaAppUpdateCollectionHeader2_Staged": {
    "mechanism": "Updates the header for collection displays in the Lua app.",
    "purpose": "Enhances the organization and appearance of collections for better usability."
  },
  "FFlagSwapAppGameTileAndSduiGameTileInRFY": {
    "mechanism": "Swaps the game tile display between the app and the SDUI.",
    "purpose": "Improves consistency in how games are presented across different interfaces."
  },
  "DFFlagUseModelInsteadOfItsParent": {
    "mechanism": "Switches the rendering process to use a model directly rather than its parent object.",
    "purpose": "Improves performance and visual fidelity by optimizing how models are displayed."
  },
  "FFlagLuaAppLayoutParamsInContext": {
    "mechanism": "Enables layout parameters to be used within specific contexts in Lua applications.",
    "purpose": "Allows developers to create more responsive and adaptable user interfaces."
  },
  "DFFlagSplineClampForNaNInput": {
    "mechanism": "Adds checks to prevent NaN (not a number) values from affecting spline calculations.",
    "purpose": "Ensures smoother animations and movements by avoiding errors in calculations."
  },
  "FFlagHelpPageIXPExposure": {
    "mechanism": "Increases visibility of help pages related to in-experience purchases.",
    "purpose": "Helps players easily find assistance and information about in-game purchases."
  },
  "FFlagAvatarGenerationFailedEvents": {
    "mechanism": "Introduces events that trigger when avatar generation fails.",
    "purpose": "Allows developers to handle errors better and improve user experience when avatars don't load correctly."
  },
  "FFlagPlayerFeedbackPromptEnabled": {
    "mechanism": "Enables a prompt for players to provide feedback within the game.",
    "purpose": "Allows players to easily share their thoughts and suggestions, improving the overall game experience."
  },
  "FFlagMakeupUVBoundsStretchAfterCrop_Staged": {
    "mechanism": "Adjusts how makeup textures are applied after being cropped to fit characters.",
    "purpose": "Ensures that makeup looks better and fits properly on characters, enhancing visual appeal."
  },
  "FFlagPluginGuiPointerEvents_Staged": {
    "mechanism": "Enables pointer events for GUI elements in plugins, allowing for better interaction.",
    "purpose": "Improves how players and developers interact with plugin interfaces, making them more user-friendly."
  },
  "FFlagSwapAppGameTileAndSduiGameTileInRFY_Staged": {
    "mechanism": "Replaces the game tile display method in the app with a new one.",
    "purpose": "Provides a more visually appealing and functional game tile presentation for players."
  },
  "FFlagAXIncreaseDefaultPeekViewHeight_IXP": {
    "mechanism": "Increases the default height of the peek view in the user interface.",
    "purpose": "Gives players a better view of content without needing to adjust settings, enhancing usability."
  },
  "FFlagAXMigrateAXFocusBehaviorRoot_Staged": {
    "mechanism": "Changes how focus behavior is handled in the user interface.",
    "purpose": "Improves user navigation and interaction in games."
  },
  "DFFlagFixPrimitiveShapeInertiaMigration": {
    "mechanism": "Addresses issues with how basic shapes respond to forces.",
    "purpose": "Enhances the realism and stability of object movements in games."
  },
  "DFIntPhoto2AvatarErrorEventsThrottleHundredthsPercent_Staged": {
    "mechanism": "Limits the frequency of error events related to avatar photos.",
    "purpose": "Reduces spam and improves performance when uploading avatar images."
  },
  "FFlagDifferentiateSharingBaseOnPlatform": {
    "mechanism": "Modifies sharing features based on the player's device.",
    "purpose": "Provides a tailored sharing experience depending on whether players are on mobile, PC, etc."
  },
  "DFFlagProcessStatisticsMemoryFix_Staged": {
    "mechanism": "Fixes memory usage issues in processing game statistics.",
    "purpose": "Improves game performance and reduces crashes related to memory overload."
  },
  "DFFlagVoiceChatSendHttpErrorsTelemetry2_Staged": {
    "mechanism": "Sends data about voice chat errors to the server for analysis.",
    "purpose": "Helps improve voice chat reliability by tracking issues."
  },
  "FFlagVoiceForceRunOnLeave": {
    "mechanism": "Ensures voice chat continues to run even if a player leaves a game.",
    "purpose": "Allows players to stay connected and communicate until they fully exit."
  },
  "FFlagSTM6798Enabled": {
    "mechanism": "Activates a specific feature or system update in the game.",
    "purpose": "Enhances gameplay experience with new functionalities or improvements."
  },
  "DFFlagDCDReadLegacyWithDecoder_Staged": {
    "mechanism": "Reads older data formats using a new decoding method.",
    "purpose": "Ensures compatibility with older content while using updated systems."
  },
  "FFlagAEGetEditableOutfitsType": {
    "mechanism": "Allows players to access and modify their outfit types.",
    "purpose": "Gives players more control over their character's appearance."
  },
  "FFlagLuauResumeFix": {
    "mechanism": "Fixes an issue where scripts in Luau could fail to resume correctly.",
    "purpose": "Ensures smoother gameplay by allowing scripts to run without interruptions."
  },
  "FFlagAXPeekViewContentShouldNotBeSelectable": {
    "mechanism": "Prevents certain UI elements from being selected in the game interface.",
    "purpose": "Improves user experience by making it easier to interact with the game without accidental selections."
  },
  "FFlagFriendsRoduxFixBlock_Staged": {
    "mechanism": "Addresses bugs in the friends system by improving data handling.",
    "purpose": "Enhances the reliability of friend interactions and features in the game."
  },
  "FFlagAXMigrateTryOnItemScreenToAutofocus_Staged": {
    "mechanism": "Changes the item try-on screen to automatically focus on the item being tried on.",
    "purpose": "Makes it quicker and easier for players to try on items without extra clicks."
  },
  "DFFlagDCDReadLegacyWithDecoder": {
    "mechanism": "Allows the game to read older data formats using a new decoding method.",
    "purpose": "Ensures compatibility with older items and features, improving overall game stability."
  },
  "FFlagSTM6798Enabled_Staged": {
    "mechanism": "Enables a new system for managing game state transitions.",
    "purpose": "Improves the stability and performance of games during transitions."
  },
  "FFlagIASFixStudioKeyCodeDisplay": {
    "mechanism": "Fixes how key codes are displayed in the development studio.",
    "purpose": "Makes it easier for developers to see and use the correct key codes while creating games."
  },
  "FFlagFixMediaKeysMapping_Staged": {
    "mechanism": "Corrects the mapping of media keys for better functionality.",
    "purpose": "Enhances the user experience by ensuring media keys work correctly during gameplay."
  },
  "FFlagRenderParticlesSimulateNonVisible6_Staged": {
    "mechanism": "Allows particles to be simulated even when not visible to the player.",
    "purpose": "Improves the visual effects and realism in games by maintaining particle behavior off-screen."
  },
  "FFlagVideoHandleEarlyServiceShutdown_Staged": {
    "mechanism": "Improves how video services handle unexpected shutdowns.",
    "purpose": "Ensures a smoother experience for players when watching videos in games, reducing interruptions."
  },
  "FFlagAXMigrateTryOnItemScreenToAutofocus": {
    "mechanism": "Switches the item try-on screen to automatically focus on the item being tried on.",
    "purpose": "Makes it easier for players to see and interact with items they want to try on."
  },
  "FFlagWebBrowserWinExecuteJavaScriptNullGuard": {
    "mechanism": "Implements a safety check to prevent errors when executing JavaScript in the web browser.",
    "purpose": "Improves stability and user experience when using web features in Roblox."
  },
  "DFIntReverbCameraPushForwardStudsHundredths_Staged": {
    "mechanism": "Adjusts the camera position slightly forward in relation to sound reverb effects.",
    "purpose": "Enhances audio immersion by better aligning sound effects with the player's perspective."
  },
  "FIntImprovedStrokesBetaFeatureRolloutPercent_Staged": {
    "mechanism": "Gradually introduces a new drawing feature to a percentage of users for testing.",
    "purpose": "Allows players to access improved drawing tools while ensuring stability before full release."
  },
  "DFFlagSimGeometryDeterministicSampling_Staged": {
    "mechanism": "Ensures consistent results in simulations by using a fixed method for sampling geometry.",
    "purpose": "Provides players with a more reliable and predictable gameplay experience in simulations."
  },
  "FFlagSquadStartedCardBgFixEnabled_Staged": {
    "mechanism": "Adjusts the background display of squad cards in the UI.",
    "purpose": "Improves the visual appearance of squad cards for better readability."
  },
  "DFFlagCLI171730AddSizeCheck_Staged": {
    "mechanism": "Adds a size validation check in the command line interface.",
    "purpose": "Ensures that commands are executed with the correct size parameters, preventing errors."
  },
  "DFFlagClientScriptTimeout_Staged": {
    "mechanism": "Implements a timeout for client scripts to prevent them from running indefinitely.",
    "purpose": "Enhances game performance by stopping scripts that take too long to execute."
  },
  "FFlagMakeupUVBoundsStretchAfterCrop": {
    "mechanism": "Allows UV mapping to stretch after cropping makeup textures.",
    "purpose": "Improves the appearance of makeup items by ensuring they fit better on avatars."
  },
  "FFlagUsernameValidatorSelectorPaddingFix_Staged": {
    "mechanism": "Fixes padding issues in the username validation selector.",
    "purpose": "Enhances the user interface for username selection, making it more user-friendly."
  },
  "FFlagToolboxRetryReloadFailures3": {
    "mechanism": "Retries loading toolbox assets if the initial attempt fails.",
    "purpose": "Improves the reliability of loading tools and assets for developers."
  },
  "FFlagAEGetEditableOutfitsType_Staged": {
    "mechanism": "Allows access to a new type of editable outfits in the avatar editor.",
    "purpose": "Enhances customization options for players' avatars."
  },
  "FFlagUsernameValidatorSelectorPaddingFix": {
    "mechanism": "Fixes layout issues in the username validation interface.",
    "purpose": "Provides a smoother experience when creating or changing usernames."
  },
  "FFlagIASFixStudioKeyCodeDisplay_Staged": {
    "mechanism": "Corrects the display of key codes in the studio interface.",
    "purpose": "Makes it easier for developers to understand and use key codes."
  },
  "FFlagCachelessPluginLoading3": {
    "mechanism": "Loads plugins without relying on cached versions.",
    "purpose": "Ensures that the latest versions of plugins are always used, improving functionality."
  },
  "FFlagLuauIndividualRecursionLimits": {
    "mechanism": "Sets limits on how deeply functions can call themselves in scripts.",
    "purpose": "Prevents scripts from running indefinitely, improving game stability."
  },
  "FFlagAXRootSlotBasedEditorFlag5_Staged": {
    "mechanism": "Introduces a new way to organize and edit components in the game editor.",
    "purpose": "Makes it easier for developers to manage game elements and improve workflow."
  },
  "DFFlagSupportNetworkValueFormatRandom2": {
    "mechanism": "Enhances the way network values are formatted and transmitted.",
    "purpose": "Improves the performance and reliability of multiplayer interactions."
  },
  "FFlagAXPeekViewContentShouldNotBeSelectable_Staged": {
    "mechanism": "Prevents certain content in the editor from being selected or modified.",
    "purpose": "Helps developers focus on the right elements without accidental changes."
  },
  "DFFlagEnableContentTypeInRegister": {
    "mechanism": "Allows developers to specify content types when registering new assets.",
    "purpose": "Improves asset organization and retrieval for better game development."
  },
  "DFIntBacktraceMetricKitUploadHundrethsPercent_Staged": {
    "mechanism": "Tracks and uploads performance metrics related to backtraces in hundredths of a percent.",
    "purpose": "Improves the game's stability by providing developers with detailed error reports."
  },
  "FFlagAXFixReactPerfExperimentCounter_Staged": {
    "mechanism": "Adjusts performance counters in the React framework for better tracking.",
    "purpose": "Enhances the responsiveness of the user interface, making gameplay smoother."
  },
  "FFlagEnableBackgroundSignatureVerification_Staged": {
    "mechanism": "Checks the authenticity of scripts in the background to ensure they are safe.",
    "purpose": "Increases player security by preventing malicious scripts from running."
  },
  "FFlagLuauResumeFix_Staged": {
    "mechanism": "Fixes issues related to the Luau scripting language's resume functionality.",
    "purpose": "Ensures smoother execution of scripts, leading to fewer gameplay interruptions."
  },
  "FFlagAXFixReactPerfExperimentCounter": {
    "mechanism": "Implements fixes to performance counters in React for ongoing experiments.",
    "purpose": "Improves the overall performance of the game interface, enhancing player experience."
  },
  "FFlagUseNewHapticServiceInUA3": {
    "mechanism": "Enables a new system for providing tactile feedback through controllers.",
    "purpose": "Enhances player experience by making interactions feel more immersive with vibrations."
  },
  "FStringIxpNewLayersForRegistration": {
    "mechanism": "Introduces additional layers in the user registration process.",
    "purpose": "Simplifies and improves the sign-up experience for new players."
  },
  "FFlagExplorerFilterActionContext_Staged": {
    "mechanism": "Implements a new filtering system in the Explorer tool for easier access to actions.",
    "purpose": "Makes it easier for developers to find and manage their game elements."
  },
  "FFlagSettingsPageScaleTextSize": {
    "mechanism": "Allows text size adjustments on the settings page.",
    "purpose": "Improves accessibility by letting players customize text size for better readability."
  },
  "DFFlagNoCallstackAppendTarget": {
    "mechanism": "Disables appending target information to error call stacks.",
    "purpose": "Streamlines error reporting for developers, making it easier to identify issues."
  },
  "FFlagIASFixDirection3DHandedness": {
    "mechanism": "Adjusts the way directional inputs are interpreted in 3D space for better accuracy.",
    "purpose": "Improves player control and responsiveness in 3D environments."
  },
  "FFlagCarouselUseNewUserTileWithPresenceIcon_IXP": {
    "mechanism": "Introduces a new user interface element that shows online status in user profiles.",
    "purpose": "Helps players quickly identify which friends are online and available to play."
  },
  "FFlagAddFriendsUserTileRefactor_Staged": {
    "mechanism": "Updates the layout and functionality of the friend list display.",
    "purpose": "Enhances the user experience when managing and viewing friends on Roblox."
  },
  "FFlagRemoveMeInParent2_Staged": {
    "mechanism": "Removes the 'Me' tab from the parent interface to streamline navigation.",
    "purpose": "Simplifies the interface for players, making it easier to find and interact with other users."
  },
  "FFlagLuaAppScrollableDesktopCarousels2": {
    "mechanism": "Implements scrollable carousels for content display in the desktop app.",
    "purpose": "Allows players to easily browse through games and items without cluttering the screen."
  },
  "FStringFlagRepoGitHashFastString": {
    "mechanism": "Uses a faster method to retrieve version information from the repository.",
    "purpose": "Improves loading times for updates, making the game experience smoother."
  },
  "FFlagUseNewHapticServiceInUA3_Staged": {
    "mechanism": "Implements a new system for providing haptic feedback in games.",
    "purpose": "Enhances player immersion by making interactions feel more realistic through vibrations."
  },
  "DFFlagEnableLuaApiToRegisterEncryptedAssets_PlaceFilter": {
    "mechanism": "Allows developers to register encrypted assets with a specific filter in Lua scripts.",
    "purpose": "Increases security for game assets, ensuring that only authorized content is used."
  },
  "FFlagAvatarGenBodyColorFix": {
    "mechanism": "Fixes issues with body color generation for avatars.",
    "purpose": "Ensures that avatars display colors correctly, improving visual consistency."
  },
  "FFlagAvatarGenerationFailedEvents_Staged": {
    "mechanism": "Tracks and reports failures during avatar generation processes.",
    "purpose": "Helps developers identify and fix issues, leading to a better avatar creation experience for players."
  },
  "FFlagEnableTelemetryIntegrationCheck_Staged": {
    "mechanism": "Enables a system to check and integrate telemetry data.",
    "purpose": "Improves data collection for better game performance insights."
  },
  "DFIntClientScriptTimeoutValueMsec": {
    "mechanism": "Sets a timeout value for client scripts to prevent them from running too long.",
    "purpose": "Ensures smoother gameplay by avoiding script hang-ups."
  },
  "FFlagWindowsInstallerPostWebLaunch_Staged": {
    "mechanism": "Allows the Windows installer to launch after a web-based installation.",
    "purpose": "Streamlines the installation process for new users on Windows."
  },
  "FFlagGetGameIconsFromThumbnailsDeliveryApiIxp": {
    "mechanism": "Fetches game icons using a dedicated thumbnails delivery API.",
    "purpose": "Provides faster and more reliable access to game icons for better visuals."
  },
  "FFlagAXFixOrganicTTILogging_Staged": {
    "mechanism": "Fixes issues with logging organic traffic and telemetry data.",
    "purpose": "Enhances tracking accuracy for player interactions and game performance."
  },
  "FStringHelpPageIxpLayer": {
    "mechanism": "Updates the help page to use a new interface layer.",
    "purpose": "Provides a more user-friendly and informative help page for players."
  },
  "FFlagMoveNewPlayerListDividers": {
    "mechanism": "Changes the layout of the player list by adding visual dividers.",
    "purpose": "Makes it easier for players to see and differentiate between groups of players."
  },
  "FFlagEnableMultipartForMeshImage_Staged": {
    "mechanism": "Allows mesh images to be loaded in multiple parts for better performance.",
    "purpose": "Improves the loading speed and quality of mesh images for players."
  },
  "FFlagEnableBacktraceMetricKitReporter3": {
    "mechanism": "Activates a new reporting tool for tracking errors and performance.",
    "purpose": "Helps developers fix issues faster, leading to a smoother experience for players."
  },
  "FFlagToolboxWebViewTutorial4_Staged": {
    "mechanism": "Introduces a new tutorial within the toolbox using a web view.",
    "purpose": "Guides players more effectively on how to use the toolbox features."
  },
  "DFFlagWriteFlagCacheAfterFlagFetch_Staged": {
    "mechanism": "Updates the cache with flag values after they are fetched from the server.",
    "purpose": "Improves performance by reducing the number of server requests needed for flag data."
  },
  "FFlagAvatarGenBodyColorFix_Staged": {
    "mechanism": "Corrects the way body colors are generated for avatars.",
    "purpose": "Ensures that avatars display their intended colors accurately."
  },
  "FFlagAddFriendsUserTileRefactor": {
    "mechanism": "Reworks the user interface for displaying friends' profiles.",
    "purpose": "Enhances the visual layout and usability of the friends list."
  },
  "DFFlagPMDHeaderGeomTypeReading_Staged": {
    "mechanism": "Allows reading of geometry types in the header of PMD files.",
    "purpose": "Enables better handling of 3D models, improving their appearance and functionality."
  },
  "FFlagStreamJobRefactorSetCollection_Staged": {
    "mechanism": "Revises how job collections are managed in streaming.",
    "purpose": "Optimizes streaming of game assets, leading to smoother gameplay."
  },
  "FFlagAXEnablePrefetchMarketplaceFailsafe_Staged": {
    "mechanism": "Enables a system to prefetch marketplace data to prevent failures.",
    "purpose": "Improves the reliability of accessing marketplace items, reducing errors for players."
  },
  "FFlagDifferentiateSharingBaseOnPlatform_Staged": {
    "mechanism": "Changes how sharing features work based on the player's platform (e.g., PC, mobile).",
    "purpose": "Enhances the sharing experience by tailoring it to the specific device being used."
  },
  "FFlagAXFixFlashingNoItemsFound": {
    "mechanism": "Fixes a visual glitch that causes a flashing effect when no items are found.",
    "purpose": "Provides a smoother user experience by eliminating distracting visual errors."
  },
  "FFlagStreamJobRefactorSetCollection": {
    "mechanism": "Refactors how job streaming is handled to improve performance.",
    "purpose": "Enhances game loading times and stability, leading to a better gameplay experience."
  },
  "FFlagAXFixOrganicTTILogging": {
    "mechanism": "Corrects the logging system for tracking organic TTI (Time to Interactive) metrics.",
    "purpose": "Improves the accuracy of performance tracking, helping developers optimize games better."
  },
  "FFlagAXMigrateItemDetailsPeekViewToAutoFocus": {
    "mechanism": "Switches the item details view to automatically focus on the selected item.",
    "purpose": "Makes it easier for players to see and interact with item details without extra clicks."
  },
  "FFlagEnableUISoundAndHaptics10_Staged": {
    "mechanism": "Enables new sound and vibration feedback features in the user interface.",
    "purpose": "Enhances player experience by providing audio and tactile responses during interactions."
  },
  "FFlagAXIncreaseDefaultPeekViewHeight_Staged": {
    "mechanism": "Increases the height of the peek view for item details.",
    "purpose": "Allows players to see more information about items at a glance."
  },
  "FFlagAXAddInventoryItemsListProps_IXP": {
    "mechanism": "Adds new properties to the inventory items list for better customization.",
    "purpose": "Improves how players can manage and view their inventory items."
  },
  "FFlagFlagRolloutTestStaticBool16_Staged": {
    "mechanism": "Tests a specific feature flag that can be toggled on or off for certain users.",
    "purpose": "Helps developers evaluate new features before a wider release to improve player experience."
  },
  "FFlagLuauResumeFix_PlaceFilter": {
    "mechanism": "Fixes an issue in the Luau scripting language related to filtering places when resuming scripts.",
    "purpose": "Ensures smoother gameplay by preventing script errors that could disrupt the experience."
  },
  "FFlagPlayerFeedbackPromptEnabled_Staged": {
    "mechanism": "Enables a system to prompt players for feedback during gameplay.",
    "purpose": "Allows players to share their thoughts, helping improve the game based on user experiences."
  },
  "FFlagCapturesCloseGalleryTooltipWhenCarouselOpen": {
    "mechanism": "Modifies the tooltip behavior in the gallery when a carousel is open.",
    "purpose": "Improves user interface by ensuring tooltips are more relevant and easier to access while browsing."
  },
  "FFlagDisableNpotException_Staged": {
    "mechanism": "Disables an exception that occurs with non-power-of-two textures.",
    "purpose": "Enhances compatibility for players using various textures, leading to fewer visual issues."
  },
  "FIntImprovedStrokesBetaFeatureRolloutPercent": {
    "mechanism": "Controls the percentage of players who receive access to a new drawing feature in beta.",
    "purpose": "Gradually introduces new drawing tools to players, allowing for better art creation and feedback collection."
  },
  "DFIntPerfDataGlobalThrottleHundredthsPercent_Staged": {
    "mechanism": "Adjusts the performance data throttling percentage for global metrics.",
    "purpose": "Improves overall game performance by optimizing data collection."
  },
  "FFlagCeaseUAPresenceRealtimeNotificationUpdatesInGameV2_IXP": {
    "mechanism": "Disables real-time presence updates for user avatars in games.",
    "purpose": "Reduces distractions and enhances gameplay experience by minimizing notifications."
  },
  "DFIntClientScriptTimeoutValueMsec_Staged": {
    "mechanism": "Sets a timeout limit for client-side scripts to prevent them from running too long.",
    "purpose": "Ensures smoother gameplay by preventing lag caused by long-running scripts."
  },
  "FFlagLuauIndividualRecursionLimits_Staged": {
    "mechanism": "Implements specific limits on recursion depth for scripts written in Luau.",
    "purpose": "Prevents crashes and improves stability by controlling how deep scripts can call themselves."
  },
  "FFlagSettingsPageScaleTextSize_Staged": {
    "mechanism": "Allows scaling of text size on the settings page for better readability.",
    "purpose": "Enhances user experience by making text easier to read for all players."
  },
  "FFlagAddFriendsFixText_Staged": {
    "mechanism": "Updates the text displayed when adding friends to ensure clarity.",
    "purpose": "Improves user experience by making it easier to understand friend requests."
  },
  "FStringFlipTimeStampFastString": {
    "mechanism": "Optimizes how timestamps are processed and displayed in the game.",
    "purpose": "Enhances performance by making time-related data load faster."
  },
  "FFlagMoveNewPlayerListDividers_Staged": {
    "mechanism": "Changes the layout of player list dividers for better organization.",
    "purpose": "Helps players find and manage their friends more easily."
  },
  "FFlagStatusFileMutex_Staged": {
    "mechanism": "Implements a locking mechanism to prevent file access conflicts.",
    "purpose": "Ensures smoother gameplay by reducing errors related to file access."
  },
  "FFlagWebBrowserWinExecuteJavaScriptNullGuard_Staged": {
    "mechanism": "Adds a safeguard to prevent errors when executing JavaScript in web browsers.",
    "purpose": "Improves stability and reliability of web features in Roblox."
  },
  "FFlagToolboxWebViewTutorial4": {
    "mechanism": "Enables a new tutorial interface in the toolbox using a web view.",
    "purpose": "Helps players learn how to use the toolbox more effectively."
  },
  "DFFlagReportInstanceMemoryToES": {
    "mechanism": "Sends memory usage data of instances to the engine for analysis.",
    "purpose": "Improves game performance by identifying memory issues."
  },
  "DFFlagAddTranslationDisplayMode_PlaceFilter": {
    "mechanism": "Adds a new display mode for filtering translated content in places.",
    "purpose": "Makes it easier for players to find translated items in the game."
  },
  "FFlagDynamicTranslationAlwaysRetranslate": {
    "mechanism": "Forces the game to retranslate text dynamically whenever it changes.",
    "purpose": "Ensures players always see the most up-to-date translations."
  },
  "DFFlagEnableContentTypeInRegister_Staged": {
    "mechanism": "Allows content types to be registered in a staged environment.",
    "purpose": "Facilitates better content management and organization for developers."
  },
  "FFlagLuaAppScrollableDesktopCarousels2_Staged": {
    "mechanism": "Enables a new layout for carousels on desktop that allows scrolling.",
    "purpose": "Improves user experience by making it easier to browse items in a carousel format."
  },
  "FFlagAXPrefetchMarketplaceIXP2": {
    "mechanism": "Optimizes the loading of marketplace assets by prefetching data.",
    "purpose": "Reduces loading times for players when accessing the marketplace, making it faster to find and purchase items."
  },
  "FFlagRenderParticlesSimulateNonVisible6": {
    "mechanism": "Enhances particle effects rendering even when they are not visible on screen.",
    "purpose": "Improves the visual quality of games by ensuring particle effects are consistent, even if players can't see them directly."
  },
  "DFFlagProcessStatisticsMemoryFix": {
    "mechanism": "Addresses memory usage issues in the statistics processing system.",
    "purpose": "Enhances game performance by reducing memory-related problems, leading to a smoother gameplay experience."
  }
}