{
  "FFlagReportVendorDeviceDriverToTelemetry": {
    "mechanism": "Sends information about device drivers to Roblox's telemetry system.",
    "purpose": "Helps improve game performance by understanding player hardware better."
  },
  "FFlagReverseLocalMuteOverwrite": {
    "mechanism": "Changes how local muting of players is handled in the game.",
    "purpose": "Allows players to have better control over their audio experience."
  },
  "FFlagRobloxTelemetryEnableHttpSignals": {
    "mechanism": "Enables the use of HTTP signals for collecting data about game performance.",
    "purpose": "Improves the ability to track and fix issues in games based on real-time data."
  },
  "FFlagEnableAdsLifecycleManager_Staged": {
    "mechanism": "Implements a system to manage the lifecycle of ads in a staged manner.",
    "purpose": "Enhances the ad experience for players, making it smoother and more relevant."
  },
  "FFlagStudioDeviceEmulatorDisplaySizeInitialization": {
    "mechanism": "Sets up the display size for device emulators in Roblox Studio.",
    "purpose": "Helps developers test their games more accurately on different device sizes."
  },
  "FFlagShowVerifiedBadgeInNewChat": {
    "mechanism": "Displays a verified badge next to usernames in the new chat system.",
    "purpose": "Helps players identify verified users, enhancing trust and community engagement."
  },
  "FFlagTouchscreenUseTabTipKeyboardPCGDKOnly_Staged": {
    "mechanism": "Enables a specific touchscreen keyboard feature for PC users with certain configurations.",
    "purpose": "Improves typing experience on touchscreen devices for players using compatible setups."
  },
  "FFlagLuaAppShowSponsoredTooltipOnConsole_Staged": {
    "mechanism": "Shows a tooltip for sponsored content in the console version of the app.",
    "purpose": "Informs players about sponsored items or events, increasing visibility and engagement."
  },
  "FFlagRenderFixParticleDegenCrossProduct": {
    "mechanism": "Fixes rendering issues related to particle effects in the game engine.",
    "purpose": "Enhances visual quality of particle effects, making the game look better for players."
  },
  "FFlagFFlagFixNewAudioAPIEcho": {
    "mechanism": "Addresses echo issues in the new audio API used for sound playback.",
    "purpose": "Improves audio clarity and experience for players by reducing unwanted echoes."
  },
  "FFlagEnableWarmStartMilestoneV2_Staged": {
    "mechanism": "Allows the game to preload certain data to improve startup times.",
    "purpose": "Players experience faster loading times when starting the game."
  },
  "FFlagUIMetricsSendUISOnRenderStep": {
    "mechanism": "Sends user interface performance data during each frame render.",
    "purpose": "Helps developers optimize UI performance for smoother gameplay."
  },
  "FFlagRbxStorageCheckFailedWriteId_Staged": {
    "mechanism": "Checks for errors when writing data to storage and logs failures.",
    "purpose": "Improves data reliability, ensuring players' progress is saved correctly."
  },
  "FFlagRbxStorageCheckFailedWriteId": {
    "mechanism": "Similar to the staged version but may be fully implemented.",
    "purpose": "Enhances the stability of data storage, benefiting players by reducing data loss."
  },
  "DFIntErrorEstimationArbiterThreshold2dtThou": {
    "mechanism": "Sets a threshold for estimating errors in data processing.",
    "purpose": "Helps maintain game performance by managing error rates effectively."
  },
  "FFlagSTUDIOPLAT_37160_ReportInstanceCountOnUserActions": {
    "mechanism": "Tracks the number of instances created or modified during user actions.",
    "purpose": "Helps developers understand how many objects are being used, improving performance and user experience."
  },
  "DFFlagReportAvatarAssetNetworkingTime3": {
    "mechanism": "Measures the time taken to load avatar assets over the network.",
    "purpose": "Improves avatar loading times, making the game experience smoother for players."
  },
  "FFlagLuauVectorDefinitionsExtra": {
    "mechanism": "Enhances the definition of vector types in the Luau programming language.",
    "purpose": "Allows developers to create more complex and efficient scripts, leading to better gameplay features."
  },
  "FFlagRefactorTileTextHeights": {
    "mechanism": "Adjusts how text heights are calculated for tiles in the game.",
    "purpose": "Ensures text displays correctly on tiles, improving readability and aesthetics for players."
  },
  "FFlagInternalExportUse16uForJointIndexes": {
    "mechanism": "Changes how joint indexes are exported in 16-bit format.",
    "purpose": "Optimizes the performance of character models, leading to smoother animations for players."
  },
  "FFlagDisableRibbonUpdatesDuringPlaceOpen": {
    "mechanism": "Prevents the user interface from updating while a game is being edited.",
    "purpose": "Improves performance and reduces distractions while working on a game."
  },
  "FFlagProductInfoBatchingCoalescingEnabled_Staged": {
    "mechanism": "Groups multiple product information requests to reduce server load.",
    "purpose": "Speeds up the loading of product details for players, making the experience smoother."
  },
  "FFlagSimEnableEditableNewGetter": {
    "mechanism": "Allows new methods for retrieving editable game data.",
    "purpose": "Gives developers more flexibility and control over game elements."
  },
  "FFlagSquadEnabled": {
    "mechanism": "Activates a feature that allows players to form squads with friends.",
    "purpose": "Enhances social gameplay by enabling team-based play with friends."
  },
  "FFlagUseCaptureForStudio": {
    "mechanism": "Implements a new method for capturing game data in the development environment.",
    "purpose": "Improves the efficiency of testing and debugging games for developers."
  },
  "FFlagSQLiteCacheUseEpochTime_Staged": {
    "mechanism": "Uses epoch time for caching data in SQLite databases.",
    "purpose": "Improves data retrieval speed and efficiency."
  },
  "DFFlagWrapDeformerReportTelemetryStat3": {
    "mechanism": "Enhances telemetry reporting for deformer statistics.",
    "purpose": "Provides better insights into game performance for developers."
  },
  "FFlagPinStreamingSignals": {
    "mechanism": "Pins streaming signals for more reliable data transmission.",
    "purpose": "Ensures smoother gameplay by reducing lag during streaming."
  },
  "FFlagRemoveLegacyLockInPackagePublish": {
    "mechanism": "Eliminates outdated locking mechanisms during package publishing.",
    "purpose": "Streamlines the publishing process for developers."
  },
  "FFlagFixJumpingEmptyPage": {
    "mechanism": "Fixes an issue where players could jump on an empty page.",
    "purpose": "Enhances player experience by preventing unexpected behavior."
  },
  "FFlagAudioPlayerStopReplicatingAssetId": {
    "mechanism": "Stops sending the asset ID of audio players to clients.",
    "purpose": "Improves performance by reducing unnecessary data transfer."
  },
  "FFlagRemovePSMLConversationalAIWidget2": {
    "mechanism": "Removes a specific conversational AI widget from the platform.",
    "purpose": "Simplifies the user interface for a better experience."
  },
  "FFlagIEMFocusNavToButtons": {
    "mechanism": "Changes how navigation focuses on buttons in the interface.",
    "purpose": "Enhances accessibility for users navigating with keyboards."
  },
  "DFFlagBanningEnabledProp": {
    "mechanism": "Introduces a property to enable or disable banning features.",
    "purpose": "Allows for better moderation and control over player behavior."
  },
  "FFlagDiscoverabilityOverlayAmpUpsellFixEnabled": {
    "mechanism": "Fixes issues with the overlay that promotes discoverability features.",
    "purpose": "Improves how players find new games and experiences on the platform."
  },
  "FFlagNoDynamicCastInResizableTooltipWidget": {
    "mechanism": "Prevents dynamic casting in a specific tooltip widget to improve performance.",
    "purpose": "Makes tooltips load faster and more reliably for players."
  },
  "FFlagEditableMeshKDTree5_Staged": {
    "mechanism": "Implements a new version of a data structure for better mesh handling.",
    "purpose": "Allows for smoother and more efficient rendering of 3D models in games."
  },
  "FFlagStudioShowNoninsertableClassesInObjectBrowser": {
    "mechanism": "Displays all classes in the object browser, even those that can't be inserted directly.",
    "purpose": "Helps developers find and understand more game components while building."
  },
  "FStringFlagRepoGitHashFastString": {
    "mechanism": "Uses a fast string representation for Git hash values.",
    "purpose": "Improves the speed of version tracking and updates for developers."
  },
  "FFlagCLI_109567": {
    "mechanism": "Enables a specific command-line interface feature for developers.",
    "purpose": "Enhances the tools available for developers to manage their games more effectively."
  },
  "DFFlagUseNewPhysicsMeshDecoderForLegacyMassData_Staged": {
    "mechanism": "Switches to a new method for decoding mass data in physics meshes.",
    "purpose": "Improves the accuracy of how objects behave in the game, making physics interactions more realistic."
  },
  "DFFlagFixMigrateAvatarTelemetryToDurationLogger": {
    "mechanism": "Updates the way avatar data is tracked by using a more reliable logging system.",
    "purpose": "Enhances the tracking of player avatars, leading to better performance and fewer bugs related to avatar behavior."
  },
  "FFlagPhysicalPropertiesRBXArrayToStdArray": {
    "mechanism": "Converts physical property data storage from a Roblox-specific format to a standard array format.",
    "purpose": "Increases efficiency and compatibility in handling physical properties, resulting in smoother gameplay."
  },
  "FFlagAudioSpeechToTextEnableVadAudioLookback": {
    "mechanism": "Enables a feature that allows audio processing to look back at previous audio for better speech recognition.",
    "purpose": "Improves voice chat clarity and responsiveness, making communication between players more effective."
  },
  "DFFlagBoxContainsUseDotProducts": {
    "mechanism": "Implements dot product calculations to determine if a box contains a point more efficiently.",
    "purpose": "Enhances the performance of collision detection, leading to a more responsive gaming experience."
  },
  "FFlagContentProviderMoveMcpSignalToMcp": {
    "mechanism": "Moves the signal handling for content loading to a more efficient system.",
    "purpose": "Improves the speed and reliability of loading game content."
  },
  "FFlagMPLabelSpace": {
    "mechanism": "Adjusts the spacing in multiplayer labels for better visibility.",
    "purpose": "Enhances the clarity of player names and information in multiplayer games."
  },
  "FFlagFindReplaceAllCapEscapedStringLength_Staged": {
    "mechanism": "Updates the method for calculating string lengths in find-and-replace functions.",
    "purpose": "Ensures more accurate text handling, reducing errors in scripts."
  },
  "FFlagInsertObjectModelOptimizations": {
    "mechanism": "Optimizes the process of inserting objects into the game.",
    "purpose": "Makes adding new items to games faster and smoother for developers."
  },
  "FFlagWindowsAppBuildVariant": {
    "mechanism": "Introduces a different version of the Roblox app for Windows users.",
    "purpose": "Provides enhanced performance and features for players using Windows."
  },
  "FFlagLuauCodeGenVBlendpdReorder_Staged": {
    "mechanism": "Improves the order of operations in code generation for Luau scripts.",
    "purpose": "Enhances script performance and efficiency for developers."
  },
  "FFlagPreferredInputFilter_Staged": {
    "mechanism": "Introduces a system to prioritize certain input methods for user interactions.",
    "purpose": "Provides a smoother and more responsive gameplay experience for players."
  },
  "FFlagCheckNullDataModelOnTeleport": {
    "mechanism": "Validates the data model before a player is teleported to ensure it is not empty.",
    "purpose": "Prevents errors and ensures a seamless transition between game areas for players."
  },
  "FFlagStudioBackgroundLogCulling": {
    "mechanism": "Reduces the amount of background logging in the development studio.",
    "purpose": "Improves performance and responsiveness of the Roblox Studio for developers."
  },
  "FFlagRemovePSMLUpdateUIManager": {
    "mechanism": "Disables a specific UI management system related to updates.",
    "purpose": "Streamlines the user interface for a better experience during game updates."
  },
  "FFlagUseNewDiscoverabilityModal_Staged": {
    "mechanism": "Introduces a new interface for discovering games and experiences.",
    "purpose": "Helps players find new games more easily and improves their overall experience."
  },
  "FFlagRemoveStaleChildConnections_Staged": {
    "mechanism": "Cleans up outdated connections between game elements to optimize performance.",
    "purpose": "Enhances game stability and reduces lag for players."
  },
  "FFlagDisableChromeFollowupUnibar": {
    "mechanism": "Disables a specific browser feature that affects how the game is displayed.",
    "purpose": "Improves the visual experience for players using Chrome."
  },
  "FFlagDragDetectorUsesPermissionPolicyRevised3": {
    "mechanism": "Updates the way drag-and-drop interactions are handled in games.",
    "purpose": "Makes dragging items smoother and more intuitive for players."
  },
  "FFlagSQLiteSkipPageSize": {
    "mechanism": "Optimizes database queries by skipping unnecessary page size settings.",
    "purpose": "Improves game loading times and responsiveness for players."
  },
  "DFFlagLogSecurityTimeout": {
    "mechanism": "Sets a time limit for security logs to expire.",
    "purpose": "Improves security by ensuring old logs are removed, making it easier to track recent activities."
  },
  "FFlagACERenameClip": {
    "mechanism": "Allows clips in animations to be renamed for better organization.",
    "purpose": "Helps creators manage their animations more effectively, making it easier to find and edit specific clips."
  },
  "FFlagCollectionServiceFixNameOverlap2": {
    "mechanism": "Fixes issues with naming conflicts in the CollectionService.",
    "purpose": "Ensures that different objects can be identified correctly, improving game performance and reliability."
  },
  "DFFlagSimSolidMeshSmoothingAngle": {
    "mechanism": "Adjusts the angle at which mesh smoothing is applied to solid meshes.",
    "purpose": "Enhances the visual quality of solid objects in games, making them look smoother and more realistic."
  },
  "DFFlagCDCTestsReportFailingDecomps": {
    "mechanism": "Improves reporting for tests that fail during decomposition processes.",
    "purpose": "Helps developers identify and fix issues faster, leading to more stable and reliable game updates."
  },
  "FFlagAXSlotsDesktopCrashFix": {
    "mechanism": "Fixes a bug that caused the game to crash when using certain slots on desktop.",
    "purpose": "Improves game stability for desktop players."
  },
  "DFFlagCLI170264_Staged": {
    "mechanism": "Enables a new command line interface feature in a staged rollout.",
    "purpose": "Provides players with enhanced tools for game development."
  },
  "DFFlagSimMatrixAllocateAlignedOrCrash": {
    "mechanism": "Resolves an issue with memory allocation in simulations to prevent crashes.",
    "purpose": "Ensures smoother gameplay and fewer crashes during simulations."
  },
  "FFlagPostLaunchUnibarDesignTweaks": {
    "mechanism": "Implements design adjustments to the user interface after the initial launch.",
    "purpose": "Enhances the visual experience and usability of the interface for players."
  },
  "FFlagVisBugFixSpecialMeshScale": {
    "mechanism": "Fixes a visual bug affecting the scaling of special meshes in the game.",
    "purpose": "Improves the appearance of objects, making them look better in-game."
  },
  "DFFlagUseGeomBoxSAT": {
    "mechanism": "Uses a geometric box-based method for collision detection.",
    "purpose": "Improves the accuracy of object interactions in games."
  },
  "DFFlagFastCFrame_Staged": {
    "mechanism": "Optimizes the way CFrame (coordinate frame) calculations are processed.",
    "purpose": "Enhances game performance and reduces lag during movement."
  },
  "FFlagEnableAudioTremolo": {
    "mechanism": "Adds a modulation effect to audio playback.",
    "purpose": "Creates a richer and more dynamic sound experience for players."
  },
  "DFFlagMicroprofilerOutput2": {
    "mechanism": "Provides detailed performance metrics for developers.",
    "purpose": "Helps developers optimize their games for better player experiences."
  },
  "FFlagViewportDisplaySizeAPI2BetaFeature": {
    "mechanism": "Introduces a new API for managing viewport sizes in games.",
    "purpose": "Allows for better control of how game visuals are displayed on different devices."
  },
  "DFIntErrorEstimationArbiterC6": {
    "mechanism": "Improves error estimation in data processing.",
    "purpose": "Helps ensure smoother gameplay by reducing bugs related to data handling."
  },
  "DFFlagUseNewPhysicsMeshDecoderForAero": {
    "mechanism": "Switches to a new method for decoding physics meshes.",
    "purpose": "Enhances the realism and performance of aerodynamic objects in the game."
  },
  "FFlagLayoutNodeFlexRefactor6": {
    "mechanism": "Refines the layout system for UI elements.",
    "purpose": "Makes user interfaces more responsive and visually appealing."
  },
  "FFlagLuauUserTypeFunFixInner": {
    "mechanism": "Fixes issues with user-defined types in the Luau scripting language.",
    "purpose": "Improves scripting reliability, allowing developers to create better game features."
  },
  "DFFlagIntegrityCheckedProcessorFixRefactor": {
    "mechanism": "Enhances the integrity checks in data processing.",
    "purpose": "Increases overall game stability and reduces crashes or errors."
  },
  "DFFlagFixEmptyKick": {
    "mechanism": "Fixes a bug that causes players to be kicked from games without a reason.",
    "purpose": "Ensures players stay in the game without unexpected disconnections."
  },
  "FFlagVideoCaptureEngineThreadSafeAudioEncoder_Staged": {
    "mechanism": "Implements a safer way to handle audio during video capture.",
    "purpose": "Improves the quality and reliability of videos recorded in Roblox."
  },
  "DFFlagSolverV2NoModelModeChangesFromNonWorkspaceContainer_Staged": {
    "mechanism": "Prevents changes in model behavior when moved outside the main game area.",
    "purpose": "Ensures consistent gameplay and model interactions regardless of their location."
  },
  "FFlagRemoveUnusedAccountInfoRequest": {
    "mechanism": "Eliminates unnecessary requests for account information that aren't used.",
    "purpose": "Reduces lag and improves performance for players by streamlining data requests."
  },
  "FFlagSimControllerManagerSafetyImprovements": {
    "mechanism": "Enhances safety measures in the simulation controller system.",
    "purpose": "Provides a more stable and secure experience for players using simulation features."
  },
  "FFlagFixContactRecsFriendRequestLogging_v2": {
    "mechanism": "Improves the logging system for friend requests in contact recommendations.",
    "purpose": "Helps players see more accurate friend request histories."
  },
  "FFlagConvAINullPtrCheckGetLatestMessage": {
    "mechanism": "Adds a check to prevent errors when retrieving the latest message in conversations.",
    "purpose": "Ensures players have a smoother messaging experience without crashes."
  },
  "FFlagISRCacheDirtyRootToMembers_Staged": {
    "mechanism": "Updates how cached data is managed for better performance.",
    "purpose": "Enhances game loading times and responsiveness for players."
  },
  "DFFlagConvexDecompCompressionAnalytics": {
    "mechanism": "Implements analytics for the compression of complex shapes in games.",
    "purpose": "Improves game performance by optimizing how shapes are handled."
  },
  "DFFlagSimEditableFixedMemoryFunctionHandling": {
    "mechanism": "Refines memory management for editable functions in simulations.",
    "purpose": "Provides a more stable and efficient gameplay experience for users."
  },
  "FFlagExplorerExposeDoubleClick_Staged": {
    "mechanism": "Allows double-clicking on items in the Explorer panel to open them directly.",
    "purpose": "Makes it easier for developers to quickly access and edit items in their game."
  },
  "FFlagCapsAtomicClass": {
    "mechanism": "Introduces a new class system that handles data more efficiently.",
    "purpose": "Improves game performance and stability, leading to a smoother experience for players."
  },
  "FFlagEnableMmapForMemProfStorageFlushing3": {
    "mechanism": "Uses memory mapping for better management of memory storage during profiling.",
    "purpose": "Helps developers optimize their games by providing more accurate memory usage data."
  },
  "FFlagAXHidePBRInfoRowOnAnimatedBudles_Staged": {
    "mechanism": "Hides specific information about physically based rendering on animated bundles.",
    "purpose": "Simplifies the interface for developers working with animated assets, reducing confusion."
  },
  "FFlagInExperienceSettingsRefactorAnalytics": {
    "mechanism": "Reorganizes how analytics data is collected in experience settings.",
    "purpose": "Enhances the ability for developers to analyze player behavior and improve their games."
  },
  "FFlagStudioDisambiguatePluginShortcuts": {
    "mechanism": "Improves shortcut handling for plugins in the studio environment.",
    "purpose": "Helps users easily identify and use plugin shortcuts without confusion."
  },
  "FFlagStudioTaskRegistryPinpointing": {
    "mechanism": "Enhances task management by allowing precise tracking of tasks in the studio.",
    "purpose": "Makes it easier for developers to manage and organize their work efficiently."
  },
  "FFlagLuauCodeGenArithOpt": {
    "mechanism": "Optimizes arithmetic operations in Luau code generation.",
    "purpose": "Improves performance of scripts, making games run smoother."
  },
  "FFlagUGCValidationRequiredFolderContext2": {
    "mechanism": "Enforces validation checks for user-generated content in specific folder contexts.",
    "purpose": "Ensures higher quality and safety of user-created items in the platform."
  },
  "FFlagAXUnifiedSubsetOfLook_Staged": {
    "mechanism": "Consolidates visual styles for a unified look across different elements.",
    "purpose": "Provides a more cohesive and visually appealing experience for players."
  },
  "FFlagLuauUserTypeFunPrintToError": {
    "mechanism": "Enables detailed error messages for user types in Luau scripts.",
    "purpose": "Helps developers quickly identify and fix issues in their code."
  },
  "FFlagSharedMutexSemaphoreImpl2": {
    "mechanism": "Implements a more efficient way to manage shared resources in the game engine.",
    "purpose": "Improves game performance and stability, leading to a smoother experience for players."
  },
  "FFlagRegisterContentType": {
    "mechanism": "Allows new types of content to be registered within the platform.",
    "purpose": "Enables more diverse and engaging content for players to enjoy."
  },
  "FFlagAXSlotsScrollAway2_Staged": {
    "mechanism": "Implements a new method for scrolling through UI slots in a staged manner.",
    "purpose": "Enhances user interface interactions, making it easier for players to navigate options."
  },
  "FFlagVoiceChatEnqueueClientJoinOperation2": {
    "mechanism": "Optimizes how voice chat connections are managed when players join.",
    "purpose": "Provides a more reliable voice chat experience for players during gameplay."
  },
  "FFlagStudioContextExpressionTypes3": {
    "mechanism": "Updates the way expressions are handled in the Studio context for better performance.",
    "purpose": "Improves the development experience by allowing creators to use expressions more efficiently."
  },
  "FFlagEditableImageTelemetryUpdates": {
    "mechanism": "Enhances the tracking and reporting of image edits in the system.",
    "purpose": "Provides creators with better insights on how their images are used and edited."
  },
  "DFIntWebSocketConnectResultPointsHundredthsPercent": {
    "mechanism": "Refines the connection results of WebSocket to include more precise percentage points.",
    "purpose": "Improves the reliability of online connections, leading to a smoother gameplay experience."
  },
  "FFlagVideoCaptureLowResOnLowMemDevices_IXP": {
    "mechanism": "Allows video capture to operate at lower resolutions on devices with limited memory.",
    "purpose": "Enables more players to capture gameplay videos without performance issues on older or less powerful devices."
  },
  "DFFlagDeviceErrorConstructionFix": {
    "mechanism": "Fixes issues related to how device errors are constructed and reported.",
    "purpose": "Reduces the occurrence of errors, leading to a more stable and enjoyable gaming experience."
  },
  "FFlagComponentManagerImproveValidation_Staged": {
    "mechanism": "Enhances the validation process for components in the game engine.",
    "purpose": "Improves the stability and reliability of game components, leading to a smoother gameplay experience."
  },
  "FFlagFixVRDisconnecRestartIssue": {
    "mechanism": "Addresses a bug that caused VR sessions to restart unexpectedly when disconnected.",
    "purpose": "Ensures a more stable VR experience, allowing players to enjoy uninterrupted gameplay."
  },
  "FFlagHDSubInstancesUseHDIcon": {
    "mechanism": "Changes the icons for high-definition sub-instances to be more visually appealing.",
    "purpose": "Enhances the visual experience for players by providing clearer and more attractive icons."
  },
  "FFlagLayoutNodeGetSharedInstanceB": {
    "mechanism": "Improves the way layout nodes share instances within the game engine.",
    "purpose": "Optimizes layout management, resulting in better performance and faster loading times for players."
  },
  "DFFlagSimDisableEditableMeshCreateMeshPartAsync": {
    "mechanism": "Disables the asynchronous creation of editable mesh parts in simulations.",
    "purpose": "Prevents potential issues with mesh parts, ensuring a more stable and reliable building experience for players."
  },
  "FFlagVisBugFixSingleton": {
    "mechanism": "Fixes a visual bug by ensuring only one instance of a visual element is created.",
    "purpose": "Improves the appearance of the game by eliminating duplicate visuals."
  },
  "FFlagInternalExportUse16uForJointIndexes_Staged": {
    "mechanism": "Changes how joint indexes are exported to a 16-bit format for better efficiency.",
    "purpose": "Enhances performance and stability in animations and character movements."
  },
  "FFlagEnablePartyTabNumberedBadge3_Staged": {
    "mechanism": "Adds a numbered badge to the party tab for better organization.",
    "purpose": "Helps players quickly identify and manage their party members."
  },
  "FFlagGuiImageOnlyVerifySliceCenterWhenSliceScaleType": {
    "mechanism": "Optimizes image processing by checking slice center only when necessary.",
    "purpose": "Improves loading times and performance for GUI images."
  },
  "FFlagEnablePartyNudgeNotification3": {
    "mechanism": "Introduces a notification system that nudges players about party activities.",
    "purpose": "Keeps players informed and engaged with their party events."
  },
  "FFlagEnableAudioDuckingAroundRewardedVideoAds3": {
    "mechanism": "Reduces background audio volume when rewarded video ads play.",
    "purpose": "Enhances player experience by making ads less intrusive."
  },
  "DFFlagVisBugFixPartUpdatedLock": {
    "mechanism": "Fixes a visual bug related to locking parts in the game.",
    "purpose": "Improves game stability and visual accuracy for players."
  },
  "FFlagRenderFixParticleDegenCrossProduct_Staged": {
    "mechanism": "Addresses rendering issues with particle effects.",
    "purpose": "Ensures smoother and more visually appealing particle effects in games."
  },
  "DFFlagParallelGcSpawnWhenHasWork_Staged": {
    "mechanism": "Optimizes garbage collection by running it in parallel when needed.",
    "purpose": "Improves game performance and reduces lag for players."
  },
  "EnableGmaSdkOperationTimeouts": {
    "mechanism": "N/A (invalid)",
    "purpose": "N/A (invalid)"
  },
  "FFlagLuauUserTypeFunNoExtraConstraint": {
    "mechanism": "Removes additional restrictions on user types in Luau scripting.",
    "purpose": "Allows more flexibility for developers when scripting, enhancing creativity."
  },
  "FFlagAvatarAutosetupOptionsInput_Staged": {
    "mechanism": "Implements a staged process for setting up avatar options automatically.",
    "purpose": "Streamlines the avatar customization process for players, making it easier to personalize their characters."
  },
  "FFlagTextChannelDirectChatRequesterImpl": {
    "mechanism": "Enables direct chat requests in text channels.",
    "purpose": "Improves communication between players in chat, making interactions smoother."
  },
  "FFlagExplorerExposeDoubleClick": {
    "mechanism": "Allows double-click actions to be recognized in the Explorer panel.",
    "purpose": "Enhances usability for developers by making it easier to navigate and manage game elements."
  },
  "FFlagFixBubblesOutofOrderWhenZoomedIn": {
    "mechanism": "Corrects the display order of chat bubbles when the camera is zoomed in.",
    "purpose": "Ensures that chat messages appear in the correct order, improving the clarity of conversations."
  },
  "FFlagCIAmpUpsellEnabledForAll_v1": {
    "mechanism": "Enables a feature that prompts players to purchase upgrades more frequently.",
    "purpose": "Increases opportunities for players to enhance their gameplay experience through purchases."
  },
  "DFFlagDetectPatchOOM": {
    "mechanism": "Implements a system to identify and handle out-of-memory errors more effectively.",
    "purpose": "Improves game stability by preventing crashes due to memory issues."
  },
  "FFlagAXItemCardTallEnabled3": {
    "mechanism": "Activates a new design for item cards that allows for taller layouts.",
    "purpose": "Enhances the visual presentation of items, making them more appealing to players."
  },
  "FFlagSessionRemoveJYFSessionsOnGameLeave": {
    "mechanism": "Removes certain session data when a player leaves a game.",
    "purpose": "Cleans up data to improve performance and reduce clutter in player sessions."
  },
  "DFFlagConvexDecompInertiaDataValidation": {
    "mechanism": "Adds checks to ensure that physics data for objects is accurate during simulations.",
    "purpose": "Enhances the realism and reliability of physics interactions in games."
  },
  "DFFlagFixReportDropPktStats": {
    "mechanism": "Fixes how dropped packet statistics are reported in the game.",
    "purpose": "Improves the accuracy of network performance data for players."
  },
  "FFlagLuaAppAddFriendIdToGamePlayIntentEvents": {
    "mechanism": "Adds friend IDs to gameplay events for tracking.",
    "purpose": "Enhances social features by allowing better tracking of friend interactions."
  },
  "FFlagGateSearchLandingPageOnVR": {
    "mechanism": "Enables a specific landing page for VR users in search.",
    "purpose": "Provides a tailored experience for VR players when searching for games."
  },
  "FFlagSurfaceControllerUseDMLock": {
    "mechanism": "Implements a locking mechanism for surface controllers.",
    "purpose": "Ensures smoother gameplay by preventing conflicts in surface interactions."
  },
  "FFlagRefactorGenericAbuseReporting": {
    "mechanism": "Reworks the system for reporting abuse in a more efficient way.",
    "purpose": "Makes it easier for players to report inappropriate behavior and improves community safety."
  },
  "DFFlagEnableGetUsersPriceLevelsApi_Staged": {
    "mechanism": "Enables a new API to retrieve user price levels for items.",
    "purpose": "Allows developers to access and display user-specific pricing information for better customization."
  },
  "DFFlagSimSolverAlwaysCollectNumericalExplosions": {
    "mechanism": "Ensures that numerical data from simulations is always gathered, even during complex calculations.",
    "purpose": "Improves the accuracy of game physics and simulations, leading to a smoother gameplay experience."
  },
  "FFlagTextureGeneratorAddFeedback": {
    "mechanism": "Adds a feedback system to the texture generation process.",
    "purpose": "Helps developers understand and improve the quality of textures used in their games."
  },
  "FFlagAssetImportUseTextureBackupChecks": {
    "mechanism": "Implements checks for backup textures during asset import.",
    "purpose": "Prevents issues with missing textures, ensuring that imported assets look as intended."
  },
  "FFlagDraggerHandleTracking2": {
    "mechanism": "Enhances the tracking of dragger handles for better precision.",
    "purpose": "Provides developers with more control and accuracy when positioning objects in their games."
  },
  "FFlagLuauCompileLibraryConstants": {
    "mechanism": "Enables the use of constant values in Luau scripts to improve performance.",
    "purpose": "Makes scripts run faster and more efficiently for better gameplay."
  },
  "DFIntConvexDecompBadDecompReportingHundredthsPercentage": {
    "mechanism": "Improves the accuracy of reporting errors during shape decomposition in games.",
    "purpose": "Helps developers identify and fix issues more effectively, leading to smoother gameplay."
  },
  "FFlagRibbonConfigBetterErrorHandling": {
    "mechanism": "Enhances error handling in the ribbon configuration system.",
    "purpose": "Reduces crashes and improves stability, providing a better experience for players."
  },
  "FFlagSurfaceAppearanceTinting3_PlaceFilter": {
    "mechanism": "Introduces a new filtering method for surface appearance tinting in places.",
    "purpose": "Allows for more vibrant and customizable visuals, enhancing the game's look."
  },
  "DFIntWebSocketDisconnectPointsHundredthsPercent": {
    "mechanism": "Adjusts the threshold for disconnect points in WebSocket connections.",
    "purpose": "Improves connection stability, reducing lag and disconnections during gameplay."
  },
  "FFlagToolboxFixCreatorStoreUrl_Staged": {
    "mechanism": "Fixes the URL links in the toolbox for creators.",
    "purpose": "Ensures creators can easily access their store links from the toolbox."
  },
  "FFlagSQLiteSkipPageSize_Staged": {
    "mechanism": "Optimizes database queries by skipping unnecessary page size settings.",
    "purpose": "Improves performance and speed of data retrieval for players."
  },
  "FFlagFlagRolloutTestStaticBool49_Staged": {
    "mechanism": "Tests a specific feature flag for a static boolean value.",
    "purpose": "Allows developers to experiment with new features without affecting all players."
  },
  "FFlagVideoCaptureEngineThreadSafeAudioEncoder": {
    "mechanism": "Enhances the audio encoding process to be safe for multi-threading.",
    "purpose": "Improves video capture quality and reliability for players recording gameplay."
  },
  "DFFlagRbxStorageFixEmptyPath": {
    "mechanism": "Fixes issues related to empty paths in storage systems.",
    "purpose": "Ensures smoother and more reliable data storage for player assets."
  },
  "FFlagFixDuplicateBubblesWithChatChat": {
    "mechanism": "Prevents multiple chat bubbles from appearing for the same message.",
    "purpose": "Reduces clutter in the chat interface, making conversations clearer."
  },
  "DFFlagAnimationUseHandleIterators_Staged": {
    "mechanism": "Implements a new method for handling animations more efficiently.",
    "purpose": "Improves animation performance, leading to smoother gameplay."
  },
  "FFlagAXExtendUndoRedoTracking_Staged": {
    "mechanism": "Enhances the tracking system for undo and redo actions in the game editor.",
    "purpose": "Allows players to easily revert changes, making game development more user-friendly."
  },
  "FFlagBlockRibbonUpdateInPlaySoloLoad": {
    "mechanism": "Stops updates to the ribbon interface during solo play loading.",
    "purpose": "Ensures a more stable and uninterrupted loading experience for players."
  },
  "FFlagRegisterTypeDefsByFile": {
    "mechanism": "Organizes type definitions based on file structure for better management.",
    "purpose": "Improves the clarity and organization of code, benefiting developers working on games."
  },
  "FFlagEnableRobuxPageUseStyleMetadata": {
    "mechanism": "Updates the Robux page to use new styling metadata for better visual consistency.",
    "purpose": "Improves the appearance and user experience of the Robux purchasing page."
  },
  "FFlagLuaAppFixNewMediaGalleryFocus_Staged": {
    "mechanism": "Fixes focus issues in the media gallery within the Lua app, ensuring elements are properly highlighted.",
    "purpose": "Enhances navigation and usability in the media gallery for a smoother experience."
  },
  "FFlagStudioActionsManagedUtil": {
    "mechanism": "Implements a new utility for managing actions within Roblox Studio more effectively.",
    "purpose": "Streamlines workflows for developers in Roblox Studio, making it easier to manage tasks."
  },
  "FFlagEnableCommerceLuaFlow": {
    "mechanism": "Activates a new Lua-based flow for handling commerce transactions within the platform.",
    "purpose": "Provides a more efficient and reliable way for players to make purchases and transactions."
  },
  "FFlagEditableImageSupportWebP": {
    "mechanism": "Adds support for WebP images, allowing them to be edited and used within Roblox.",
    "purpose": "Enables players to use more modern image formats, improving image quality and loading times."
  },
  "FFlagContactImporterErrorImage": {
    "mechanism": "Displays a specific error image when contact import fails.",
    "purpose": "Helps users understand when there is an issue with importing contacts."
  },
  "DFFlagFastCFrame": {
    "mechanism": "Optimizes the way CFrame calculations are processed in the game engine.",
    "purpose": "Improves game performance and responsiveness for smoother gameplay."
  },
  "FFlagTextureGeneratorMuteSounds": {
    "mechanism": "Disables sound effects during the texture generation process.",
    "purpose": "Prevents disruptive noises while textures are being created, enhancing user experience."
  },
  "DFFlagEnableFullScreenWebview": {
    "mechanism": "Allows web content to be displayed in full-screen mode within the Roblox app.",
    "purpose": "Provides a better viewing experience for web-based features and content."
  },
  "FFlagWrapDeformerUpdateAttachments3": {
    "mechanism": "Updates how attachments are managed in character models during deformations.",
    "purpose": "Ensures character models look correct and function properly during animations."
  },
  "FFlagAudioSpeechToTextEnableResponseSequencing_Staged": {
    "mechanism": "Enables a system to process speech-to-text responses in a sequence.",
    "purpose": "Improves the accuracy and timing of voice commands for players."
  },
  "DFFlagUseSimdAabbTri": {
    "mechanism": "Utilizes SIMD (Single Instruction, Multiple Data) for faster collision detection.",
    "purpose": "Enhances game performance by making interactions smoother and more responsive."
  },
  "DFFlagVideoWinHwEncoderFlushAfterDrain": {
    "mechanism": "Flushes the video encoder after draining to ensure all data is processed.",
    "purpose": "Improves video streaming quality for players by reducing lag and buffering."
  },
  "FFlagLuauCodeGenFMA": {
    "mechanism": "Optimizes code generation for mathematical operations using Fused Multiply-Add.",
    "purpose": "Boosts game performance by speeding up calculations, leading to smoother gameplay."
  },
  "FFlagDisableFullscreenToastWhenNotPointer": {
    "mechanism": "Disables fullscreen notifications when the pointer is not active.",
    "purpose": "Reduces distractions for players by preventing unnecessary notifications during gameplay."
  },
  "FFlagVoiceChatOptimizeUserLeaveGetOrCreate": {
    "mechanism": "Improves how the system handles users leaving voice chat by optimizing the process of creating or retrieving user data.",
    "purpose": "Enhances the stability and performance of voice chat, making it smoother for players when someone leaves."
  },
  "FFlagDismissSquadNudgeToast": {
    "mechanism": "Disables the notification that prompts players to join squads.",
    "purpose": "Reduces interruptions for players by removing unwanted prompts about joining squads."
  },
  "DFFlagAnimationUseHandleIterators": {
    "mechanism": "Changes how animations are processed by using iterators for better performance.",
    "purpose": "Improves the efficiency of animations, leading to smoother gameplay experiences."
  },
  "FFlagRemovePSMLStudioDockPanelManager": {
    "mechanism": "Eliminates a specific management system for dock panels in the studio interface.",
    "purpose": "Simplifies the user interface for developers, making it easier to manage their workspace."
  },
  "FFlagUIFlexLayoutTrackFlexStatusOnParent2": {
    "mechanism": "Enables tracking of layout changes in flexible UI elements based on their parent containers.",
    "purpose": "Allows for more responsive and adaptable user interfaces, improving the overall player experience."
  },
  "FFlagADS6383": {
    "mechanism": "Enables a new advertising system within the platform.",
    "purpose": "Improves ad targeting and relevance for players, enhancing their experience."
  },
  "DFFlagFixMigrateAvatarTelemetryToDurationLogger2": {
    "mechanism": "Fixes the way avatar data is tracked and logged.",
    "purpose": "Ensures more accurate tracking of avatar usage, leading to better performance insights."
  },
  "FFlagDisableFullscreenToastWhenNotPointer_Staged": {
    "mechanism": "Disables fullscreen notifications when the pointer is not active.",
    "purpose": "Reduces interruptions for players, allowing for a smoother gameplay experience."
  },
  "DFFlagVideoWinHwEncoderFlushAfterDrain_Staged": {
    "mechanism": "Adjusts how video encoding is managed after data is processed.",
    "purpose": "Enhances video streaming quality for players, resulting in fewer interruptions."
  },
  "FFlagLuauUserTypeFunUpdateAllEnvs": {
    "mechanism": "Updates the user type system in the Luau scripting language.",
    "purpose": "Provides developers with better tools for creating diverse player experiences."
  },
  "FFlagContactImporterFixRedirectsFromSocialOnboardingBtns": {
    "mechanism": "Fixes the redirection process when users try to import contacts from social platforms.",
    "purpose": "Improves the experience of adding friends by ensuring users are directed correctly."
  },
  "FFlagRenderModelClusterEntityCulling": {
    "mechanism": "Optimizes rendering by not drawing models that are not visible to the player.",
    "purpose": "Enhances game performance and reduces lag by only showing what players can see."
  },
  "FFlagLuaAppFixEdpInitialFocus3_Staged": {
    "mechanism": "Corrects the focus behavior in the Lua application during the initial setup.",
    "purpose": "Ensures a smoother and more intuitive setup process for new users."
  },
  "FFlagAXColorAdjustmentBottomPaddingFix_Staged": {
    "mechanism": "Adjusts the bottom padding in color adjustment settings for better layout.",
    "purpose": "Provides a cleaner and more user-friendly interface for color adjustments."
  },
  "DFFlagEnableSessionEventsForEditableImage": {
    "mechanism": "Enables tracking of session events related to editable images.",
    "purpose": "Allows players to see changes and updates made to images in real-time."
  },
  "FFlagAssetAccessVerboseLogging": {
    "mechanism": "Enables detailed logging of asset access requests.",
    "purpose": "Helps developers track and debug asset usage more effectively."
  },
  "FFlagEditableImageMeshBetaFeature": {
    "mechanism": "Allows users to modify image meshes directly in the editor.",
    "purpose": "Gives creators more flexibility and control over their 3D models."
  },
  "DFFlagUseGeomBoxSAT_Staged": {
    "mechanism": "Implements a new method for collision detection using bounding boxes.",
    "purpose": "Improves game performance and accuracy in physics interactions."
  },
  "FFlagTypeInfoIncluded": {
    "mechanism": "Adds type information to scripts for better error checking.",
    "purpose": "Helps developers write more reliable code by catching errors early."
  },
  "DFFlagSimEditableIsFixedSizeFix": {
    "mechanism": "Adjusts the simulation settings for fixed-size objects.",
    "purpose": "Enhances the stability and predictability of object behavior in games."
  },
  "FFlagEditableMeshKDTree5": {
    "mechanism": "Improves the way 3D models are processed by using a more efficient data structure.",
    "purpose": "Enhances the performance of rendering complex meshes, leading to smoother gameplay."
  },
  "DFFlagSeparateCrashpadManagerFromApp": {
    "mechanism": "Separates crash reporting tools from the main application to improve stability.",
    "purpose": "Reduces crashes and improves overall app reliability for players."
  },
  "DFFlagPerformanceControlOnPlaceStart": {
    "mechanism": "Allows developers to set performance options when a game starts.",
    "purpose": "Optimizes game loading times and performance based on player devices."
  },
  "FFlagCapturesInExperienceFoundationProviderEnabled": {
    "mechanism": "Enables capturing gameplay data for better analytics.",
    "purpose": "Helps developers understand player behavior to improve game experiences."
  },
  "FFlagProductInfoBatchingCoalescingEnabled": {
    "mechanism": "Groups product information requests to reduce server load.",
    "purpose": "Speeds up the display of items in the game store for players."
  },
  "DFFlagRenderBeamSegmentAlphaFix_Staged": {
    "mechanism": "Fixes the transparency rendering of beam segments in the game engine.",
    "purpose": "Improves visual quality by ensuring beams appear correctly with the right transparency."
  },
  "FFlagFixInvalidMessagesShowingOnSenderSide": {
    "mechanism": "Corrects the display of error messages that appear to the sender of a message.",
    "purpose": "Enhances communication clarity by preventing misleading error messages for players."
  },
  "FFlagSimCSG3RejectNonArchivable": {
    "mechanism": "Prevents certain non-archivable objects from being processed in the simulation.",
    "purpose": "Optimizes performance by ensuring only relevant objects are included in simulations."
  },
  "DFFlagUsePhysicsMeshDecoderInBulletWrapper": {
    "mechanism": "Implements a new method for decoding physics meshes in bullet interactions.",
    "purpose": "Improves the accuracy and performance of physics interactions in the game."
  },
  "DFFlagSystemUtilAndroidReturnCorrect64BitCPU": {
    "mechanism": "Ensures the system correctly identifies 64-bit CPUs on Android devices.",
    "purpose": "Enhances compatibility and performance for players using 64-bit Android devices."
  },
  "FFlagExpChatEnableChannelTabsUI1010": {
    "mechanism": "Enables a new user interface for channel tabs in the chat system.",
    "purpose": "Improves organization and navigation of chat channels for players."
  },
  "DFFlagRbxStorageFixEmptyPath_Staged": {
    "mechanism": "Fixes issues related to empty paths in the storage system.",
    "purpose": "Enhances stability and reliability of data storage for players."
  },
  "FFlagUIMetricsSendUISOnRenderStep_Staged": {
    "mechanism": "Sends user interface metrics during the rendering step of the game.",
    "purpose": "Allows for better performance tracking and optimization of UI for players."
  },
  "FFlagMaterialPickerMaximizeRibbon": {
    "mechanism": "Expands the material picker interface to utilize more screen space.",
    "purpose": "Makes it easier for players to select materials while building."
  },
  "DFFlagCapsNewTooltipTexts": {
    "mechanism": "Updates tooltip texts to be more informative and user-friendly.",
    "purpose": "Provides clearer guidance and information to players when using features."
  },
  "FFlagInfoOverlayBackgroundColorFix": {
    "mechanism": "Adjusts the background color of info overlays to ensure consistency.",
    "purpose": "Improves readability and visual appeal of information displayed to players."
  },
  "DFFlagUseNewPhysicsMeshDecoderForAero_Staged": {
    "mechanism": "Switches to a new method for decoding physics meshes in the Aero system.",
    "purpose": "Enhances performance and stability of physics interactions in games."
  },
  "FFlagShareLinkV2FixInvalidModal": {
    "mechanism": "Fixes issues with the share link modal that caused it to display incorrectly.",
    "purpose": "Ensures players can easily share game links without errors."
  },
  "DFFlagFrameTimeJitterMedians2": {
    "mechanism": "N/A (invalid)",
    "purpose": "N/A (invalid)"
  },
  "DFIntErrorEstimationArbiterC4": {
    "mechanism": "Improves the system for estimating errors in game performance.",
    "purpose": "Helps developers identify and fix performance issues more effectively."
  },
  "FFlagUseWeakThreadRefsWhenSchedulingParallelExecution2": {
    "mechanism": "Uses weaker references to threads when scheduling tasks in parallel to reduce memory usage.",
    "purpose": "Improves game performance by optimizing how tasks are managed, leading to smoother gameplay."
  },
  "FFlagPCGDKPaymentsProtocolCleanupCalls_Staged": {
    "mechanism": "Implements a new method for cleaning up payment protocol calls to streamline transactions.",
    "purpose": "Enhances the reliability and speed of in-game purchases, making it easier for players to buy items."
  },
  "FFlagUseNewDiscoverabilityModal": {
    "mechanism": "Introduces a new interface for discovering games and features on the platform.",
    "purpose": "Makes it easier for players to find new games and experiences, improving overall engagement."
  },
  "FFlagSimUseExistingAttachmentName": {
    "mechanism": "Allows the simulation to use existing names for attachments in the game.",
    "purpose": "Simplifies the process for developers, leading to more consistent and easier-to-manage game elements."
  },
  "FFlagCrashpadReportVendorDeviceFLevel": {
    "mechanism": "Enhances the reporting system for crashes by including more detailed device information.",
    "purpose": "Helps developers fix bugs faster by providing better insights into crashes, leading to a more stable gaming experience."
  },
  "FFlagAXSlotsPeekViewScrollFix": {
    "mechanism": "Fixes scrolling issues in the peek view of AX slots.",
    "purpose": "Improves user experience by allowing smoother navigation through items."
  },
  "FIntVideoCaptureMaxShortSideLowMem_IXP": {
    "mechanism": "Sets a limit on the shorter side of video captures to reduce memory usage.",
    "purpose": "Enables players with lower-end devices to capture videos without performance issues."
  },
  "FFlagFixTeamChannelReferenceTextChat": {
    "mechanism": "Corrects how team channels are referenced in text chat.",
    "purpose": "Ensures that players can communicate effectively within their teams."
  },
  "FFlagUpdateConnectionLocWarning_Staged": {
    "mechanism": "Updates the warning message for connection issues.",
    "purpose": "Provides clearer information to players about their connection status."
  },
  "FFlagExpChatRefactorVisibleMessages": {
    "mechanism": "Refactors the chat system to improve message visibility.",
    "purpose": "Enhances the clarity and readability of messages in chat for players."
  },
  "DFFlagBadgeServiceUseSingularGetBadgeAwardDate_PlaceFilter": {
    "mechanism": "Uses a single method to retrieve badge award dates with a filter for specific places.",
    "purpose": "Improves the accuracy of badge award date retrieval for specific game locations."
  },
  "FFlagAXInventoryItemCardPerf": {
    "mechanism": "Enhances the performance of inventory item cards in the user interface.",
    "purpose": "Makes browsing and interacting with inventory items faster and smoother for players."
  },
  "FFlagVoiceChatLeaveOnNetworkDisconnect": {
    "mechanism": "Automatically disconnects voice chat when the player loses network connection.",
    "purpose": "Prevents players from being stuck in voice chat during network issues, enhancing user experience."
  },
  "FFlagTextBoxScrollingContentAware": {
    "mechanism": "Enables text boxes to adjust scrolling based on the content size dynamically.",
    "purpose": "Improves readability and usability of text boxes by ensuring all content is easily accessible."
  },
  "FFlagReworkCallStateSynchronization": {
    "mechanism": "Updates how call states are synchronized across different parts of the game.",
    "purpose": "Ensures a more reliable and consistent experience during multiplayer interactions."
  },
  "DFFlagAggBreakdownRCC": {
    "mechanism": "Enables detailed breakdown of player data in the analytics system.",
    "purpose": "Helps developers understand player behavior and improve game experiences."
  },
  "FFlagProfileQRCodePageScrollable": {
    "mechanism": "Allows the QR code page in profiles to be scrollable.",
    "purpose": "Makes it easier for players to view and share QR codes for their profiles."
  },
  "DFFlagUseNewPhysicsMeshDecoderForNav_Staged": {
    "mechanism": "Switches to a new method for decoding physics meshes for navigation.",
    "purpose": "Improves the accuracy and efficiency of navigation in games."
  },
  "FFlagCSGMeshDeserializationTelemetry": {
    "mechanism": "Tracks how complex CSG (Constructive Solid Geometry) meshes are loaded.",
    "purpose": "Helps developers optimize mesh loading times and performance."
  },
  "FFlagVoiceTCSBubbleClickState": {
    "mechanism": "Changes how the voice chat bubble responds to clicks.",
    "purpose": "Enhances user interaction with voice chat features for a smoother experience."
  },
  "DFFlagUseSimdAabbTri_Staged": {
    "mechanism": "Utilizes SIMD (Single Instruction, Multiple Data) for faster collision detection between objects.",
    "purpose": "Improves game performance by making interactions between objects smoother and quicker."
  },
  "FFlagCoreGuiFinalStateAnalytic": {
    "mechanism": "Tracks the final state of the Core GUI for analytics purposes.",
    "purpose": "Helps developers understand how players interact with the user interface, leading to better design and features."
  },
  "FFlagRemovePSMLRobloxDocManager": {
    "mechanism": "Removes the old document management system for better efficiency.",
    "purpose": "Streamlines access to documentation, making it easier for developers to find the information they need."
  },
  "FFlagEnableAdsLifecycleManager": {
    "mechanism": "Implements a system to manage the lifecycle of ads more effectively.",
    "purpose": "Enhances the ad experience for players, ensuring they see relevant ads without interruptions."
  },
  "FFlagDisableChromeFollowupFTUX": {
    "mechanism": "Disables a specific follow-up feature in Chrome for new users.",
    "purpose": "Simplifies the onboarding process for new players, making it easier to start playing without distractions."
  },
  "DFFlagBanAPINumberCheck": {
    "mechanism": "Disables a check that prevents certain API calls based on number limits.",
    "purpose": "Allows developers to make more flexible API calls without restrictions."
  },
  "FFlagAssetPermissionsApiHttpWrapperMigration": {
    "mechanism": "Migrates the asset permissions API to a new HTTP wrapper for better performance.",
    "purpose": "Improves the speed and reliability of checking asset permissions for players."
  },
  "FFlagEnableChatInputBarConfigurationPropertyIsFocused": {
    "mechanism": "Adds a property to check if the chat input bar is currently focused.",
    "purpose": "Enhances user experience by allowing better handling of chat input interactions."
  },
  "FFlagTouchSwipeAPIRewrite": {
    "mechanism": "Rewrites the API for touch swipe gestures to improve functionality.",
    "purpose": "Provides smoother and more responsive touch controls for mobile players."
  },
  "FFlagCoreScriptPublishPromptModal2": {
    "mechanism": "Introduces a new modal for publishing core scripts with updated prompts.",
    "purpose": "Simplifies the process for developers to publish their core scripts with clearer guidance."
  },
  "DFIntVideoCaptureLowResOnLowMemThresholdMB_IXP": {
    "mechanism": "Adjusts video capture quality based on available memory.",
    "purpose": "Ensures smoother video recording on devices with limited memory."
  },
  "FFlagLuauVectorMetatable": {
    "mechanism": "Introduces a new way to handle vector operations in the Luau programming language.",
    "purpose": "Improves scripting capabilities for developers using vectors, leading to better game mechanics."
  },
  "FFlagLuauVectorFolding": {
    "mechanism": "Optimizes how vector calculations are processed in Luau.",
    "purpose": "Enhances performance for games that heavily use vector math, resulting in smoother gameplay."
  },
  "FFlagEnablePhoto2AvatarV1APIs_PlaceFilter": {
    "mechanism": "Enables new APIs for avatar customization using photos with filtering options.",
    "purpose": "Allows players to personalize their avatars more creatively with photo-based features."
  },
  "FFlagTextureGeneratorFixTooltipAnchorPoint": {
    "mechanism": "Corrects the positioning of tooltips in the texture generation interface.",
    "purpose": "Improves user experience by making it easier to understand and use texture generation tools."
  },
  "FFlagSpanningTreeArrayToVector": {
    "mechanism": "Changes how data is stored for better performance.",
    "purpose": "Improves game loading times and efficiency."
  },
  "FFlagUserFreecamCustomGui_Staged": {
    "mechanism": "Introduces a customizable interface for freecam mode.",
    "purpose": "Allows players to personalize their freecam experience."
  },
  "FFlagStudioFixQtitanRibbonCornerWidget": {
    "mechanism": "Fixes a UI issue in the Roblox Studio interface.",
    "purpose": "Enhances the usability of Roblox Studio for developers."
  },
  "FFlagAddPresenceIndicatorToUserSearch": {
    "mechanism": "Adds a feature to show if users are online in search results.",
    "purpose": "Helps players find and connect with friends who are currently online."
  },
  "DFStringFlagRepoGitHashDynamicString": {
    "mechanism": "Links game versions to specific code changes.",
    "purpose": "Ensures players are using the latest updates and fixes."
  },
  "FFlagDisableChromeDefaultOpen": {
    "mechanism": "Disables the default behavior of Chrome opening certain links automatically.",
    "purpose": "Prevents unwanted pop-ups or new tabs when using Roblox in Chrome."
  },
  "FFlagGamepadPreferredWhenKeyboardPending_Staged": {
    "mechanism": "Prioritizes gamepad input when the keyboard is not yet ready for use.",
    "purpose": "Enhances gameplay experience by allowing smoother control with a gamepad."
  },
  "FFlagUserFreecamPlayerLockResetHeight": {
    "mechanism": "Resets the camera height when a player is locked in freecam mode.",
    "purpose": "Improves navigation and visibility for players using freecam."
  },
  "DFIntWebSocketDisconnectPointsHundredthsPercent_Staged": {
    "mechanism": "Adjusts the threshold for disconnecting WebSocket connections based on performance metrics.",
    "purpose": "Helps maintain a stable connection, reducing lag and disconnections during gameplay."
  },
  "DFFlagRobloxTelemetryFixPlaceIdAttachment": {
    "mechanism": "Fixes how place IDs are attached to telemetry data.",
    "purpose": "Improves data accuracy for developers, leading to better game performance and updates."
  },
  "FFlagEnableChatInputBarConfigurationAutocompleteEnabled": {
    "mechanism": "Enables autocomplete suggestions in the chat input bar.",
    "purpose": "Helps players quickly find and select phrases or commands while chatting."
  },
  "FFlagAppChatCorescriptsToastsEnabled2": {
    "mechanism": "Activates toast notifications for chat events in the app.",
    "purpose": "Keeps players informed about important chat updates without interrupting gameplay."
  },
  "FFlagUserPSRemoveTouchEnabled_Staged": {
    "mechanism": "Removes touch input support for certain user interface elements.",
    "purpose": "Improves performance and usability for players using non-touch devices."
  },
  "FFlagAvatarAutosetupOptionsInput": {
    "mechanism": "Automatically configures avatar options based on player input.",
    "purpose": "Simplifies the process of customizing avatars for players."
  },
  "DFFlagVideoCaptureBlockWinOpenGL_Staged": {
    "mechanism": "Prevents video capture when using OpenGL on Windows.",
    "purpose": "Ensures smoother gameplay and better performance during video recording."
  },
  "FFlagFriendsCarouselRemoveCiUpsell": {
    "mechanism": "Removes a promotional upsell from the friends carousel interface.",
    "purpose": "Makes it easier for players to access their friends without distractions."
  },
  "FFlagLuaAppFixEmphasisDisappear": {
    "mechanism": "Fixes a bug where emphasized text disappears in the Lua app.",
    "purpose": "Ensures that important messages are always visible to players."
  },
  "FFlagUserFreecamDepthOfFieldEffect3": {
    "mechanism": "Introduces a new visual effect for depth of field in freecam mode.",
    "purpose": "Enhances the visual experience for players using freecam, making scenes look more realistic."
  },
  "FFlagLuaAppShowSponsoredTooltipOnConsole": {
    "mechanism": "Displays a tooltip for sponsored content on console devices.",
    "purpose": "Informs players about sponsored items, improving their discovery of new content."
  },
  "FFlagEnablePhoto2Avatar3": {
    "mechanism": "Enables a new photo feature for avatars in Roblox.",
    "purpose": "Allows players to customize their avatars with updated photo options, enhancing personalization."
  },
  "FFlagUserFreecamCustomGui": {
    "mechanism": "Allows users to customize the interface of the freecam feature.",
    "purpose": "Gives players a personalized experience while using freecam."
  },
  "FFlagDragDetectorRestartDragAnchorFix": {
    "mechanism": "Fixes an issue where dragging objects would not reset correctly.",
    "purpose": "Improves the reliability of dragging objects in games."
  },
  "FFlagTopBarStyleUseDisplayUIScale": {
    "mechanism": "Changes the top bar's appearance based on the display size.",
    "purpose": "Enhances visual consistency and usability across different screen sizes."
  },
  "FFlagUpdateConnectionLocWarning": {
    "mechanism": "Updates the warning system for connection-related issues.",
    "purpose": "Informs players better about connection problems to improve gameplay experience."
  },
  "FFlagCoreGuiEnableAnalytics": {
    "mechanism": "Enables tracking of user interactions within the core GUI.",
    "purpose": "Helps developers understand player behavior to improve the game interface."
  },
  "FFlagSaveVideoCapturesToVideosFolder": {
    "mechanism": "Saves recorded videos directly to the user's Videos folder on their device.",
    "purpose": "Makes it easier for players to find and access their recorded gameplay videos."
  },
  "FFlagSilenceAnimationLoadErrorInUnitTests": {
    "mechanism": "Suppresses error messages related to animation loading during automated tests.",
    "purpose": "Improves the testing experience by reducing noise from non-critical errors."
  },
  "FFlagLuauCodeGenVBlendpdReorder": {
    "mechanism": "Optimizes the order of operations in code generation for better performance.",
    "purpose": "Enhances the efficiency of scripts, leading to smoother gameplay."
  },
  "DFFlagAddDynamicHeadTelemetryToSessionTracking2": {
    "mechanism": "Collects data on the use of dynamic heads in player sessions for analysis.",
    "purpose": "Helps developers understand how players use dynamic heads, improving future updates."
  },
  "FFlagStudioStopSettingDEP": {
    "mechanism": "Disables the setting of Data Execution Prevention (DEP) in the Roblox Studio environment.",
    "purpose": "Reduces potential crashes and improves stability for developers using Roblox Studio."
  },
  "FFlagContentFeedPinchToZoomEnabled_v5": {
    "mechanism": "Enables pinch-to-zoom functionality in the content feed on mobile devices.",
    "purpose": "Allows players to zoom in and out on content for a better viewing experience."
  },
  "FFlagUserFreecamDepthOfFieldEffect3_Staged": {
    "mechanism": "Implements a depth of field effect in freecam mode for enhanced visuals.",
    "purpose": "Improves the visual quality of scenes by blurring distant objects, making gameplay more immersive."
  },
  "FFlagChatTranslationLaunchEnabled": {
    "mechanism": "Activates real-time translation of chat messages for players.",
    "purpose": "Enables players to communicate across different languages, enhancing social interaction."
  },
  "FFlagMacDisplaySizeInternalDisplayFix": {
    "mechanism": "Fixes display issues on Mac devices related to internal screen sizes.",
    "purpose": "Ensures a better visual experience for Mac users by correcting screen scaling problems."
  },
  "DFIntSimExplodingTrainHundredthsPercentage_PlaceFilter": {
    "mechanism": "Adjusts the simulation of train explosions based on a percentage filter.",
    "purpose": "Allows for more controlled and realistic train explosion effects in specific game places."
  },
  "FFlagLuauUserTypeFunExportedAndLocal": {
    "mechanism": "Allows user-defined types to be exported and used locally in scripts.",
    "purpose": "Enables developers to create more organized and reusable code, improving game performance and maintainability."
  },
  "FFlagLuauStringFormatArityFix": {
    "mechanism": "Fixes the number of arguments required for string formatting functions.",
    "purpose": "Ensures that developers can format strings correctly without errors, enhancing the scripting experience."
  },
  "DFFlagTextBoxCtrlDel_Staged": {
    "mechanism": "Changes how the delete key functions in text boxes.",
    "purpose": "Improves text editing for players by allowing better control over text input."
  },
  "FFlagRemovePSMLSessionTracker": {
    "mechanism": "Disables a session tracking feature for performance reasons.",
    "purpose": "Reduces resource usage, leading to smoother gameplay for players."
  },
  "FFlagNavBarLabelsVRFix": {
    "mechanism": "Fixes the display of navigation bar labels in virtual reality mode.",
    "purpose": "Enhances the user interface for VR players, making it easier to navigate the game."
  },
  "FFlagTerrainVoxelReplaceWaterSubvoxel": {
    "mechanism": "Replaces water voxels with sub-voxel details for better rendering.",
    "purpose": "Improves the visual quality of water in games, making it look more realistic."
  },
  "FFlagPerformanceControlCLI105137DenoteNoRolloutGroup": {
    "mechanism": "Controls performance settings without affecting all users.",
    "purpose": "Allows for better performance tuning in games, enhancing the experience for players."
  },
  "FFlagLuauUserTypeFunGenerics": {
    "mechanism": "Introduces generics in Luau for more flexible coding.",
    "purpose": "Enables developers to create more efficient and reusable code, leading to better game features."
  },
  "FFlagCleanUpRenderInstanceStats": {
    "mechanism": "Cleans up rendering statistics for improved performance tracking.",
    "purpose": "Helps developers optimize their games, resulting in smoother gameplay for players."
  },
  "FFlagFlagRolloutTestStaticBool48": {
    "mechanism": "Tests a static boolean flag for feature rollout.",
    "purpose": "Facilitates controlled testing of new features, ensuring a better experience when they are released."
  },
  "FFlagChromeMusicWindowDirectionalInput": {
    "mechanism": "Enables directional input for music playback in Chrome browsers.",
    "purpose": "Allows players to control music playback more intuitively while using Chrome."
  },
  "FFlagComponentManagerImproveValidation": {
    "mechanism": "Enhances the validation process for game components in the engine.",
    "purpose": "Improves game stability and reduces errors for developers, leading to a smoother experience for players."
  },
  "FFlagAXFixMissingResalePrice_Staged": {
    "mechanism": "Fixes an issue where resale prices were not displayed correctly in the asset exchange.",
    "purpose": "Ensures players can see accurate resale prices for items, making trading fairer."
  },
  "FFlagPerformanceTelemetryTasksSleep": {
    "mechanism": "Optimizes performance monitoring tasks by allowing them to pause when not needed.",
    "purpose": "Enhances game performance and responsiveness for players by reducing unnecessary processing."
  },
  "FFlagAutocompleteEntireStringLiteral": {
    "mechanism": "Improves the autocomplete feature to suggest complete string literals in scripts.",
    "purpose": "Makes coding easier for developers, leading to faster game updates and better experiences for players."
  },
  "FFlagCompactShadowChange": {
    "mechanism": "Adjusts how shadows are rendered to improve performance.",
    "purpose": "Provides smoother visuals and better frame rates for players."
  },
  "FFlagAXFixWearAfterTryOnOwnedBundles": {
    "mechanism": "Fixes a bug that prevented players from wearing items after trying them on.",
    "purpose": "Ensures players can easily wear items they own without issues."
  },
  "FFlagInsertObjectModelOptimizations_Staged": {
    "mechanism": "Optimizes the process of inserting models into the game.",
    "purpose": "Makes it faster and easier for developers to add content, enhancing player experiences."
  },
  "FFlagLuauCompileDisabledBuiltins": {
    "mechanism": "Disables certain built-in functions in the Luau scripting language.",
    "purpose": "Encourages developers to use more efficient coding practices, leading to better game performance."
  },
  "FFlagSquadEnabled_Staged": {
    "mechanism": "Enables a feature that allows players to form squads with friends.",
    "purpose": "Enhances social gameplay by making it easier for players to team up and play together."
  },
  "DFFlagSolverV2NoModelModeChangesFromNonWorkspaceContainer": {
    "mechanism": "Prevents changes in model modes from affecting non-workspace containers.",
    "purpose": "Ensures that models in specific containers remain stable and unaffected during editing."
  },
  "FFlagLayoutNodeFlexRefactor6_PlaceFilter": {
    "mechanism": "Implements a new filtering system for layout nodes in places.",
    "purpose": "Improves organization and accessibility of layout nodes for developers."
  },
  "FFlagEnableChannelTabsConfiguration1008": {
    "mechanism": "Introduces configurable tabs for communication channels.",
    "purpose": "Enhances user experience by allowing players to customize their chat channels."
  },
  "FFlagLuauStoreCommentsForDefinitionFiles": {
    "mechanism": "Enables comments to be stored in Luau definition files.",
    "purpose": "Allows developers to add notes and explanations directly in their code for better clarity."
  },
  "FFlagStudioOutputControllerBatchEvent": {
    "mechanism": "Adds batch event handling for output in the studio.",
    "purpose": "Improves performance and efficiency when processing multiple output events in development."
  },
  "FFlagVoiceChatCustomAudioMixerEnableUpdateSourcesTelemetry2": {
    "mechanism": "Enables tracking of audio sources in voice chat for better performance.",
    "purpose": "Improves voice chat quality by optimizing how audio is mixed and managed."
  },
  "DFStringDataStoreRdbShadowTrafficRolloutConfig_PlaceFilter": {
    "mechanism": "Applies a filter to data storage operations based on specific places.",
    "purpose": "Enhances data management for games, ensuring smoother gameplay experiences."
  },
  "FFlagAXHidePBRInfoRowOnAnimatedBudles": {
    "mechanism": "Hides specific information about physical-based rendering on animated bundles.",
    "purpose": "Simplifies the interface for developers, making it easier to manage animated assets."
  },
  "FFlagToastNotificationEnableNewLogger": {
    "mechanism": "Activates a new logging system for toast notifications.",
    "purpose": "Improves the reliability and tracking of notifications players receive."
  },
  "DFFlagCLI170264": {
    "mechanism": "Introduces changes to the command-line interface for developers.",
    "purpose": "Streamlines development processes, making it easier for developers to manage their projects."
  },
  "DFFlagPerformanceControlCLI105990OptimizeReportFailedTelemetryValidation": {
    "mechanism": "Improves the validation process for performance reports to ensure they are accurate.",
    "purpose": "Players experience fewer errors and better performance tracking."
  },
  "FFlagFixLimitedUMobilePurchasePrompt": {
    "mechanism": "Fixes issues with the mobile purchase prompt that limited its functionality.",
    "purpose": "Players can make purchases more easily on mobile devices."
  },
  "FFlagFastClusterIgnoreMeshPartJointOffset": {
    "mechanism": "Optimizes how mesh parts are processed by ignoring unnecessary joint offsets.",
    "purpose": "Players enjoy smoother gameplay with faster loading times for complex models."
  },
  "FFlagAXSlotsInventoryLoadableGridView": {
    "mechanism": "Enables a grid view layout for inventory slots that can load dynamically.",
    "purpose": "Players can navigate their inventory more efficiently and visually."
  },
  "FFlagTouchscreenUseTabTipKeyboard_Staged": {
    "mechanism": "Implements a touchscreen-friendly keyboard for easier text input.",
    "purpose": "Players have a better typing experience on touchscreen devices."
  },
  "FFlagLuauMathMapDefinition": {
    "mechanism": "Enables a new way to define mathematical functions in Luau scripting.",
    "purpose": "Improves scripting capabilities for developers, allowing for more complex math operations."
  },
  "FFlagStudioNullCheckQWidgetRelayOnShowEvent": {
    "mechanism": "Adds a check to ensure widgets are valid before showing them in the Studio.",
    "purpose": "Enhances stability in Roblox Studio, reducing errors when displaying UI elements."
  },
  "DFFlagNfwlTracking": {
    "mechanism": "Activates tracking for user interactions and behaviors in the platform.",
    "purpose": "Helps developers understand player engagement and improve game experiences."
  },
  "FFlagPerformanceControlEventBaseTelemetryRateLimitingUnitChange": {
    "mechanism": "Modifies how performance data is collected and reported for events.",
    "purpose": "Optimizes performance monitoring, leading to smoother gameplay for players."
  },
  "FFlagPinStreamingSignals_Staged": {
    "mechanism": "Introduces a system for managing streaming signals in a staged manner.",
    "purpose": "Improves the efficiency of data streaming, enhancing game responsiveness and performance."
  },
  "FFlagEmptyKickMessageTranslation": {
    "mechanism": "Allows for the translation of kick messages when a player is removed from a game.",
    "purpose": "Players will see kick messages in their preferred language."
  },
  "FFlagEnableCoreScriptAndPluginActorVMPools": {
    "mechanism": "Implements separate memory pools for core scripts and plugins to improve performance.",
    "purpose": "Enhances game stability and reduces lag for players."
  },
  "FFlagUserFreecamPlayerLock2_Staged": {
    "mechanism": "Introduces a new method for locking players in freecam mode during certain gameplay scenarios.",
    "purpose": "Provides a smoother experience for players using freecam, preventing unwanted movement."
  },
  "FFlagLuauCompileOptimizeRevArith": {
    "mechanism": "Optimizes the arithmetic operations in the Luau scripting language for better performance.",
    "purpose": "Makes scripts run faster, improving overall game performance for players."
  },
  "DFFlagBadgeServiceUseSingularGetBadgeAwardDate": {
    "mechanism": "Changes the method of retrieving the award date for badges to a more efficient single call.",
    "purpose": "Players can access badge award dates more quickly and reliably."
  },
  "FFlagStudioDeviceEmulatorDisplaySizeInitialization_Staged": {
    "mechanism": "Adjusts the display size settings for device emulation in the studio.",
    "purpose": "Improves the accuracy of how games look on different devices during testing."
  },
  "FFlagAudioSpeechToTextDontSendShortBuffers": {
    "mechanism": "Prevents sending short audio buffers during speech recognition.",
    "purpose": "Enhances the accuracy of voice commands by ensuring better audio quality."
  },
  "DFFlagSetNoCollisionConstraintEnabledWakeUp": {
    "mechanism": "Allows objects with no collision constraints to wake up from sleep states.",
    "purpose": "Improves gameplay by making it easier for players to interact with certain objects."
  },
  "FFlagPhoto2AvatarSE": {
    "mechanism": "Enables a new system for uploading and using photos on avatars.",
    "purpose": "Allows players to customize their avatars with personal images more easily."
  },
  "DFFlagEnableRecommendationDetailedErrors": {
    "mechanism": "Provides detailed error messages when recommendations fail.",
    "purpose": "Helps players understand why certain features or recommendations are not working."
  },
  "FFlagAXFixMissingResalePrice": {
    "mechanism": "Fixes a bug where resale prices were not displayed correctly.",
    "purpose": "Players can see accurate resale prices for items, improving transparency in trading."
  },
  "FFlagAddFriendsComponentsTransparent": {
    "mechanism": "Makes the friend-related UI components more visually clear and accessible.",
    "purpose": "Players can easily navigate and manage their friends list, enhancing social interactions."
  },
  "FFlagLuauCodeGenFMA_Staged": {
    "mechanism": "Implements a new code generation feature for Luau scripts.",
    "purpose": "Developers can create more efficient scripts, leading to smoother gameplay experiences for players."
  },
  "FFlagAXSlotsDesktopCrashFix_Staged": {
    "mechanism": "Addresses a crash issue related to slot management on desktop.",
    "purpose": "Players experience fewer crashes when managing their inventory, leading to a more stable game experience."
  },
  "FFlagTextChannelDirectChatRequesterEnabled": {
    "mechanism": "Enables a feature for direct chat requests in text channels.",
    "purpose": "Players can communicate more easily with others in chat, fostering better interaction and collaboration."
  },
  "FFlagEnableRnCustomAppViews3": {
    "mechanism": "Enables custom views in the app using React Native.",
    "purpose": "Improves the user interface for a better experience in the app."
  },
  "FFlagAXRemoveModalPromptsNavigator": {
    "mechanism": "Removes modal prompts from the navigation system.",
    "purpose": "Streamlines navigation by reducing interruptions for players."
  },
  "FFlagExpChatEnableChannelTabsUIFix": {
    "mechanism": "Fixes the user interface for channel tabs in chat.",
    "purpose": "Enhances chat usability, making it easier for players to switch between channels."
  },
  "FFlagStudioBackendTranslationLoading": {
    "mechanism": "Improves how translations are loaded in the backend of Studio.",
    "purpose": "Ensures smoother and faster access to translated content for developers."
  },
  "FFlagCeaseUAPresenceRealtimeNotificationUpdatesInGameV2_Staged": {
    "mechanism": "Stops real-time updates for user presence notifications in-game.",
    "purpose": "Reduces distractions by limiting notifications about player presence."
  },
  "DFFlagDebugSimPrimalVectorizeBlockMatrixMultiply2": {
    "mechanism": "Enables a more efficient way to perform matrix multiplication in simulations.",
    "purpose": "Improves performance and speed of simulations for smoother gameplay."
  },
  "DFFlagHttpCacheReportSlowWritesWriteOK": {
    "mechanism": "Enhances the reporting of slow write operations in HTTP caching.",
    "purpose": "Helps developers identify and fix performance issues, leading to a better experience for players."
  },
  "FFlagVoiceUseAudioRoutingAPIV3": {
    "mechanism": "Switches to a newer version of the audio routing API for voice features.",
    "purpose": "Provides improved voice chat quality and functionality for players."
  },
  "FFlagEditableAPIRobloxScriptCreateInternal": {
    "mechanism": "Allows internal creation of scripts through a new editable API.",
    "purpose": "Gives developers more flexibility and control over scripting, enhancing game features."
  },
  "DFFlagConvexDecompInertiaDataValidation_Staged": {
    "mechanism": "Implements validation checks for inertia data in convex decomposition processes.",
    "purpose": "Ensures more accurate physics interactions in games, leading to a more realistic experience for players."
  },
  "FFlagEnableNetworkTracingA_Staged": {
    "mechanism": "Enables detailed tracking of network requests for better analysis.",
    "purpose": "Helps developers identify and fix network issues, improving game performance."
  },
  "DFFlagPerformanceControlRefactorSubmitTunable": {
    "mechanism": "Refactors how performance settings are submitted and adjusted.",
    "purpose": "Allows for more flexible performance tuning, enhancing game stability and responsiveness."
  },
  "FFlagInitLightGridAllAtOnce": {
    "mechanism": "Initializes lighting settings for the entire game environment simultaneously.",
    "purpose": "Improves lighting performance, leading to better visuals and smoother gameplay."
  },
  "FFlagCreatePluginUriForLegacyCreatePlugin": {
    "mechanism": "Creates a specific URI format for older plugin creation methods.",
    "purpose": "Ensures compatibility with older plugins, allowing developers to use them without issues."
  },
  "FFlagFlagRolloutTestStaticBool48_Staged": {
    "mechanism": "Tests a specific feature flag in a controlled manner.",
    "purpose": "Allows for gradual feature testing, ensuring stability before full rollout to players."
  },
  "FFlagVoiceIconInChatBubbleFix": {
    "mechanism": "Fixes the display of voice chat icons in chat bubbles.",
    "purpose": "Players can see voice chat indicators correctly, improving communication."
  },
  "DFFlagVisBugFixTrusses": {
    "mechanism": "Corrects visual glitches with truss structures in the game.",
    "purpose": "Players experience a more visually accurate environment without glitches."
  },
  "DFFlagSimFluidTelemetrizeSimulatedPrimitiveCount": {
    "mechanism": "Improves tracking of fluid simulation performance metrics.",
    "purpose": "Players benefit from smoother and more realistic fluid interactions in games."
  },
  "FFlagSQLiteCacheUseEpochTime": {
    "mechanism": "Changes how timestamps are stored in the database for efficiency.",
    "purpose": "Players experience faster loading times and improved game performance."
  },
  "FFlagUseBaseOffset": {
    "mechanism": "Adjusts the positioning of objects based on a base offset.",
    "purpose": "Players enjoy better object alignment and placement in the game world."
  },
  "DFFlagCapsCallableCheck": {
    "mechanism": "Checks if certain functions can be called safely.",
    "purpose": "Improves game stability by preventing errors when calling functions."
  },
  "FFlagLuaAppFixOmniFeedRefreshEffect": {
    "mechanism": "Fixes how the game updates the feed for new content.",
    "purpose": "Ensures players see new updates and content in real-time."
  },
  "FFlagHarfBuzzAllocOrCrash": {
    "mechanism": "Adjusts memory allocation for text rendering.",
    "purpose": "Prevents crashes related to displaying text in games."
  },
  "DFIntErrorEstimationArbiterC5": {
    "mechanism": "Improves the accuracy of error estimations in the game.",
    "purpose": "Helps developers identify and fix issues more effectively."
  },
  "FFlagMacDisplaySizeInternalDisplayFix_Staged": {
    "mechanism": "Fixes display size issues for Mac users.",
    "purpose": "Enhances the visual experience for players on Mac computers."
  },
  "FFlagGamepadPreferredWhenKeyboardPending": {
    "mechanism": "Prioritizes gamepad input when a keyboard is detected but not actively used.",
    "purpose": "Improves gameplay experience by allowing players to use their gamepad seamlessly even when a keyboard is connected."
  },
  "FFlagAXUnifiedSubsetOfLook": {
    "mechanism": "Consolidates various accessibility features into a single, unified system.",
    "purpose": "Enhances accessibility options for players, making it easier to customize their gameplay experience."
  },
  "FFlagAddChannelInfoToMainWindowTitle": {
    "mechanism": "Includes channel information in the title bar of the main application window.",
    "purpose": "Helps players quickly identify which channel they are currently using, improving navigation."
  },
  "FFlagMicroprofilerAccum": {
    "mechanism": "Enables detailed performance tracking and analysis of game components.",
    "purpose": "Allows developers to optimize games better, leading to smoother gameplay for players."
  },
  "FFlagAudioSpeechToTextDontSendShortBuffers_Staged": {
    "mechanism": "Prevents sending very short audio clips for speech-to-text processing.",
    "purpose": "Improves the accuracy of voice recognition by filtering out irrelevant short audio inputs."
  },
  "FFlagInvokeCallbackWithLockedMessage": {
    "mechanism": "Allows callbacks to be triggered even when a message is locked.",
    "purpose": "Ensures players receive important updates or notifications without interruption."
  },
  "FFlagEnableUseHttpRequestToServeAds": {
    "mechanism": "Enables the use of HTTP requests to fetch and display advertisements.",
    "purpose": "Improves the ad experience for players by allowing more dynamic and relevant ads."
  },
  "FFlagIncludeMediaPickerPermissions": {
    "mechanism": "Adds permission checks for accessing media picker features.",
    "purpose": "Enhances player security by ensuring only authorized access to media features."
  },
  "DFFlagAssembleAllWorldModelsBeforeParallelExecution": {
    "mechanism": "Prepares all world models before running tasks in parallel.",
    "purpose": "Optimizes game performance, leading to smoother gameplay for players."
  },
  "DFFlagRenderBeamSegmentAlphaFix": {
    "mechanism": "Fixes the alpha rendering of beam segments in the game.",
    "purpose": "Improves visual quality of beams, making them look better during gameplay."
  },
  "FFlagDismissSquadNudgeToast_Staged": {
    "mechanism": "Allows players to hide the squad nudge toast notification.",
    "purpose": "Gives players more control over their notifications, reducing distractions."
  },
  "DFFlagVisBugFixMeshSwapCrash": {
    "mechanism": "Fixes a bug that caused crashes when swapping 3D models.",
    "purpose": "Improves game stability, preventing unexpected crashes during gameplay."
  },
  "DFFlagEnableDisplayBubble": {
    "mechanism": "Enables a visual bubble that shows important information or updates.",
    "purpose": "Enhances player experience by providing clear and immediate information."
  },
  "DFFlagEnableGmaVideoAdsMemoryCheck": {
    "mechanism": "Checks memory usage when displaying video ads to optimize performance.",
    "purpose": "Ensures smoother gameplay while watching ads, reducing lag for players."
  },
  "DFFlagRemoveUnusedLocalPlayerCharacter": {
    "mechanism": "Removes unnecessary character data from memory.",
    "purpose": "Improves game performance by freeing up resources, leading to a smoother experience."
  },
  "FFlagRemovePSMLStudioCmdHostAppServices": {
    "mechanism": "Removes certain app service commands from the Studio environment.",
    "purpose": "Improves stability and performance in Roblox Studio."
  },
  "FFlagDisableChromeFollowupOcclusion": {
    "mechanism": "Disables a specific feature in Chrome that affects rendering.",
    "purpose": "Enhances visual performance and reduces lag for players using Chrome."
  },
  "FFlagToolboxFixCreatorStoreUrl": {
    "mechanism": "Fixes the URLs for creator items in the Toolbox.",
    "purpose": "Ensures players can correctly access and use creator items in their games."
  },
  "FIntVideoCaptureMaxLongSideLowMem_IXP": {
    "mechanism": "Sets a limit on the maximum length of video captures to save memory.",
    "purpose": "Allows players with lower memory devices to capture videos without crashing."
  },
  "FFlagBlendedSerpUserPresenceExperiment_v3": {
    "mechanism": "Tests a new way of showing user presence in search results.",
    "purpose": "Improves how players see if friends are online, enhancing social interaction."
  },
  "FFlagTouchscreenSupport": {
    "mechanism": "Enables touchscreen input for mobile devices.",
    "purpose": "Allows players to interact with games using touch gestures."
  },
  "FFlagPCGDKPaymentsProtocolCleanupCalls": {
    "mechanism": "Improves the payment processing system by cleaning up outdated calls.",
    "purpose": "Enhances the reliability and speed of transactions for players."
  },
  "FIntNewFindAllReplaceAll2BetaFeatureRolloutPercent": {
    "mechanism": "Gradually introduces a new find and replace feature to a percentage of users.",
    "purpose": "Provides players with improved editing tools for easier game development."
  },
  "FFlagLayoutNodeGetSharedInstance": {
    "mechanism": "Optimizes the way layout nodes are accessed in the game engine.",
    "purpose": "Improves performance and responsiveness of UI elements for players."
  },
  "FFlagTouchscreenUseTabTipKeyboardPCGDKOnly": {
    "mechanism": "Restricts the use of a special touchscreen keyboard to specific devices.",
    "purpose": "Enhances typing experience for players using compatible touchscreen devices."
  },
  "FFlagStudioDisambiguatePluginShortcutsLua": {
    "mechanism": "Separates plugin shortcuts in Lua to avoid conflicts.",
    "purpose": "Helps developers use plugins more easily without shortcut clashes."
  },
  "FFlagLuaAppFixNewMediaGalleryFocus": {
    "mechanism": "Fixes focus issues in the media gallery for the Lua app.",
    "purpose": "Improves user experience by making it easier to navigate and select media."
  },
  "FFlagModerationServiceIgnoreTemporaryCaptures": {
    "mechanism": "Excludes temporary captures from moderation checks.",
    "purpose": "Reduces false positives in moderation, allowing for smoother gameplay."
  },
  "FFlagMacInstallerAddStudioArguments": {
    "mechanism": "Adds specific arguments to the Mac installer for Studio.",
    "purpose": "Enhances installation options for Mac users, improving setup experience."
  },
  "FFlagAXImproveSlotBasedEditorPerformance_Staged": {
    "mechanism": "Optimizes performance for the slot-based editor in stages.",
    "purpose": "Makes the editor run faster and more efficiently for developers."
  },
  "FFlagLuauCodeGenVectorDeadStoreElim": {
    "mechanism": "Removes unused vector data from the code generation process.",
    "purpose": "Improves performance by reducing unnecessary data, leading to faster game loading times."
  },
  "FFlagContactImporterUIRefactor_v1": {
    "mechanism": "Updates the user interface for the contact importer tool.",
    "purpose": "Makes it easier for users to import contacts, enhancing the overall user experience."
  },
  "FFlagAnthroArtistIntentFBXImporterIntermediateState": {
    "mechanism": "Allows for a smoother transition when importing FBX files for anthropomorphic models.",
    "purpose": "Ensures better compatibility and quality of imported models for creators."
  },
  "FFlagEnableLuaErrorV2Counter": {
    "mechanism": "Tracks and counts Lua errors more effectively in scripts.",
    "purpose": "Helps developers identify and fix issues in their games faster, improving game stability."
  },
  "FFlagAXAccessoryAdjustmentReturnOnNil": {
    "mechanism": "Modifies how accessory adjustments are handled when no data is present.",
    "purpose": "Prevents errors and ensures smoother gameplay when accessories are missing or not loaded."
  },
  "DFFlagUseFastMat44Mul": {
    "mechanism": "Uses a faster method for matrix multiplication operations.",
    "purpose": "Improves performance in games, making them run smoother."
  },
  "FFlagFixAssetAccessFlagging": {
    "mechanism": "Corrects how assets are flagged for access permissions.",
    "purpose": "Ensures players can access the right assets without issues."
  },
  "FFlagLuauUserTypeFunThreadBuffer": {
    "mechanism": "Enhances the buffer for user type checks in Luau scripting.",
    "purpose": "Improves script performance and reduces lag during gameplay."
  },
  "FFlagSimCSG3RejectNonArchivable_PlaceFilter": {
    "mechanism": "Prevents non-archivable objects from being included in certain simulations.",
    "purpose": "Ensures that only relevant objects are processed, improving game efficiency."
  },
  "DFIntWebSocketConnectResultPointsHundredthsPercent_Staged": {
    "mechanism": "Adjusts the connection results for WebSocket to include more precise percentage points.",
    "purpose": "Provides more accurate feedback on connection success rates for better user experience."
  },
  "FFlagFixScrollingFrameHiddenScrollBarSinkInput": {
    "mechanism": "Fixes input issues when the scrollbar is hidden in scrolling frames.",
    "purpose": "Ensures players can interact with all content in scrolling frames without issues."
  },
  "FFlagAXSlotsPeekViewScrollFix_Staged": {
    "mechanism": "Addresses scrolling problems in the peek view of slots.",
    "purpose": "Improves the user experience when viewing items in a slot by making scrolling smoother."
  },
  "FFlagLuaAppRewriteTokenRefresh": {
    "mechanism": "Updates how tokens are refreshed in the Lua application.",
    "purpose": "Enhances security and stability for players by ensuring smoother token management."
  },
  "FFlagRemoveStaleChildConnections": {
    "mechanism": "Cleans up old connections between objects that are no longer needed.",
    "purpose": "Reduces lag and improves performance for players by optimizing resource usage."
  },
  "DFFlagUseNewPhysicsMeshDecoderForNav": {
    "mechanism": "Switches to a new method for decoding physics meshes for navigation.",
    "purpose": "Improves the accuracy and efficiency of navigation in games, leading to better gameplay."
  },
  "FFlagSocialCarouselEnableUserSeenEvents_Staged": {
    "mechanism": "Enables tracking of user interactions with social events in the carousel.",
    "purpose": "Improves user experience by showing relevant social content based on what users have seen."
  },
  "FFlagEnableCommandAutocomplete": {
    "mechanism": "Adds an autocomplete feature for commands in the game console.",
    "purpose": "Makes it easier for players to enter commands quickly without typing them out fully."
  },
  "FFlagAssemblyRBXArrayToSmallVector": {
    "mechanism": "Optimizes the way arrays are handled in the game's code for better performance.",
    "purpose": "Enhances game performance and reduces lag during gameplay."
  },
  "FFlagNavBarU13UpdateFix": {
    "mechanism": "Fixes issues with the navigation bar in the user interface.",
    "purpose": "Ensures a smoother and more reliable navigation experience for players."
  },
  "DFFlagNetworkSchemaImprovements": {
    "mechanism": "Implements updates to the network communication structure.",
    "purpose": "Improves the stability and efficiency of online interactions in games."
  },
  "FFlagDisableChromePinnedChat": {
    "mechanism": "Disables the feature that keeps the chat window fixed on the screen in Chrome browsers.",
    "purpose": "Improves chat usability by allowing players to see more of the game without the chat blocking their view."
  },
  "FLogVoiceChatLogs_Staged": {
    "mechanism": "N/A (invalid)",
    "purpose": "N/A (invalid)"
  },
  "FFlagAXColorAdjustmentBottomPaddingFix": {
    "mechanism": "Adjusts the padding at the bottom of the screen for color adjustment features.",
    "purpose": "Ensures better visibility and accessibility for players who use color adjustments."
  },
  "DFFlagReportMajorFaults2": {
    "mechanism": "Improves the reporting system for significant issues in games.",
    "purpose": "Allows players to report serious problems more effectively, leading to quicker fixes."
  },
  "FFlagSocialCarouselEnableUserSeenEvents": {
    "mechanism": "Enables a feature that shows users events they have already seen in a social carousel.",
    "purpose": "Helps players keep track of events and updates they are interested in without missing out."
  },
  "FFlagAXImproveSlotBasedEditorPerformance": {
    "mechanism": "Enhances the performance of the slot-based editor by optimizing resource usage.",
    "purpose": "Players experience smoother and faster editing when creating games."
  },
  "FFlagPeopleListContextualMenuU13": {
    "mechanism": "Updates the menu that appears when interacting with players to include new features.",
    "purpose": "Players can easily access more options when interacting with others in the game."
  },
  "FFlagLegacyConnectingMicStateFix": {
    "mechanism": "Fixes issues with how microphone connection states are handled in older systems.",
    "purpose": "Players have a more reliable experience when using their microphones in games."
  },
  "DFFlagUseFastMat44": {
    "mechanism": "Implements a faster method for handling 4x4 matrices used in 3D calculations.",
    "purpose": "Players enjoy improved graphics performance and responsiveness in 3D environments."
  },
  "FFlagEnableExperienceChatOptimizations": {
    "mechanism": "Optimizes the chat system for better performance and reduced lag.",
    "purpose": "Players can chat more smoothly without interruptions or delays."
  },
  "FFlagStudioDeviceEmulatorRibbonButtonCheckableFix": {
    "mechanism": "Fixes a bug in the device emulator's ribbon buttons to ensure they can be checked correctly.",
    "purpose": "Improves usability for developers by ensuring the emulator buttons work as intended."
  },
  "DFIntPredictedOOMAbsLimitFreeMB": {
    "mechanism": "Sets a limit on the amount of memory that can be used to prevent crashes due to out-of-memory errors.",
    "purpose": "Helps maintain game stability by preventing crashes when memory usage is too high."
  },
  "FFlagTaskSchedulerRescheduleAsBackground": {
    "mechanism": "Allows tasks to be rescheduled to run in the background without interrupting the main process.",
    "purpose": "Enhances performance by allowing smoother gameplay while background tasks are processed."
  },
  "DFFlagDataStoreEnableSerializationChecksAndCounters": {
    "mechanism": "Enables checks and counters for data storage operations to ensure data integrity.",
    "purpose": "Improves data reliability for developers by ensuring that data is stored correctly."
  },
  "FFlagFoundationShowErrorAboutFoundationProvider": {
    "mechanism": "Displays an error message when there is an issue with the Foundation provider.",
    "purpose": "Helps developers quickly identify and fix issues related to the Foundation system."
  },
  "FFlagSimDcdRefactorDelta3": {
    "mechanism": "Improves the simulation data collection process.",
    "purpose": "Enhances game performance by optimizing how data is gathered during gameplay."
  },
  "DFFlagSimSolverCleanUpLDLPGSSolverMT": {
    "mechanism": "Cleans up and optimizes the solver used for simulations.",
    "purpose": "Provides smoother and more accurate simulations for players."
  },
  "DFFlagSessionTaskSeparateIdentity": {
    "mechanism": "Separates user identity management from session tasks.",
    "purpose": "Improves security and stability during gameplay sessions."
  },
  "FIntVoiceRtcStatsContextCardinalityThreshold_Staged": {
    "mechanism": "Sets a threshold for voice communication statistics.",
    "purpose": "Ensures better quality and reliability of voice chat features."
  },
  "FFlagLuauIntersectNormalsNeedsToTrackResourceLimits": {
    "mechanism": "Tracks resource limits for normal intersection calculations.",
    "purpose": "Optimizes resource usage, leading to better performance in games."
  },
  "FFlagEnableTextChatServiceCanUsersDirectChatAsync": {
    "mechanism": "Allows users to send direct messages asynchronously using the text chat service.",
    "purpose": "Enables players to chat directly with each other without waiting for responses, making communication smoother."
  },
  "FFlagContentFeedPolicyDependentTabBar": {
    "mechanism": "Changes the tab bar in the content feed based on user policies.",
    "purpose": "Improves user experience by showing relevant content tabs based on individual user settings."
  },
  "FFlagRemoveRefToMissingLocInConnection_Staged": {
    "mechanism": "Removes references to non-existent locations in the connection system.",
    "purpose": "Reduces errors and confusion for players when trying to connect to game locations."
  },
  "FFlagEnableCancelSubscriptionApp2": {
    "mechanism": "Enables the option for users to cancel their subscriptions through the app.",
    "purpose": "Gives players more control over their subscriptions, allowing them to manage their payments easily."
  },
  "DFStringFlipTimeStampDynamicString": {
    "mechanism": "Updates how dynamic strings handle timestamps for better performance.",
    "purpose": "Enhances the display of time-related information in games, making it more accurate and user-friendly."
  },
  "FFlagFixTimestampNowComparisonForChatMessages": {
    "mechanism": "Corrects how timestamps are compared in chat messages.",
    "purpose": "Ensures chat messages display the correct order based on time."
  },
  "FFlagEnableEmbeddedGamepadCheck": {
    "mechanism": "Adds a check for gamepad input within the game interface.",
    "purpose": "Improves game compatibility for players using gamepads."
  },
  "FLogWindowsLuaApp_Staged": {
    "mechanism": "N/A (invalid)",
    "purpose": "N/A (invalid)"
  },
  "FFlagSpeechToTextFlushPartialBuffersOnEndEncode": {
    "mechanism": "Clears temporary data when speech-to-text processing ends.",
    "purpose": "Enhances accuracy and responsiveness of speech-to-text features."
  },
  "FFlagAppChatEnableConversationTitleWithFacePile": {
    "mechanism": "Allows chat conversations to have titles displayed alongside user avatars.",
    "purpose": "Makes it easier for players to identify and engage in specific chat conversations."
  },
  "DFFlagUseFastMat33_Staged": {
    "mechanism": "Switches to a faster method for matrix calculations in rendering.",
    "purpose": "Improves game performance and reduces lag during gameplay."
  },
  "DFFlagWakeRenderJobOnRemove": {
    "mechanism": "Ensures the rendering job wakes up when an object is removed from the game.",
    "purpose": "Enhances visual updates and responsiveness when objects disappear."
  },
  "FFlagVideoCaptureXbox_IXP": {
    "mechanism": "Enables video capture functionality specifically for Xbox players.",
    "purpose": "Allows players to record and share their gameplay experiences easily."
  },
  "FFlagEnablePartyNudgeNotification3_Staged": {
    "mechanism": "Introduces notifications to nudge players in a party to take action.",
    "purpose": "Encourages players to engage and participate more actively in group activities."
  },
  "FFlagAXCommunityLooksReporting": {
    "mechanism": "Adds a reporting feature for community-created character looks.",
    "purpose": "Helps maintain a safe and appropriate environment by allowing players to report inappropriate designs."
  },
  "FFlagStudioRefreshEmulatorIcons3": {
    "mechanism": "Updates the icons in the emulator section of Studio to be more modern.",
    "purpose": "Improves the visual experience for developers using Roblox Studio."
  },
  "DFFlagCapabilityUseTelemetryExtra": {
    "mechanism": "Enhances data tracking capabilities for system performance.",
    "purpose": "Helps improve the overall stability and performance of Roblox for players."
  },
  "FFlagAXEnableAvatarOutfitDeepLinkFix2": {
    "mechanism": "Fixes issues with deep linking to specific avatar outfits.",
    "purpose": "Allows players to easily share and access specific outfits directly."
  },
  "FFlagChromeMusicWindowDirectionalInput_Staged": {
    "mechanism": "Enables directional input for music controls in the Chrome browser.",
    "purpose": "Enhances the music experience for players using Chrome by allowing better control."
  },
  "FFlagEnableErrorIconFixV2": {
    "mechanism": "Fixes the display of error icons in the user interface.",
    "purpose": "Provides clearer feedback to players when issues occur, improving user experience."
  },
  "FFlagSurfaceAppearanceTinting3": {
    "mechanism": "Enables advanced color tinting on surfaces for better visual effects.",
    "purpose": "Improves the appearance of objects in the game, making them look more vibrant and realistic."
  },
  "FFlagAudioSpeechToTextEnableVadAudioLookback_Staged": {
    "mechanism": "Implements voice activity detection to enhance speech recognition accuracy.",
    "purpose": "Allows players to communicate more effectively by converting spoken words into text."
  },
  "FFlagUseGeneralizedFileCulling_Staged": {
    "mechanism": "Optimizes file loading by only keeping necessary assets in memory.",
    "purpose": "Reduces lag and improves game performance, leading to a smoother gaming experience."
  },
  "FFlagAvatarPublishPromptUpdateAttachments": {
    "mechanism": "Updates the interface for publishing avatar changes to include attachment options.",
    "purpose": "Makes it easier for players to customize and share their avatars with new features."
  },
  "FFlagUIBloxEnableUseStyleMetadata": {
    "mechanism": "Allows UI elements to utilize style metadata for consistent design.",
    "purpose": "Enhances the visual consistency of user interfaces, making them more appealing and user-friendly."
  },
  "FFlagLayoutNodeGetSharedInstanceC": {
    "mechanism": "Allows layout nodes to retrieve a shared instance for better performance.",
    "purpose": "Improves the efficiency of UI layouts, making them load faster and look smoother."
  },
  "FFlagSplitCoreAndDevUIMetrics": {
    "mechanism": "Separates core metrics from development UI metrics for clearer data tracking.",
    "purpose": "Helps developers understand performance better, leading to a more stable and enjoyable game experience."
  },
  "FFlagAXAccessoryAdjustmentReturnOnNil_Staged": {
    "mechanism": "Adjusts how accessory settings are returned when they are not set, preventing errors.",
    "purpose": "Ensures players have a smoother experience when customizing their characters without unexpected issues."
  },
  "FFlagSimEditableEnableDestroy": {
    "mechanism": "Enables the destruction of editable simulation objects in a more controlled way.",
    "purpose": "Gives players more control over their game environment, allowing for better gameplay mechanics."
  },
  "FFlagEnableCreateLazyComponent": {
    "mechanism": "Introduces a method for creating components that load only when needed.",
    "purpose": "Enhances game performance by reducing load times and resource usage, making games run more smoothly."
  },
  "FFlagCeaseUAPresenceRealtimeNotificationUpdatesInGameV2": {
    "mechanism": "Disables real-time updates for user presence notifications in games.",
    "purpose": "Reduces distractions by stopping constant notifications about player presence."
  },
  "FFlagEnablePartyTabNumberedBadge3": {
    "mechanism": "Introduces a new badge system for party tabs that displays numbers.",
    "purpose": "Helps players easily see how many friends are in their party at a glance."
  },
  "FFlagMoveUGCValidationFunctionFeature": {
    "mechanism": "Changes the location of the function that validates user-generated content.",
    "purpose": "Improves the efficiency and reliability of checking user-created items."
  },
  "DFIntErrorEstimationArbiterThreshold4dtThou": {
    "mechanism": "Sets a specific threshold for estimating errors in data processing.",
    "purpose": "Enhances the accuracy of data handling, leading to smoother gameplay."
  },
  "FFlagLuauUnfinishedRepeatAncestryFix": {
    "mechanism": "Addresses issues with the ancestry tracking system in the Luau scripting language.",
    "purpose": "Fixes bugs to ensure scripts run correctly, improving game performance."
  },
  "FFlagPatchLiveScriptedSourcesIntoPlaySolo": {
    "mechanism": "Allows live scripts to be included in solo play mode.",
    "purpose": "Enables developers to test their scripts in a solo environment, improving development efficiency."
  },
  "FFlagUseCaptureForStudio_Staged": {
    "mechanism": "Implements a new capture method for staged development in Studio.",
    "purpose": "Enhances the development experience by providing better tools for capturing game states."
  },
  "DFFlagEnableIrisCancelFromTeleport": {
    "mechanism": "Allows players to cancel teleportation actions in the Iris system.",
    "purpose": "Gives players more control over their movements, preventing unwanted teleports."
  },
  "FFlagPerformanceControlCLI100373FlagRolloutTelemetry": {
    "mechanism": "Tracks performance data related to a specific CLI feature rollout.",
    "purpose": "Helps improve game performance by analyzing how changes affect players."
  },
  "FFlagTouchscreenUseTabTipKeyboard": {
    "mechanism": "Enables a touchscreen-friendly keyboard for input on mobile devices.",
    "purpose": "Improves typing experience for mobile players, making it easier to interact with games."
  },
  "DFFlagUseFastMat33": {
    "mechanism": "Enables a faster method for matrix calculations in rendering.",
    "purpose": "Improves game performance and graphics rendering speed."
  },
  "DFFlagSimFluidTelemetrizePrimitiveCount": {
    "mechanism": "Tracks the number of primitive shapes used in fluid simulations.",
    "purpose": "Helps developers optimize fluid effects for better gameplay experience."
  },
  "FFlagAXSlotsInventoryLoadableGridView_Staged": {
    "mechanism": "Introduces a new grid view layout for inventory items.",
    "purpose": "Enhances the visual organization of items in players' inventories."
  },
  "FFlagRobloxTelemetryAddWindowsDeviceForm": {
    "mechanism": "Collects data from Windows devices for better analytics.",
    "purpose": "Improves game performance and user experience on Windows platforms."
  },
  "FFlagSyncSubStateOnVoiceJoin": {
    "mechanism": "Synchronizes player states when joining a voice chat.",
    "purpose": "Ensures players have a consistent experience when they enter voice chat."
  },
  "DFIntNetworkTraceAThrottlePoints_Staged": {
    "mechanism": "Adjusts the number of points for network tracing to optimize performance.",
    "purpose": "Improves game stability and reduces lag during gameplay."
  },
  "FFlagEnableBubbleChatConfigurationMaxBubbles": {
    "mechanism": "Allows configuration of the maximum number of chat bubbles that can appear.",
    "purpose": "Enhances chat experience by preventing overcrowding of messages."
  },
  "DFFlagCLI169724UseOAEnumValuesForPublishService": {
    "mechanism": "Switches to using specific enumeration values for publishing services.",
    "purpose": "Streamlines the publishing process, making it easier for developers to manage their games."
  },
  "FFlagMoveUGCValidationFromAssetService2": {
    "mechanism": "Shifts the validation of user-generated content to a new system.",
    "purpose": "Increases the speed and reliability of content approval for players."
  },
  "FFlagUseNewRuppTokenProcessorAPIs": {
    "mechanism": "Implements new APIs for processing tokens related to user accounts.",
    "purpose": "Enhances security and efficiency in managing player accounts and transactions."
  },
  "FFlagIEMFocusNavToButtons_Staged": {
    "mechanism": "Changes focus navigation to prioritize buttons in the UI.",
    "purpose": "Makes it easier for players to navigate and interact with buttons in the game."
  },
  "FFlagUseLinkingService": {
    "mechanism": "Enables a service that connects different parts of the game more efficiently.",
    "purpose": "Improves the experience of players by allowing smoother transitions and interactions between game areas."
  },
  "FFlagSimEditableDisableFromPartAsync": {
    "mechanism": "Allows parts in the game to be edited asynchronously, improving performance.",
    "purpose": "Enhances gameplay by reducing lag when players are modifying game elements."
  },
  "DFFlagInExpAvatarCreationEnableNewCounter": {
    "mechanism": "Introduces a new counter feature in the avatar creation process.",
    "purpose": "Helps players track their progress and options while customizing their avatars."
  },
  "DFFlagSimSolidMeshSmoothingAngle_Staged": {
    "mechanism": "Adjusts the smoothing angle for solid meshes in the game.",
    "purpose": "Improves the visual quality of 3D objects, making them look better for players."
  },
  "FFlagLayoutNodeNewParentUpdateDescendantDirtyBits": {
    "mechanism": "Updates how parent-child relationships in layouts handle changes to improve performance.",
    "purpose": "Improves the responsiveness and efficiency of UI updates in games."
  },
  "FFlagSaveClientSettingsCachePerfTelemetry": {
    "mechanism": "Caches client settings to reduce the need for repeated data fetching.",
    "purpose": "Enhances game performance by speeding up access to player settings."
  },
  "FFlagSwitchToIntegralWeightsForStreamingTDigestInstead": {
    "mechanism": "Changes the way data streaming weights are calculated for better accuracy.",
    "purpose": "Improves the efficiency of data streaming, leading to smoother gameplay experiences."
  },
  "FFlagInferGlobalTypes": {
    "mechanism": "Automatically determines types for global variables to enhance code understanding.",
    "purpose": "Helps developers write better code, leading to fewer bugs and improved game stability."
  },
  "FFlagFindReplaceAllMaxResultsSetting_Staged": {
    "mechanism": "Sets a limit on the number of results returned by the find and replace tool.",
    "purpose": "Prevents overwhelming the user with too many results, making editing easier."
  },
  "DFFlagEnableGetUsersPriceLevelsApi": {
    "mechanism": "Enables an API to retrieve user price levels for items.",
    "purpose": "Allows players to see different pricing tiers for items based on their user status."
  },
  "FFlagLuauUserTypeFunCloneTail": {
    "mechanism": "Introduces a new feature in the Luau programming language for cloning user types.",
    "purpose": "Enhances scripting capabilities, making it easier for developers to create and manage user-related features."
  },
  "DFIntErrorEstimationArbiterC1": {
    "mechanism": "Implements an error estimation system to improve performance tracking.",
    "purpose": "Helps developers understand and fix issues faster, leading to a smoother gameplay experience."
  },
  "FFlagRenderModelClusterEntityCulling_Staged": {
    "mechanism": "Activates a system to optimize rendering by culling unnecessary model clusters.",
    "purpose": "Improves game performance by reducing the load on players' devices, resulting in smoother graphics."
  },
  "DFIntNetworkTraceAThrottlePoints": {
    "mechanism": "Sets up a network tracing system to monitor and throttle data points.",
    "purpose": "Ensures a stable connection for players by managing data flow, reducing lag during gameplay."
  },
  "FFlagUserFreecamPlayerLock2": {
    "mechanism": "Locks the free camera to the player's position in certain scenarios.",
    "purpose": "Allows players to explore the game world without losing their original position."
  },
  "FIntVoiceRtcStatsContextCardinalityThreshold": {
    "mechanism": "Sets a limit on the number of voice chat contexts tracked for performance.",
    "purpose": "Improves voice chat performance and stability during gameplay."
  },
  "FFlagSimModelLodFixSpottyColor": {
    "mechanism": "Fixes color inconsistencies in Level of Detail (LOD) models.",
    "purpose": "Enhances visual quality by ensuring smoother color transitions in models."
  },
  "FFlagViewportDisplaySizeAPI2BetaFeature_Staged": {
    "mechanism": "Introduces a new API for managing viewport display sizes.",
    "purpose": "Gives developers better control over how their games are displayed, improving player experience."
  },
  "FFlagISRCacheDirtyRootToMembers": {
    "mechanism": "Caches changes to certain game objects for efficiency.",
    "purpose": "Speeds up game performance by reducing lag when interacting with game elements."
  },
  "FFlagTextChatServicePropertyTextBox": {
    "mechanism": "Enables a new property for text chat that allows customization of text box appearance.",
    "purpose": "Improves the visual experience of chat for players, making it more engaging."
  },
  "FFlagEnableAudioTremolo_Staged": {
    "mechanism": "Activates a sound effect that modulates audio volume to create a tremolo effect.",
    "purpose": "Enhances audio experiences in games, adding depth and variety to sound effects."
  },
  "FFlagAddPluginRunContextSupport": {
    "mechanism": "Allows plugins to run in different contexts within the Roblox environment.",
    "purpose": "Gives developers more flexibility and control when creating tools, improving game development efficiency."
  },
  "DFFlagSimSolverUseSignedIntForDegree": {
    "mechanism": "Changes the way angles are calculated in simulations by using signed integers.",
    "purpose": "Improves accuracy in game physics and simulations, leading to better gameplay experiences."
  },
  "DFFlagFixReportPlayerLoadTimeEvents": {
    "mechanism": "Addresses issues with the loading times of player reporting events.",
    "purpose": "Ensures that reporting players is faster and more reliable, enhancing player safety and moderation."
  },
  "FFlagPreferredInputFilter": {
    "mechanism": "Filters input preferences for better user experience.",
    "purpose": "Allows players to customize their input methods for more comfortable gameplay."
  },
  "FFlagContactImporterRevealSentState": {
    "mechanism": "Reveals the status of sent contact import requests.",
    "purpose": "Informs players about the success or failure of their contact import actions."
  },
  "DFFlagVideoCaptureBlockWinOpenGL": {
    "mechanism": "Blocks video capture functionality on systems using OpenGL.",
    "purpose": "Prevents issues during gameplay on certain graphics setups, ensuring smoother performance."
  },
  "FFlagCheckNilUrlWhenStartListening": {
    "mechanism": "Checks for null URLs before starting a listening process.",
    "purpose": "Enhances stability by avoiding errors when trying to connect to invalid URLs."
  },
  "FFlagRobloxTelemetryAddWindowsDeviceForm_Staged": {
    "mechanism": "Adds a form for collecting telemetry data from Windows devices.",
    "purpose": "Improves game performance and user experience by gathering relevant device information."
  },
  "DFFlagCanViewBrandProjectAsyncEnabled2": {
    "mechanism": "Enables asynchronous loading of brand projects for users.",
    "purpose": "Allows players to view brand projects more quickly and efficiently."
  },
  "FFlagEnablePhoto2Avatar3_PlaceFilter": {
    "mechanism": "Activates a new filtering system for avatar photos in places.",
    "purpose": "Improves the quality and relevance of avatar images shown in games."
  },
  "FFlagCIAmpUpsellExperimentEnabled_v1": {
    "mechanism": "Tests a new upsell feature for in-game purchases.",
    "purpose": "Encourages players to make purchases by showcasing offers more effectively."
  },
  "FFlagUGCValidationCallbackResultStrings": {
    "mechanism": "Introduces a callback system for validating user-generated content.",
    "purpose": "Ensures that user-created items meet quality standards before being published."
  },
  "FFlagVoiceChatTeamTestMuteIconOutOfSyncFix": {
    "mechanism": "Fixes synchronization issues with the mute icon in voice chat.",
    "purpose": "Provides a more accurate representation of mute status during voice chat."
  },
  "FFlagFixLayoutNodeInstanceCrash": {
    "mechanism": "Fixes a bug that causes the game to crash when using layout nodes.",
    "purpose": "Improves game stability, preventing unexpected crashes during gameplay."
  },
  "FFlagLuauCodeGenVectorLerp": {
    "mechanism": "Enhances the code generation for vector interpolation functions in Luau.",
    "purpose": "Allows developers to create smoother animations and movements in games."
  },
  "DFFlagEnableChatWindowMessageProperties1001": {
    "mechanism": "Introduces new properties for chat messages in the chat window.",
    "purpose": "Gives players more control over how chat messages appear and function."
  },
  "FFlagEnableBillboardUpdateFrequency_PlaceFilter": {
    "mechanism": "Adjusts how often billboards update based on specific place filters.",
    "purpose": "Optimizes performance by reducing unnecessary updates, improving visual quality."
  },
  "FFlagVoiceChatCullingDoNotClearSsrcHistory": {
    "mechanism": "Prevents the clearing of voice chat session identifiers during certain events.",
    "purpose": "Enhances voice chat reliability, ensuring better communication between players."
  },
  "DFFlagEnableLinkSharing_Staged": {
    "mechanism": "Allows users to share links within the platform.",
    "purpose": "Enables players to easily share game links with friends."
  },
  "FFlagRemovePSMLScriptCloneTracker": {
    "mechanism": "Disables a specific tracking feature for scripts.",
    "purpose": "Improves game performance by reducing unnecessary tracking."
  },
  "FFlagShowSpeakerIconWithChatBubblesTCS": {
    "mechanism": "Displays speaker icons alongside chat bubbles.",
    "purpose": "Helps players identify who is speaking in chat more easily."
  },
  "FFlagSimDcdRefactorDelta3_Staged": {
    "mechanism": "Implements changes to simulation data handling.",
    "purpose": "Enhances game stability and performance for players."
  },
  "FFlagAppNavRemoveUseBottomBar": {
    "mechanism": "Removes the bottom navigation bar in the app.",
    "purpose": "Streamlines the user interface for a cleaner experience."
  },
  "DFFlagUseNewPhysicsMeshDecoderForLegacyMassData": {
    "mechanism": "Uses an updated method to decode mass data for older physics meshes.",
    "purpose": "Improves the accuracy and performance of physics interactions in older games."
  },
  "FFlagEnableWarmStartMilestoneV2": {
    "mechanism": "Activates a new version of a system that helps maintain player progress during updates.",
    "purpose": "Ensures smoother transitions and less disruption for players when game milestones are updated."
  },
  "FFlagLayoutNodeNewParentUpdateDescendantDirtyBits_PlaceFilter": {
    "mechanism": "Introduces a new way to track changes in parent-child relationships within game layouts.",
    "purpose": "Enhances the efficiency of layout updates, leading to a smoother building experience for players."
  },
  "FFlagACEAddKeyframeUniqueWaypoint": {
    "mechanism": "Allows the addition of unique waypoints in animation keyframes.",
    "purpose": "Gives developers more control over animations, resulting in more dynamic and engaging character movements."
  },
  "FFlagInExperienceMenuResetButtonTextToRespawn": {
    "mechanism": "Changes the text of the reset button in the experience menu to indicate respawning.",
    "purpose": "Clarifies the action for players, making it easier to understand how to return to the game after dying."
  },
  "DFFlagTrackDetectedOOMInST2": {
    "mechanism": "Tracks out-of-memory errors in the second stage of the system.",
    "purpose": "Helps improve game stability by identifying memory issues."
  },
  "FFlagVoiceBanShowToastOnSubsequentJoins": {
    "mechanism": "Displays a notification when a player banned from voice chat joins again.",
    "purpose": "Informs players about their voice chat ban status upon joining."
  },
  "FFlagRemoveRefToMissingLocInConnection": {
    "mechanism": "Eliminates references to non-existent locations in network connections.",
    "purpose": "Enhances connection reliability by removing broken links."
  },
  "FFlagAXItemCardTallIXPEnabled": {
    "mechanism": "Enables a taller item card layout for improved item display.",
    "purpose": "Provides a better visual experience when viewing items."
  },
  "FFlagLegacyFindReplaceUsageTelemetry": {
    "mechanism": "Collects data on the use of the old find and replace feature.",
    "purpose": "Helps developers understand how players use the feature for improvements."
  },
  "FFlagRemovePSMLVersionHistoryController": {
    "mechanism": "Disables the version history controller for PSML.",
    "purpose": "Simplifies the management of PSML versions for smoother updates."
  },
  "FFlagLuauCodeGenVectorLerp_Staged": {
    "mechanism": "Introduces a new method for generating vector interpolation in Luau.",
    "purpose": "Improves performance and accuracy when creating smooth movements in games."
  },
  "DFFlagSpawnErrorReportingOnSpawningThread": {
    "mechanism": "Enables error reporting for spawning issues on the main thread.",
    "purpose": "Helps developers quickly identify and fix problems when spawning game objects."
  },
  "DFFlagCDCTestsReportFailingDecomps_Staged": {
    "mechanism": "Reports failures in decomposition tests for CDC.",
    "purpose": "Enhances the reliability of game components by ensuring they function as expected."
  },
  "FFlagUseGeneralizedFileCulling": {
    "mechanism": "Implements a new system for managing file loading and unloading.",
    "purpose": "Optimizes game performance by reducing unnecessary file usage."
  },
  "FFlagPerformanceControlCLI101799DenoteNoExperiment": {
    "mechanism": "Disables certain experimental performance features in the command line interface.",
    "purpose": "Improves stability for players by avoiding potential issues from untested features."
  },
  "FFlagEnableBillboardUpdateFrequency": {
    "mechanism": "Adjusts how often billboard GUIs update their display.",
    "purpose": "Enhances visual performance and responsiveness of in-game indicators for players."
  },
  "FFlagKillDropperAction_Staged": {
    "mechanism": "Modifies the behavior of dropper actions in a staged environment.",
    "purpose": "Ensures smoother gameplay by refining how items are dropped in the game."
  },
  "FFlagTypesetterAllocOrCrash": {
    "mechanism": "Changes memory allocation for text rendering to prevent crashes.",
    "purpose": "Provides a more reliable experience for players when displaying text in the game."
  },
  "FFlagAXExtendUndoRedoTracking": {
    "mechanism": "Enhances the tracking system for undo and redo actions in the game.",
    "purpose": "Allows players to have better control over their actions, making it easier to correct mistakes."
  },
  "FFlagProfilePlatformFixFriendsAttribution": {
    "mechanism": "Fixes how friends are attributed to profiles across platforms.",
    "purpose": "Ensures that friends are correctly displayed on user profiles, improving social interactions."
  },
  "DFFlagHttpRbxStorageMigration3": {
    "mechanism": "Migrates storage systems to a new HTTP-based method.",
    "purpose": "Enhances data storage reliability and performance for game assets."
  },
  "FFlagFoundationShowErrorAboutFoundationProvider_Staged": {
    "mechanism": "Displays error messages related to the Foundation provider.",
    "purpose": "Helps developers identify and fix issues more easily, leading to smoother gameplay."
  },
  "FFlagLuaAppFixEdpInitialFocus3": {
    "mechanism": "Corrects initial focus settings in the Lua application.",
    "purpose": "Improves user experience by ensuring the right elements are focused when the app starts."
  },
  "DFFlagUseFastMat44Mul_Staged": {
    "mechanism": "Implements a faster method for matrix multiplication.",
    "purpose": "Boosts performance in games that rely on complex calculations, leading to smoother graphics."
  },
  "FFlagAppChatUniversalAppToastsEnabled2": {
    "mechanism": "Enables toast notifications for chat messages in the app.",
    "purpose": "Players receive instant alerts for new chat messages, improving communication."
  },
  "DFFlagVisBugFixRoundSpecialMeshScale": {
    "mechanism": "Fixes a bug affecting the scaling of special mesh objects.",
    "purpose": "Players experience more accurate visuals for certain objects in the game."
  },
  "FFlagStudioRibbonXMLViewOnly": {
    "mechanism": "Allows users to view XML data in a read-only format in Studio.",
    "purpose": "Developers can inspect XML data without making changes, aiding in debugging."
  },
  "FFlagInsertPartWithMaterial": {
    "mechanism": "Enables inserting parts that come with specific materials applied.",
    "purpose": "Players can create more visually appealing objects easily, enhancing creativity."
  },
  "FFlagUserPSRemoveTouchEnabled": {
    "mechanism": "Disables touch input for user interfaces on certain devices.",
    "purpose": "Players on those devices have a more consistent experience without touch conflicts."
  },
  "FFlagAddPolicyForVoiceUpsellSignup": {
    "mechanism": "Introduces a new policy for signing up users for voice features.",
    "purpose": "Improves user experience by ensuring users are informed about voice feature benefits during signup."
  },
  "FFlagGameSettingsFixNumberInputRow": {
    "mechanism": "Fixes the input method for number fields in game settings.",
    "purpose": "Allows players to enter numbers correctly, enhancing usability in game configuration."
  },
  "DFFlagCLI169724UseOAEnumValuesForPublishService_Staged": {
    "mechanism": "Switches to using specific enumerated values for publishing services.",
    "purpose": "Ensures more consistent and reliable publishing processes for developers."
  },
  "FFlagModerationServiceIgnoreTemporaryCaptures_Staged": {
    "mechanism": "Modifies moderation checks to overlook temporary content captures.",
    "purpose": "Reduces unnecessary moderation actions, improving the experience for players and content creators."
  },
  "FFlagAXInventoryItemCardPerf_Staged": {
    "mechanism": "Enhances performance of inventory item cards in the user interface.",
    "purpose": "Provides a smoother and faster browsing experience for players when viewing their inventory."
  },
  "DFIntConvexDecompBadDecompReportingHundredthsPercentage_Staged": {
    "mechanism": "Tracks and reports the percentage of bad decompositions in convex shapes.",
    "purpose": "Helps developers identify and fix issues with 3D shapes to improve game performance."
  },
  "FFlagFlagRolloutTestStaticBool49": {
    "mechanism": "Enables a static boolean flag for testing purposes.",
    "purpose": "Allows developers to test new features without affecting all players."
  },
  "FFlagToastNotificationsQueueLock": {
    "mechanism": "Locks the queue for toast notifications to prevent overlap.",
    "purpose": "Ensures players receive notifications in a clear and organized manner."
  },
  "DFFlagTotalTrackedMemory": {
    "mechanism": "Tracks the total memory usage of the game.",
    "purpose": "Helps developers optimize games by monitoring memory usage for better performance."
  },
  "FIntVideoCaptureMaxLongSide_IXP": {
    "mechanism": "Sets a maximum length for the longer side of video captures.",
    "purpose": "Ensures video captures are manageable in size for players sharing content."
  },
  "FFlagGuiServiceTrackLayoutTimeForPerfTests": {
    "mechanism": "Tracks how long it takes to layout GUI elements for performance analysis.",
    "purpose": "Helps developers improve the speed and efficiency of user interfaces."
  },
  "FFlagAlwaysSetupVoiceListeners": {
    "mechanism": "Ensures voice chat listeners are always initialized for users.",
    "purpose": "Improves the reliability of voice chat features in games."
  },
  "FFlagTextureGeneratorReturnPartGroupSkipInvalidParts1": {
    "mechanism": "Optimizes texture generation by skipping invalid parts in a group.",
    "purpose": "Enhances performance by reducing unnecessary processing of unusable parts."
  },
  "FFlagCollectionServiceTagTracking": {
    "mechanism": "Enables tracking of tags assigned to objects in the game.",
    "purpose": "Allows developers to manage and organize game elements more effectively."
  },
  "FFlagStrictInternalCaps_Staged": {
    "mechanism": "Imposes stricter limits on internal data handling.",
    "purpose": "Ensures better stability and performance by preventing data overflow issues."
  },
  "DFFlagLuauDebugInfoInvArgLeftovers": {
    "mechanism": "Enables detailed debugging information for unused arguments in Luau scripts.",
    "purpose": "Helps developers identify and fix issues in their scripts more easily."
  },
  "FFlagScreenGui3dRayHitPointFix": {
    "mechanism": "Fixes how raycasting interacts with 3D Screen GUI elements.",
    "purpose": "Improves accuracy of interactions with 3D GUI, enhancing user experience."
  },
  "DFIntErrorEstimationArbiterC3": {
    "mechanism": "Provides better estimation of errors in complex calculations.",
    "purpose": "Reduces the likelihood of errors during gameplay, leading to smoother experiences."
  },
  "FFlagFindReplaceAllCapEscapedStringLength": {
    "mechanism": "Improves the handling of string lengths in find and replace operations.",
    "purpose": "Ensures more accurate text manipulation, benefiting developers working with strings."
  },
  "DFFlagSimEditableEnableNewCreate2": {
    "mechanism": "Allows for new editing features in the simulation environment.",
    "purpose": "Gives developers more tools to create and modify their games effectively."
  },
  "FFlagTopBarStyleUseDisplayUIScale_Staged": {
    "mechanism": "Adjusts the top bar's size based on the user's display settings.",
    "purpose": "Improves the visual experience by making the top bar easier to see and use on different screen sizes."
  },
  "FFlagDragDetectorUsesPermissionPolicy": {
    "mechanism": "Implements a system that checks user permissions before allowing drag actions.",
    "purpose": "Enhances security by ensuring only authorized users can interact with draggable elements."
  },
  "DFFlagVBInUsersServiceResponse": {
    "mechanism": "Modifies how user data is retrieved from the server to include additional information.",
    "purpose": "Provides players with more detailed information about their accounts and settings."
  },
  "FFlagVoiceChatOptimizeUserLeaveGetOrCreate_Staged": {
    "mechanism": "Improves the process of handling users leaving voice chat by optimizing server responses.",
    "purpose": "Reduces lag and improves the overall experience when users join or leave voice chat."
  },
  "FFlagTextChatServiceIncludesColon": {
    "mechanism": "Allows the text chat service to recognize and process messages with colons.",
    "purpose": "Enables players to use colons in their messages for better formatting and expression."
  },
  "FFlagDisableChromeUnibar": {
    "mechanism": "Disables the unified address bar in Chrome for Roblox.",
    "purpose": "Improves the visibility and usability of the Roblox interface in Chrome."
  },
  "FLogWindowsLuaApp": {
    "mechanism": "N/A (invalid)",
    "purpose": "N/A (invalid)"
  },
  "DFFlagUsePhysicsMeshDecoderInBulletWrapper_Staged": {
    "mechanism": "Utilizes a new method for decoding physics meshes in the bullet physics engine.",
    "purpose": "Enhances the performance and accuracy of physics interactions in games."
  },
  "FFlagEnableShimmeringIcon": {
    "mechanism": "Activates a shimmering effect for certain icons in the Roblox interface.",
    "purpose": "Makes icons more visually appealing and noticeable for players."
  },
  "FFlagFixDx11CbufferClearAssert": {
    "mechanism": "Fixes an assertion error related to clearing constant buffers in DirectX 11.",
    "purpose": "Ensures smoother graphics and fewer crashes during gameplay on DirectX 11."
  },
  "FFlagEnableEmbeddedGamepadCheck_Staged": {
    "mechanism": "Enables a system to check if a gamepad is connected while playing embedded games.",
    "purpose": "Improves game compatibility for players using gamepads in embedded experiences."
  },
  "FFlagAXSlotsScrollAway2": {
    "mechanism": "Modifies how slots in the user interface scroll when items are added or removed.",
    "purpose": "Enhances the visual experience for players by providing smoother scrolling of item slots."
  },
  "FFlagAXFPSForCatSubCat_Staged": {
    "mechanism": "Adjusts the frame rate settings for specific categories and subcategories of games.",
    "purpose": "Optimizes performance for players, ensuring a smoother gameplay experience in certain game types."
  },
  "FFlagKillDropperAction": {
    "mechanism": "Disables the action that causes items to drop from a player's inventory.",
    "purpose": "Prevents accidental item loss for players during gameplay."
  },
  "FFlagAudioSpeechToTextEnableResponseSequencing": {
    "mechanism": "Implements a system that processes spoken audio and converts it into text responses in a sequence.",
    "purpose": "Allows players to interact more naturally using voice commands, enhancing communication in games."
  },
  "FFlagPGSConstraintAlign2AxesCompliantCacheFix": {
    "mechanism": "Fixes caching issues for constraints aligning to two axes in physics simulations.",
    "purpose": "Improves the accuracy and stability of physics interactions in games."
  },
  "FFlagRuppTokEnTest": {
    "mechanism": "Tests a new token system for user authentication and permissions.",
    "purpose": "Enhances security and user experience by streamlining access to features."
  },
  "FFlagSortAutocompleteByPopularity": {
    "mechanism": "Changes the sorting algorithm for autocomplete suggestions to prioritize popular items.",
    "purpose": "Helps players find the most relevant and commonly used items faster."
  },
  "FFlagLuauUnfinishedRepeatAncestryFix_Staged": {
    "mechanism": "Addresses issues with the ancestry of unfinished scripts in the Luau programming language.",
    "purpose": "Ensures smoother script execution and reduces errors for developers."
  },
  "FFlagSetDbgInfoVulkan": {
    "mechanism": "Enables debugging information for the Vulkan graphics API.",
    "purpose": "Improves performance and troubleshooting for games using advanced graphics."
  },
  "FFlagLuaRibbonSelectInput3": {
    "mechanism": "Enhances input handling for ribbon tools in Lua scripts.",
    "purpose": "Improves the user experience when selecting and manipulating objects in the game."
  },
  "FFlagCSGv2UseImprovedSphereAndCylinder": {
    "mechanism": "Switches to a new method for creating spheres and cylinders in CSG (Constructive Solid Geometry).",
    "purpose": "Provides better quality and performance for 3D shapes, making building easier and more efficient."
  },
  "FFlagSimEditableMemoryBudget": {
    "mechanism": "Allows developers to adjust memory usage settings for simulations.",
    "purpose": "Gives players smoother gameplay by optimizing how memory is used during game sessions."
  },
  "FFlagUserFreecamPlayerLockResetHeight_Staged": {
    "mechanism": "Changes how the camera height resets when using freecam mode.",
    "purpose": "Enhances the control and experience of players using freecam by ensuring a consistent camera position."
  },
  "FFlagRibbonEnableSliderLua": {
    "mechanism": "Activates the use of sliders in Lua scripts for ribbon tools.",
    "purpose": "Allows for more dynamic and customizable tool adjustments, improving the building experience."
  },
  "FFlagVideoCapturesMetadataLoadingFix": {
    "mechanism": "Fixes issues with loading metadata for video captures.",
    "purpose": "Ensures that video captures display accurate information, improving user experience."
  },
  "DFFlagCapsReflect": {
    "mechanism": "Enables the reflection of certain game capabilities.",
    "purpose": "Allows players to see and use new game features more effectively."
  },
  "FFlagContactImporterManagerPolicyFix_v1": {
    "mechanism": "Corrects the management policies for importing contacts.",
    "purpose": "Improves the process of connecting with friends, enhancing social interactions."
  },
  "FFlagSpeechToTextFlushPartialBuffersOnEndEncode_Staged": {
    "mechanism": "Clears temporary data buffers when speech-to-text encoding finishes.",
    "purpose": "Improves accuracy and responsiveness of speech recognition for players."
  },
  "DFIntErrorEstimationArbiterC2": {
    "mechanism": "Refines the estimation of errors in data processing.",
    "purpose": "Enhances the reliability of game performance by reducing errors."
  },
  "DFFlagParallelGcSpawnWhenHasWork": {
    "mechanism": "Enables parallel garbage collection when there are tasks to process.",
    "purpose": "Improves game performance by freeing up memory more efficiently."
  },
  "FFlagAXFPSForCatSubCat": {
    "mechanism": "Adjusts frame rate settings for specific categories and subcategories of games.",
    "purpose": "Enhances gameplay smoothness for players in those categories."
  },
  "FIntVideoCaptureMaxShortSide_IXP": {
    "mechanism": "Sets a maximum size for the shorter side of video captures.",
    "purpose": "Ensures video captures maintain a consistent quality and aspect ratio."
  },
  "FFlagExplorerPropertiesUseStyledObject": {
    "mechanism": "Updates the properties panel in the Explorer to use styled objects.",
    "purpose": "Makes it easier for developers to read and manage object properties."
  },
  "DFFlagVoiceChatReportSilenceWhenVoiceChatStopFetchingAudioAfterTimeoutEnabled": {
    "mechanism": "Reports silence in voice chat if audio fetching stops after a timeout.",
    "purpose": "Improves voice chat reliability by notifying users when audio issues occur."
  },
  "FFlagEnableSnoozeMenuTitleWrapping": {
    "mechanism": "Allows longer titles in the snooze menu to wrap onto multiple lines.",
    "purpose": "Players can see full titles without them being cut off, improving readability."
  },
  "FFlagLuauNormalizationTracksCyclicPairsThroughInhabitance": {
    "mechanism": "Improves how the Luau scripting language handles certain data structures.",
    "purpose": "Makes scripting more efficient and reliable for developers, enhancing game performance."
  },
  "FFlagShareLinkV2FixInvalidModal_Staged": {
    "mechanism": "Fixes issues with sharing links that previously caused errors in a modal window.",
    "purpose": "Players can share game links without encountering errors, making it easier to invite friends."
  },
  "FFlagRemovePSMLTextScraperListener": {
    "mechanism": "Disables a feature that listens for text scraping in the platform.",
    "purpose": "Improves privacy and security for players by reducing unwanted data collection."
  },
  "FFlagAssetAccessErrorMessageImprovements5": {
    "mechanism": "Enhances error messages related to asset access issues.",
    "purpose": "Players receive clearer and more helpful error messages, making it easier to understand problems."
  },
  "FStringFlipTimeStampFastString": {
    "mechanism": "Optimizes the way timestamps are processed in strings for faster performance.",
    "purpose": "Improves loading times and responsiveness when displaying time-related information."
  },
  "FIntNewFindAllReplaceAll2BetaFeatureRolloutPercent_Staged": {
    "mechanism": "Gradually introduces a new find-and-replace feature to a small percentage of users for testing.",
    "purpose": "Allows players to use an improved text editing tool while ensuring stability before full release."
  },
  "FFlagSimFixConstraintSelection": {
    "mechanism": "Fixes issues with selecting constraints in simulations for better accuracy.",
    "purpose": "Enhances the building experience by making it easier to manipulate objects in games."
  },
  "FLogVoiceChatLogs": {
    "mechanism": "N/A (invalid)",
    "purpose": "N/A (invalid)"
  },
  "FFlagEnableSidePaddingPropsFriendsMenu": {
    "mechanism": "Adds padding to the sides of the friends menu for better layout.",
    "purpose": "Improves the visual appearance and usability of the friends menu for players."
  },
  "DFFlagSimListInArrayRemoveEarlyOut": {
    "mechanism": "Optimizes simulation by removing unnecessary checks in the array processing.",
    "purpose": "Improves game performance by making simulations run faster and smoother."
  },
  "FFlagEnableAdGuiInteractivityControlRefactor6": {
    "mechanism": "Updates the way ad interfaces handle user interactions.",
    "purpose": "Enhances user experience by allowing more responsive and interactive ad displays."
  },
  "FFlagCapsStudioPropWidget": {
    "mechanism": "Introduces a new property widget for better management of object properties in Studio.",
    "purpose": "Makes it easier for developers to adjust and control object settings while building games."
  },
  "FFlagAudioPlayerReplicateAsset": {
    "mechanism": "Ensures audio assets are properly replicated across different game instances.",
    "purpose": "Provides a consistent audio experience for players, regardless of where they are in the game."
  },
  "FFlagStudio3dViewFocusOnCreateConstraint2": {
    "mechanism": "Enhances the 3D view focus when creating constraints in Studio.",
    "purpose": "Allows developers to more easily position and manipulate objects in 3D space."
  },
  "DFFlagUseFastMat44_Staged": {
    "mechanism": "Uses a faster method for matrix calculations in rendering.",
    "purpose": "Improves game performance and graphics rendering speed."
  },
  "DFFlagEnableLinkSharing": {
    "mechanism": "Allows players to share links to games and experiences easily.",
    "purpose": "Enhances social interaction by making it simpler to invite friends to play."
  },
  "DFFlagWrapDeformerReportTelemetryStat3_Staged": {
    "mechanism": "Collects data on how deformer features are used in games.",
    "purpose": "Helps developers understand and improve character animations."
  },
  "DFFlagEnableRecommendationDetailedErrors_Staged": {
    "mechanism": "Provides detailed error messages for recommendation systems.",
    "purpose": "Helps players understand why certain games are recommended or not."
  },
  "DFFlagSendCapabilityTelemetry": {
    "mechanism": "Tracks and sends data about player capabilities and device performance.",
    "purpose": "Improves game optimization by understanding player hardware better."
  },
  "DFFlagHandleLostInputEvent": {
    "mechanism": "Handles situations where player input is lost, ensuring the game continues to respond appropriately.",
    "purpose": "Improves gameplay experience by preventing unresponsive controls during gameplay."
  },
  "DFFlagOtherFieldsPerfdata2": {
    "mechanism": "Enhances performance data collection for better analysis and optimization.",
    "purpose": "Provides smoother gameplay and faster loading times by optimizing game performance."
  },
  "DFFlagSpecificGravityDummyFunctionGA": {
    "mechanism": "Implements a specific function to handle gravity calculations in a more efficient way.",
    "purpose": "Ensures more realistic physics in games, improving player immersion and experience."
  },
  "FFlagFindReplaceAllMaxResultsSetting": {
    "mechanism": "Sets a limit on the number of results returned when using find and replace tools.",
    "purpose": "Helps players manage large projects by preventing overwhelming results and making editing easier."
  },
  "DFFlagEnableLuaApiToRegisterEncryptedAssets_PlaceFilter": {
    "mechanism": "Allows developers to register encrypted assets with a filter for specific places.",
    "purpose": "Enhances security for game assets, ensuring that only authorized players can access them."
  }
}