{
  "FFlagAXOutlineSubcategoryPill": {
    "mechanism": "Adds a visual outline to subcategory pills in the UI.",
    "purpose": "Improves the clarity and visibility of category selections for players."
  },
  "DFIntDataStoreOrderedSetFixedRequestLimit_PlaceFilter": {
    "mechanism": "Sets a fixed limit on requests for ordered data stores with place filtering.",
    "purpose": "Enhances performance by preventing excessive data requests, leading to smoother gameplay."
  },
  "FFlagEnableAdOpportunityTracker4_PlaceFilter": {
    "mechanism": "Tracks ad opportunities more effectively with place-specific filters.",
    "purpose": "Increases the chances for developers to earn from ads by optimizing ad placements."
  },
  "FFlagFixBlurryImages": {
    "mechanism": "Improves image rendering to reduce blurriness.",
    "purpose": "Enhances visual quality of images in the game, making them clearer for players."
  },
  "DFIntTextChatCommandClientSentThrottlePermyriad_Staged": {
    "mechanism": "Limits the number of chat commands sent by clients to prevent spam.",
    "purpose": "Ensures a cleaner chat experience by reducing clutter from excessive commands."
  },
  "DFFlagProductInfoBatchingEnabled_PlaceFilter": {
    "mechanism": "N/A (invalid)",
    "purpose": "N/A (invalid)"
  },
  "FFlagOnlyVisibleFramesAllowModal": {
    "mechanism": "N/A (invalid)",
    "purpose": "N/A (invalid)"
  },
  "DFFlagWriteFlagCacheAfterFlagFetch": {
    "mechanism": "N/A (invalid)",
    "purpose": "N/A (invalid)"
  },
  "FFlagAXMigrateQuickButtonsToGlobalAutoFocus": {
    "mechanism": "N/A (invalid)",
    "purpose": "N/A (invalid)"
  },
  "FFlagCoreComponentManagerEmitAssetDMKeyTelemetry": {
    "mechanism": "N/A (invalid)",
    "purpose": "N/A (invalid)"
  },
  "FFlagAXFixBuyActionBarNotAppearing2": {
    "mechanism": "N/A (invalid)",
    "purpose": "N/A (invalid)"
  },
  "DFFlagEditableMeshFastClusterSkipLoD_Staged": {
    "mechanism": "N/A (invalid)",
    "purpose": "N/A (invalid)"
  },
  "FFlagAppChatIllustrationsUpdate": {
    "mechanism": "N/A (invalid)",
    "purpose": "N/A (invalid)"
  },
  "FFlagVideoEncoderScopedOutputBuffer_Staged": {
    "mechanism": "N/A (invalid)",
    "purpose": "N/A (invalid)"
  },
  "FFlagAXAddStyleToItemCardPriceLine": {
    "mechanism": "N/A (invalid)",
    "purpose": "N/A (invalid)"
  },
  "FStringEngineVoiceSdpCompressionIxpLayer": {
    "mechanism": "Implements compression for voice data in the SDP layer to optimize bandwidth usage.",
    "purpose": "Improves voice chat quality by reducing lag and enhancing clarity during conversations."
  },
  "FFlagRemoveLeaveShortcutFromLeaveConfirm": {
    "mechanism": "Removes the shortcut option to leave a game from the confirmation dialog.",
    "purpose": "Prevents accidental game exits, ensuring players stay in the game longer."
  },
  "FFlagPurchasePromptPriceShouldUseProductInfoPrice2": {
    "mechanism": "Updates the purchase prompt to display the correct price based on product information.",
    "purpose": "Ensures players see accurate pricing when making purchases, reducing confusion."
  },
  "FFlagEngineVoiceChatClientRewriteIxpEnabled_IXP": {
    "mechanism": "Enables a rewritten version of the voice chat client for better performance.",
    "purpose": "Enhances the overall voice chat experience with improved reliability and features."
  },
  "DFIntDataStoreFixedRequestLimit_PlaceFilter": {
    "mechanism": "Imposes a fixed limit on data store requests with a filter for specific places.",
    "purpose": "Optimizes data retrieval for games, ensuring smoother gameplay and faster loading times."
  },
  "FFlagNetworkInterface": {
    "mechanism": "Implements a new way for game servers to communicate with clients more efficiently.",
    "purpose": "Improves game performance and reduces lag for players."
  },
  "FFlagConvertVariantToCorrectType": {
    "mechanism": "Automatically changes data types to match what is needed in the game.",
    "purpose": "Ensures smoother gameplay by preventing errors related to data types."
  },
  "FFlagSduiComponentSkipParseLocalProps": {
    "mechanism": "Optimizes how UI components handle local properties, skipping unnecessary checks.",
    "purpose": "Makes the user interface faster and more responsive for players."
  },
  "DFFlagAndroidDebugHeapTelemetry": {
    "mechanism": "Collects data on memory usage for debugging on Android devices.",
    "purpose": "Helps developers fix issues, leading to a more stable experience for players on Android."
  },
  "FFlagAXCategoryPillColorAnimation": {
    "mechanism": "Adds animations to color changes for UI elements in the game.",
    "purpose": "Enhances the visual appeal of the game interface, making it more engaging for players."
  },
  "FFlagFixIsrDeferredPropResize": {
    "mechanism": "Fixes a delay in resizing properties in the user interface.",
    "purpose": "Improves the responsiveness of UI elements for a smoother experience."
  },
  "FFlagRefactorIsTopBarFocused": {
    "mechanism": "Reorganizes how the focus state of the top navigation bar is managed.",
    "purpose": "Enhances user interaction with the top bar, making it easier to use."
  },
  "DFFlagSkipSavingEmptyCapture": {
    "mechanism": "Prevents saving empty screenshots to reduce unnecessary data storage.",
    "purpose": "Saves storage space and improves performance by avoiding clutter."
  },
  "FFlagCorrectGuiStateMouseDownAndroid": {
    "mechanism": "Fixes issues with mouse down events in the GUI on Android devices.",
    "purpose": "Ensures touch interactions work correctly, improving gameplay on Android."
  },
  "DFFlagRemoveTemporaryScreenshotFilePresave_Staged": {
    "mechanism": "Eliminates the temporary files created before saving screenshots.",
    "purpose": "Streamlines the screenshot process, making it faster and more efficient."
  },
  "FFlagEnableAppChatFocusableFixes2": {
    "mechanism": "Improves focus handling in the app chat interface.",
    "purpose": "Makes it easier for players to interact with chat while using the app."
  },
  "FIntServerTriggeredModalTrafficPercent": {
    "mechanism": "Adjusts the percentage of players who see server-triggered pop-ups.",
    "purpose": "Helps manage how often players encounter important notifications."
  },
  "DFIntJoinLimitWin32x64": {
    "mechanism": "Sets a limit on the number of players joining from 64-bit Windows systems.",
    "purpose": "Ensures smoother gameplay by controlling server load."
  },
  "FFlagBuyActionBarShouldNotUnrenderInFullscreenMode": {
    "mechanism": "Prevents the buy action bar from disappearing when in fullscreen mode.",
    "purpose": "Allows players to access buying options without interruptions while playing."
  },
  "DFIntProductInfoBatchingMaxSize_PlaceFilter": {
    "mechanism": "Defines the maximum size for batching product information related to place filtering.",
    "purpose": "Improves performance when loading product details for players."
  },
  "DFFlagRemoveTemporaryScreenshotFilePresave": {
    "mechanism": "Disables the creation of temporary screenshot files before saving.",
    "purpose": "Reduces clutter and improves performance when taking screenshots."
  },
  "FFlagLuaAppAddSortDataToSocialCarouselClicks": {
    "mechanism": "Enhances data handling for social interactions in the app.",
    "purpose": "Improves the organization of friends and social features for easier access."
  },
  "FFlagCapturesAddSavePromptVideoLog": {
    "mechanism": "Introduces a prompt to save video logs after capturing gameplay.",
    "purpose": "Ensures players can easily save and review their gameplay recordings."
  },
  "FFlagAddFriendsEmptyStateUpdate": {
    "mechanism": "Updates the display when there are no friends added.",
    "purpose": "Provides a clearer message to encourage players to add friends."
  },
  "DFIntJoinLimitWin32x64_Staged": {
    "mechanism": "Sets a limit on the number of players that can join a game on a specific platform.",
    "purpose": "Helps manage server performance and ensures a smoother experience for players."
  },
  "FFlagEnableProfilePlatformDualCta_v5": {
    "mechanism": "Enables two call-to-action buttons on user profiles for different platforms.",
    "purpose": "Allows players to easily access platform-specific features or actions."
  },
  "FFlagFixHapticWaveformReplication": {
    "mechanism": "Improves the way haptic feedback is sent to devices, ensuring it matches the intended experience.",
    "purpose": "Enhances the tactile feedback players feel, making gameplay more immersive."
  },
  "FStringTutorialUpsellPlaceId": {
    "mechanism": "Links a specific tutorial place to the upsell feature for new players.",
    "purpose": "Encourages new players to try out tutorials, improving their onboarding experience."
  },
  "FFlagUITextureRendererUseNewRenderPath": {
    "mechanism": "Switches to a new method for rendering user interface textures.",
    "purpose": "Improves the visual quality and performance of UI elements for players."
  },
  "FFlagEnableConfirmButtonIconOnPlaystation": {
    "mechanism": "Adds a confirm button icon specifically for PlayStation controllers.",
    "purpose": "Makes it clearer for PlayStation players which button to press, improving usability."
  },
  "FFlagEnableCVSUrlForOtaPatch": {
    "mechanism": "Enables a URL for downloading updates directly from the cloud.",
    "purpose": "Allows players to receive game updates more efficiently."
  },
  "FFlagAXDisableHiddenCatalogCategoryPills": {
    "mechanism": "Removes hidden category indicators from the catalog interface.",
    "purpose": "Simplifies the catalog experience for players by showing only relevant categories."
  },
  "FFlagPlaceVersionHistoryMetadataRCC_Staged": {
    "mechanism": "Adds version history metadata to places for better tracking.",
    "purpose": "Helps players understand the changes made to games over time."
  },
  "FFlagEnableNoiseReductionForAudioDeviceInput": {
    "mechanism": "Implements noise reduction technology for audio input devices.",
    "purpose": "Improves voice chat clarity for players by reducing background noise."
  },
  "FFlagSelfieConsentDontMountUnused": {
    "mechanism": "Prevents unused selfie features from being activated.",
    "purpose": "Enhances privacy by ensuring only necessary features are available to players."
  },
  "FFlagVideoEncoderScopedOutputBuffer": {
    "mechanism": "Improves how video data is processed and stored temporarily.",
    "purpose": "Enhances video quality and performance for players during gameplay."
  },
  "FFlagAddDismissTopBarFocus": {
    "mechanism": "Adds a feature to easily remove focus from the top bar interface.",
    "purpose": "Makes it easier for players to interact with the game without distractions."
  },
  "FFlagAXQuickButtonsFrameShouldAlwaysExist": {
    "mechanism": "Ensures that a specific button frame is always available in the user interface.",
    "purpose": "Provides consistent access to quick actions for players, improving usability."
  },
  "DFStringLoadTestName_PlaceFilter": {
    "mechanism": "Introduces a filter for testing place names in the loading process.",
    "purpose": "Helps improve the loading experience by ensuring only relevant places are shown."
  },
  "FFlagUKOSALegacyReportMenu_Staged": {
    "mechanism": "Updates the reporting menu for user-generated content to a new version.",
    "purpose": "Streamlines the reporting process for players, making it easier to report issues."
  },
  "FFlagAXFixManageOutfitPageFocusLostBehind": {
    "mechanism": "Fixes focus issues on the outfit management page when interacting with other UI elements.",
    "purpose": "Improves user experience by ensuring that players can easily navigate and manage their outfits without losing focus."
  },
  "DFFlagRbxStorageRemoveOldCacheSkipEmpty": {
    "mechanism": "Removes outdated cached data from storage, skipping empty entries to optimize performance.",
    "purpose": "Enhances game loading times and reduces storage clutter, leading to a smoother experience for players."
  },
  "FFlagCleanUpMouseWrapMode": {
    "mechanism": "Refines the mouse wrapping behavior in the game, ensuring it functions correctly across different scenarios.",
    "purpose": "Provides a more intuitive and seamless control experience for players when using the mouse."
  },
  "FFlagLuaAppRecommendedGamesCollectionCarousel": {
    "mechanism": "Introduces a carousel feature for displaying recommended games in the Lua app.",
    "purpose": "Helps players discover new games easily by showcasing recommendations in an engaging format."
  },
  "FFlagDisableEtcFallback": {
    "mechanism": "Disables fallback mechanisms for certain features, streamlining the system's response.",
    "purpose": "Improves reliability and performance by reducing unnecessary fallback actions, enhancing gameplay consistency."
  },
  "FFlagFoundationPseudoChildSelectors": {
    "mechanism": "Enables the use of pseudo-child selectors in UI styling.",
    "purpose": "Allows developers to create more complex and visually appealing user interfaces."
  },
  "FFlagAXSavePreviousPageFromQuickMenu": {
    "mechanism": "Saves the last page accessed in the quick menu for easier navigation.",
    "purpose": "Helps players quickly return to their last used menu page, improving user experience."
  },
  "FFlagReconnectToSameServer": {
    "mechanism": "Allows players to reconnect to the same game server after a disconnection.",
    "purpose": "Ensures players can continue their game without losing progress when they reconnect."
  },
  "FFlagLuaAppAddSchemaFieldsToGameClicks": {
    "mechanism": "Adds additional data fields to track player interactions with games.",
    "purpose": "Provides developers with better insights into player behavior, helping improve games."
  },
  "FFlagIsrMainMetrics": {
    "mechanism": "Tracks main performance metrics for the platform.",
    "purpose": "Helps ensure a smoother gaming experience by monitoring and optimizing performance."
  },
  "FFlagReCacheIconsOnThemeChange": {
    "mechanism": "Rebuilds icon caches when the theme changes.",
    "purpose": "Ensures icons match the new theme for a consistent look."
  },
  "FFlagAXCatalogCategoryPillsShowAllCategory": {
    "mechanism": "Displays all categories in the catalog with pills.",
    "purpose": "Makes it easier for players to find items across all categories."
  },
  "FFlagReverbAbsorptionField": {
    "mechanism": "Implements a new audio feature for sound absorption.",
    "purpose": "Enhances sound quality in games by simulating realistic audio environments."
  },
  "FIntOcclusionSolverInitialMaxSearchIterations": {
    "mechanism": "Adjusts the number of iterations for solving occlusion.",
    "purpose": "Improves performance and accuracy in rendering scenes."
  },
  "DFFlagMoveOctreeChecks": {
    "mechanism": "Changes how spatial checks are performed in the octree.",
    "purpose": "Optimizes game performance by improving object management in 3D space."
  },
  "FFlagVoiceChatClientRewrite_OneFlagToRuleThemAll_Client2_IXP": {
    "mechanism": "Updates the voice chat system to improve performance and reliability.",
    "purpose": "Enhances the voice chat experience for players, making it clearer and more stable."
  },
  "FFlagAXDisableGamepadPanning": {
    "mechanism": "Disables the automatic panning feature when using a gamepad.",
    "purpose": "Gives players more control over their camera movement while using a gamepad."
  },
  "FFlagLuaAppAddSortDataToPymkCarouselClicks": {
    "mechanism": "Adds sorting functionality to the data collected from carousel clicks in Lua applications.",
    "purpose": "Improves the organization and relevance of content shown to players in the carousel."
  },
  "DFIntTextChatCommandClientSentThrottlePermyriad": {
    "mechanism": "Limits the number of chat commands a player can send within a certain timeframe.",
    "purpose": "Prevents spam in chat, making conversations more manageable and enjoyable for players."
  },
  "FFlagVoiceChatEnableSdpCompressionMaster3_Staged": {
    "mechanism": "Implements compression techniques for voice data to reduce bandwidth usage.",
    "purpose": "Improves voice chat quality while using less internet data, benefiting players with limited connections."
  },
  "FFlagDisableGalleryStopGap": {
    "mechanism": "Disables a temporary solution that was preventing certain gallery features from functioning.",
    "purpose": "Allows players to access and use gallery features without interruptions."
  },
  "FFlagLuauOccursCheckInCommit": {
    "mechanism": "Implements a check in the Luau scripting engine to ensure code changes are correctly processed.",
    "purpose": "Improves the reliability of scripts, making gameplay smoother and reducing errors."
  },
  "DFFlagInferredCrashReportToBacktraceRegister": {
    "mechanism": "Automatically sends crash reports to a tracking system for better analysis.",
    "purpose": "Helps developers fix issues faster, leading to a more stable gaming experience for players."
  },
  "FFlagISREarlyFilterAnimatedJoints": {
    "mechanism": "Introduces an early filtering system for animated joints in character models.",
    "purpose": "Enhances the visual quality of animations, making characters look more realistic during gameplay."
  },
  "FFlagSolverV2RefactorReplicationStateUpdate": {
    "mechanism": "Refactors how game state updates are replicated across players in the game.",
    "purpose": "Ensures that all players see the same game state, improving fairness and consistency in multiplayer experiences."
  },
  "FFlagAXCategoryPillPositionAnimation": {
    "mechanism": "Enables animations for category pill positioning in the UI.",
    "purpose": "Makes the user interface smoother and more visually appealing when navigating categories."
  },
  "FFlagLuaAppFixSearchTextBoxWidth": {
    "mechanism": "Adjusts the width of the search text box in the Lua app.",
    "purpose": "Improves usability by ensuring the search box is appropriately sized for better user experience."
  },
  "AndroidAddActivityManagerMemoryClassifications": {
    "mechanism": "N/A (invalid)",
    "purpose": "N/A (invalid)"
  },
  "FFlagAXEnableItemDetailsTryOnPage2": {
    "mechanism": "Activates the item details feature on the second page of the try-on section.",
    "purpose": "Allows players to view detailed information about items they are trying on, enhancing the shopping experience."
  },
  "FFlagVideoGamePreviewSessionTracking_Staged": {
    "mechanism": "Tracks video game preview sessions in a staged environment.",
    "purpose": "Helps developers understand player engagement with previews, leading to better game recommendations."
  },
  "FStringTextureTranscodeFidelityETC": {
    "mechanism": "Improves the quality of texture compression for better visuals.",
    "purpose": "Players experience higher quality graphics in games."
  },
  "FFlagAXMigrateCenteredModalViewToAutoFocus": {
    "mechanism": "Changes how modal views are displayed to automatically focus on the main content.",
    "purpose": "Players can interact with pop-up menus more easily without manual adjustments."
  },
  "FFlagEnableAppNavGamepadRemoval": {
    "mechanism": "Removes the gamepad navigation option from the app interface.",
    "purpose": "Players using touch devices will have a cleaner and more streamlined navigation experience."
  },
  "DFIntBadgeServiceMaximumBadgeGetCount_PlaceFilter": {
    "mechanism": "Sets a limit on how many badges can be retrieved based on specific place filters.",
    "purpose": "Players will receive a more relevant selection of badges based on the game they are in."
  },
  "DFStringFlipTimeStampDynamicString": {
    "mechanism": "Updates the way timestamps are displayed dynamically in the interface.",
    "purpose": "Players see more accurate and user-friendly time information in their game interactions."
  },
  "DFFlagISRPerfPass": {
    "mechanism": "N/A (invalid)",
    "purpose": "N/A (invalid)"
  },
  "UseApplicationLifecycleCallbacks": {
    "mechanism": "N/A (invalid)",
    "purpose": "N/A (invalid)"
  },
  "FFlagAddFriendsConsistentFocusActions": {
    "mechanism": "N/A (invalid)",
    "purpose": "N/A (invalid)"
  },
  "FFlagAXCategoryPillColorAnimationInstantOff_Staged": {
    "mechanism": "N/A (invalid)",
    "purpose": "N/A (invalid)"
  },
  "FFlagLuaAppEdpBackendV2HydrateLegacyIxp4": {
    "mechanism": "N/A (invalid)",
    "purpose": "N/A (invalid)"
  },
  "DFStringLoadTestArguments_PlaceFilter": {
    "mechanism": "Filters places based on specific arguments during load testing.",
    "purpose": "Helps developers test and optimize specific game areas more effectively."
  },
  "FFlagProfilePlatformEnableChipSocialRow_v6_IXP": {
    "mechanism": "Enables a new social feature layout in user profiles.",
    "purpose": "Improves how players connect and interact with friends on their profiles."
  },
  "FFlagAppChatConversationOverlayRefactor": {
    "mechanism": "Redesigns the chat overlay for better performance and usability.",
    "purpose": "Enhances the chat experience, making it easier for players to communicate."
  },
  "FStringIxpNewLayersForRegistration": {
    "mechanism": "Introduces new layers in the registration process for better data handling.",
    "purpose": "Streamlines the sign-up process, making it faster and more user-friendly."
  },
  "FFlagLrMainMetrics": {
    "mechanism": "Tracks key performance metrics for the platform.",
    "purpose": "Provides insights that help improve the overall player experience."
  },
  "FFlagLuaAppSupportEmptyStringFooterMetadata": {
    "mechanism": "Allows empty string metadata in Lua applications.",
    "purpose": "Improves flexibility for developers in managing app metadata."
  },
  "DFIntDataStoreOrderedGetFixedRequestLimit_PlaceFilter": {
    "mechanism": "Adjusts the request limit for fetching ordered data in data stores with place filters.",
    "purpose": "Enhances performance and efficiency when retrieving game data."
  },
  "FFlagFallbackGenericAbuseReporting": {
    "mechanism": "Enables a fallback system for reporting abuse when the primary method fails.",
    "purpose": "Ensures players can still report issues effectively, improving safety."
  },
  "FFlagLuauRefineDistributesOverUnions": {
    "mechanism": "Improves type checking in Luau by refining types over union types.",
    "purpose": "Enhances code safety and reduces errors for developers."
  },
  "FFlagVideoGamePreviewSessionTracking": {
    "mechanism": "Tracks sessions for video game previews to gather usage data.",
    "purpose": "Provides developers with insights on player engagement with previews."
  },
  "FFlagPassTextAlignmentRelevancyInfo": {
    "mechanism": "Enhances text alignment settings by passing relevant information to the rendering engine.",
    "purpose": "Improves the visual layout of text in games, making it more readable and aesthetically pleasing."
  },
  "FFlagPerfDataOnTelemetryV2": {
    "mechanism": "Updates performance data collection methods to a new version for better accuracy.",
    "purpose": "Allows developers to receive more reliable performance metrics, helping them optimize their games."
  },
  "FFlagColorPickerUseGridLayout": {
    "mechanism": "Changes the layout of the color picker to a grid format for easier navigation.",
    "purpose": "Makes it simpler for players to select colors, enhancing the customization experience."
  },
  "FFlagUnsyncBreakpointsInClonedScripts": {
    "mechanism": "Prevents breakpoints in cloned scripts from being synchronized, allowing for independent debugging.",
    "purpose": "Gives developers more control over debugging processes, leading to faster issue resolution."
  },
  "FFlagPerformanceTelemetryHandleSpuriousWake": {
    "mechanism": "Improves how performance telemetry handles unexpected wake events to reduce noise in data.",
    "purpose": "Provides clearer performance insights for developers, helping them identify real issues more effectively."
  },
  "FFlagAXUseDefaultFocusHandlerInFocusedWidgetTopContent": {
    "mechanism": "Uses a standard method to manage focus in specific UI elements.",
    "purpose": "Improves navigation and accessibility for players using keyboard controls."
  },
  "FFlagChatIntegrationFixShortcut": {
    "mechanism": "Fixes a shortcut key issue in the chat system.",
    "purpose": "Enhances the chat experience by ensuring shortcuts work correctly for easier communication."
  },
  "FFlagVoiceAddWebrtClosedTransitionEnabled": {
    "mechanism": "Enables a smoother transition for voice chat using WebRTC technology.",
    "purpose": "Provides a better voice chat experience with less lag and clearer audio."
  },
  "DFIntLoadTestStartTimeUnix_PlaceFilter": {
    "mechanism": "Sets a specific start time for testing the loading of game places.",
    "purpose": "Helps developers optimize game loading times for players."
  },
  "FFlagAXMigrateCommunityAvatarEntryButtonToLocalRef": {
    "mechanism": "Moves the button for community avatar entry to a local reference.",
    "purpose": "Streamlines the process for players to access and customize their avatars."
  },
  "FFlagUITextureRendererUseNewRenderPath_Staged": {
    "mechanism": "Switches to a new method for rendering textures in the UI.",
    "purpose": "Improves the visual quality and performance of user interface elements."
  },
  "FFlagUIBloxTruncateExperienceTileMetadataTextFooter": {
    "mechanism": "Shortens the text displayed in the footer of experience tiles.",
    "purpose": "Creates a cleaner and more organized appearance for game listings."
  },
  "FFlagIsrMainMetrics_Staged": {
    "mechanism": "Enables tracking of key performance metrics for the platform.",
    "purpose": "Helps improve the overall experience by identifying and fixing performance issues."
  },
  "FFlagAXMigrateItemDetailsFullToAutoFocus": {
    "mechanism": "Changes how item details are displayed to automatically focus on important information.",
    "purpose": "Enhances user experience by making it easier to find and read item details."
  },
  "DFFlagAndroidOomScoreTelemetry": {
    "mechanism": "Collects data on memory usage and performance on Android devices.",
    "purpose": "Aims to optimize the app's performance and stability for Android users."
  },
  "FFlagAXCategoryPillInstantFadeOut": {
    "mechanism": "Enables instant fading out of category pills in the UI.",
    "purpose": "Improves visual transitions for a smoother user experience."
  },
  "FFlagRemoveRespawnShortcutFromRespawnConfirmation": {
    "mechanism": "Removes the shortcut option during respawn confirmation.",
    "purpose": "Ensures players make a conscious choice before respawning."
  },
  "DFIntRobloxTelemetryLoadTestStartThrottleHundredthsPercent_PlaceFilter": {
    "mechanism": "Adjusts the telemetry load test settings based on place filtering.",
    "purpose": "Helps optimize performance and stability during testing."
  },
  "FFlagDisableRejoinGroupIdDoubleRead": {
    "mechanism": "Prevents the system from reading group IDs twice.",
    "purpose": "Reduces errors related to group rejoining for players."
  },
  "FFlagCachelessPluginLoading2": {
    "mechanism": "Loads plugins without using cached data.",
    "purpose": "Ensures players always get the latest version of plugins."
  },
  "FFlagStudioUseUIThread": {
    "mechanism": "Enables the use of the UI thread for Studio operations.",
    "purpose": "Improves the responsiveness and performance of Roblox Studio."
  },
  "DFFlagVideoWinHwEncoderDeleteIfNoPool_Staged": {
    "mechanism": "Removes unused hardware encoder resources if no video pool is available.",
    "purpose": "Optimizes system resources for smoother video recording on Windows."
  },
  "FFlagNetworkInterface_Staged": {
    "mechanism": "Introduces a new network interface for better data handling.",
    "purpose": "Enhances the stability and speed of online gameplay."
  },
  "FStringFlagRepoGitHashFastString": {
    "mechanism": "Uses a fast string representation of the Git hash for versioning.",
    "purpose": "Improves performance in version tracking for developers."
  },
  "FFlagInitializeAutocompleteOnlyIfEnabledV3": {
    "mechanism": "Activates autocomplete features only if the new version is enabled.",
    "purpose": "Provides a more efficient coding experience in Roblox Studio."
  },
  "FFlagCommunicationsFixLastInputMode": {
    "mechanism": "Fixes how the last input mode is recorded in communication systems.",
    "purpose": "Ensures that player inputs are accurately captured, improving gameplay responsiveness."
  },
  "FFlagEnableAudioSpeechToText_PlaceFilter": {
    "mechanism": "Enables a filter for speech-to-text audio in specific places.",
    "purpose": "Allows players to use voice commands more effectively in certain game areas."
  },
  "DFIntISRInstanceBlockTimeoutWorldSteps": {
    "mechanism": "Adjusts the timeout settings for instance blocking during world updates.",
    "purpose": "Improves game performance by reducing delays in world interactions."
  },
  "DFFlagISRAdjustMtu": {
    "mechanism": "Modifies the Maximum Transmission Unit (MTU) settings for data packets.",
    "purpose": "Enhances network performance, leading to smoother gameplay experiences."
  },
  "FFlagAXDisableCategoryPillsOnCatalogSearch": {
    "mechanism": "Disables category pills in the catalog search interface.",
    "purpose": "Simplifies the search process for players, making it easier to find items."
  },
  "FFlagAXMarketplaceCategoryPillTooltip": {
    "mechanism": "Displays tooltips when hovering over marketplace category pills.",
    "purpose": "Helps players understand what each category represents."
  },
  "FFlagAXRemoveTryOnManagerAvatarScreen": {
    "mechanism": "Removes the try-on manager from the avatar customization screen.",
    "purpose": "Simplifies the avatar customization process for players."
  },
  "DFFlagSolverV2CleanupPendingModelStreamingModeModels": {
    "mechanism": "Improves the management of streaming models in the game.",
    "purpose": "Enhances game performance and reduces loading times for players."
  },
  "FFlagVideoWinEncodeSampleTracking": {
    "mechanism": "Tracks video encoding samples for performance analysis.",
    "purpose": "Ensures smoother video playback for players."
  },
  "FFlagPassTextAlignmentRelevancyInfo_Staged": {
    "mechanism": "Adjusts text alignment settings for game passes.",
    "purpose": "Improves the visual presentation of game passes for players."
  },
  "FFlagStudioFixStandalonePluginUnloadingAsync3": {
    "mechanism": "Improves the process of unloading plugins in Studio to be asynchronous.",
    "purpose": "Reduces delays and improves the overall responsiveness of Roblox Studio when managing plugins."
  },
  "FFlagReverbAbsorptionFieldFileFormat": {
    "mechanism": "Introduces a new file format for handling reverb absorption data.",
    "purpose": "Enhances audio quality in games by allowing more accurate sound effects related to environment acoustics."
  },
  "FFlagFFlagFixLayeredSorting": {
    "mechanism": "Fixes issues with how layered objects are sorted visually in the game.",
    "purpose": "Ensures that players see objects in the correct order, improving the visual experience and gameplay clarity."
  },
  "DFIntRobloxTelemetryLoadTestEndThrottleHundredthsPercent_PlaceFilter": {
    "mechanism": "Applies a filter to telemetry data during load tests to manage performance.",
    "purpose": "Helps developers understand game performance better by providing cleaner data during testing."
  },
  "DFFlagUseVisBugChecks_PlaceFilter": {
    "mechanism": "Enables checks for visual bugs in games during development.",
    "purpose": "Helps developers identify and fix visual issues before players encounter them, leading to a smoother gaming experience."
  },
  "FFlagAXMIgrateItemDetailsModalToAutofocus": {
    "mechanism": "Changes the item details modal to automatically focus on the input field when opened.",
    "purpose": "Makes it easier for players to start typing without having to click on the input field first."
  },
  "DFFlagISRDoNotCrashCanSkipNewInstanceCheckIfPropNull": {
    "mechanism": "Prevents the system from crashing by allowing it to skip checks if a certain property is null.",
    "purpose": "Improves game stability by reducing the chances of crashes during gameplay."
  },
  "FFlagFFlagIconHostSetZIndexToDefault": {
    "mechanism": "Sets the z-index of icon hosts to a default value for better layering.",
    "purpose": "Ensures icons display correctly on top of other elements, enhancing visual clarity."
  },
  "FFlagCustomDspBaseSupportsSidechain": {
    "mechanism": "Enables sidechain support in the custom DSP (Digital Signal Processing) base.",
    "purpose": "Allows for more advanced audio effects, improving the overall sound experience in games."
  },
  "DFStringFlagRepoGitHashDynamicString": {
    "mechanism": "Uses a dynamic string to represent the Git hash of the repository.",
    "purpose": "Helps developers track changes and versions more effectively, ensuring smoother updates."
  },
  "FFlagAXMigrateResellersCardToAutofocus": {
    "mechanism": "Changes the focus behavior of reseller cards to automatically focus on them when opened.",
    "purpose": "Makes it easier for players to interact with reseller cards without needing to click on them first."
  },
  "FStringFlipTimeStampFastString": {
    "mechanism": "Optimizes how timestamps are processed in strings for faster performance.",
    "purpose": "Improves the speed of displaying time-related information in games."
  },
  "FFlagAXExternalItemDetailsOverlay": {
    "mechanism": "Introduces a new overlay to show detailed information about external items.",
    "purpose": "Enhances the shopping experience by providing more information about items before purchase."
  },
  "FFlagExtendLightRangeTo120HideRolloutPropertyAndEnable": {
    "mechanism": "Increases the range of light sources in the game to 120 units and hides certain settings.",
    "purpose": "Allows for better lighting effects in games, improving visual quality."
  },
  "FFlagAXFixFocusNavigationShiftingWidgetList": {
    "mechanism": "Fixes issues with focus navigation that caused widgets to shift unexpectedly.",
    "purpose": "Ensures a smoother and more predictable navigation experience for players using widgets."
  },
  "DFFlagISRBlockStaleCFrameImprovements": {
    "mechanism": "Improves how the game handles outdated position data for objects.",
    "purpose": "Enhances game stability and performance by reducing glitches related to object positioning."
  },
  "FFlagExtendedLightRangesFixDirtyCrash": {
    "mechanism": "Fixes issues with light rendering that could cause the game to crash.",
    "purpose": "Provides a smoother visual experience by preventing crashes related to lighting."
  },
  "FFlagAddTopBarScrim": {
    "mechanism": "Introduces a new overlay on the top bar of the game interface.",
    "purpose": "Improves user interface aesthetics and usability, making it easier for players to navigate."
  },
  "DFIntProductIdProductInfoCacheLifetimeSeconds_PlaceFilter": {
    "mechanism": "Adjusts how long product information is stored in memory for quick access.",
    "purpose": "Speeds up the loading of product details, enhancing the shopping experience for players."
  },
  "FFlagVoiceChatEnableSdpCompressionMaster3_IXP": {
    "mechanism": "Implements a more efficient way to transmit voice data.",
    "purpose": "Improves voice chat quality and reduces lag, making communication smoother for players."
  },
  "FFlagAXCategoryPillAnimationsUserMotionSettings": {
    "mechanism": "Enables animations for category pills based on user motion settings.",
    "purpose": "Improves visual feedback and interaction for users when navigating categories."
  },
  "DFFlagProductInfoBatchingEnabled2_PlaceFilter": {
    "mechanism": "Allows batching of product information requests with a filter for places.",
    "purpose": "Enhances performance by reducing load times when accessing product info in specific places."
  },
  "DFFlagBacktraceAPIQueryParamFix": {
    "mechanism": "N/A (invalid)",
    "purpose": "N/A (invalid)"
  },
  "DFIntLoadTestParticipationPerMillionUsers_PlaceFilter": {
    "mechanism": "Sets a limit on how many users can participate in load tests based on place filters.",
    "purpose": "Helps manage server load during testing, ensuring a smoother experience for players."
  },
  "FFlagAXMigrateItemOwnerShipPageToAutofocus": {
    "mechanism": "Migrates the item ownership page to use autofocus for input fields.",
    "purpose": "Streamlines the user experience by automatically focusing on input fields for quicker access."
  },
  "DFFlagSkipSavingEmptyCapture_Staged": {
    "mechanism": "Prevents saving when there are no changes to capture.",
    "purpose": "Reduces unnecessary save operations, making the game run smoother."
  },
  "FFlagReconnectToSameServer_Staged": {
    "mechanism": "Allows players to reconnect to the same game server after disconnecting.",
    "purpose": "Helps players return to their game without losing progress."
  },
  "FFlagStudioFixStandalonePluginUnloadingAsync3_Staged": {
    "mechanism": "Improves the process of unloading plugins in standalone mode.",
    "purpose": "Enhances the stability of the development environment for creators."
  },
  "FFlagEnableSpatialUIScalingFix": {
    "mechanism": "Adjusts UI elements based on the player's screen size.",
    "purpose": "Ensures that user interfaces look good on all devices."
  },
  "FFlagPlaceVersionHistoryMetadataRCC": {
    "mechanism": "Adds metadata to track changes in place versions.",
    "purpose": "Helps developers manage and understand changes in their game versions."
  },
  "FFlagUIEditorActionURI": {
    "mechanism": "Enables specific actions in the UI editor to use unique URIs for better linking.",
    "purpose": "Allows users to easily navigate and perform actions within the UI editor."
  },
  "FFlagAXCategoryPillColorAnimationInstantOff": {
    "mechanism": "Disables the animation for category pill color changes in the UI.",
    "purpose": "Provides a more immediate visual response when selecting categories, improving user experience."
  },
  "FFlagEnableProfilePlatformDualCta_v5_Staged": {
    "mechanism": "Introduces a dual call-to-action button on player profiles for better engagement.",
    "purpose": "Encourages players to take actions like following or messaging other players more easily."
  },
  "DFStringDataStoreRdbShadowTrafficRolloutConfig_PlaceFilter": {
    "mechanism": "Implements a filtering system for data storage based on specific places.",
    "purpose": "Improves data management and performance for games by optimizing how data is stored."
  },
  "DFIntAcousticSimulationForegroundCost": {
    "mechanism": "Adjusts the computational cost of simulating sound in the game environment.",
    "purpose": "Enhances audio realism while balancing performance, ensuring a better gaming experience."
  },
  "FFlagUIBloxFixModalBottomSheetSelectable": {
    "mechanism": "Fixes the selection behavior of modal bottom sheets in the UI framework.",
    "purpose": "Improves user interaction by allowing players to select options more easily in modal dialogs."
  },
  "FFlagLuaAppShowAgeRatingWithPlayButtonOnTileHoverWithHiddenMetadata": {
    "mechanism": "Displays age ratings alongside play buttons when hovering over game tiles, even if metadata is hidden.",
    "purpose": "Helps players quickly see age ratings of games, ensuring they choose appropriate content."
  },
  "FFlagSelfieConsentDialogDontUsePortal": {
    "mechanism": "Removes the use of a portal for the selfie consent dialog, making it a direct interaction.",
    "purpose": "Streamlines the process of giving consent for taking selfies, making it more user-friendly."
  },
  "FIntServerTriggeredModalTrafficPercent_Staged": {
    "mechanism": "Adjusts the percentage of players who see server-triggered modal dialogs based on a set traffic percentage.",
    "purpose": "Allows for controlled testing of modal dialogs to improve player experience without overwhelming all users."
  },
  "FFlagEnableClientSettingAPIInProduction_IXP": {
    "mechanism": "Activates the client settings API in the live environment for better configuration management.",
    "purpose": "Enables players to have more personalized settings and configurations in the game."
  },
  "FFlagEnableCVSUrlForOtaPatch_Staged": {
    "mechanism": "Enables a new URL format for over-the-air updates.",
    "purpose": "Improves the delivery of game updates to players."
  },
  "FixIsolatedGmaSdkCleanDisconnect": {
    "mechanism": "N/A (invalid)",
    "purpose": "N/A (invalid)"
  },
  "DFFlagVideoWinHwEncoderDeleteIfNoPool": {
    "mechanism": "Removes unused hardware video encoders to free up resources.",
    "purpose": "Enhances performance by optimizing video processing."
  },
  "FFlagAXCategoryPillPadding": {
    "mechanism": "Adjusts the padding around category labels in the UI.",
    "purpose": "Improves the visual layout for better readability."
  },
  "FFlagInternalExportHandleMisnamedR15Bones": {
    "mechanism": "Fixes issues with exporting models that have incorrectly named bones.",
    "purpose": "Ensures models work correctly in games without errors."
  },
  "FFlagAndroidTrimMemoryCounters": {
    "mechanism": "Tracks memory usage on Android devices to optimize performance.",
    "purpose": "Helps improve game performance on Android by managing memory better."
  },
  "FFlagEnableAutomaticGainControlForAudioDeviceInput": {
    "mechanism": "Automatically adjusts audio input levels for better sound quality.",
    "purpose": "Ensures clearer voice chat and audio input for players."
  },
  "FFlagMigrateEmptyResultsViewToFoundation": {
    "mechanism": "Updates the display for empty search results to a new system.",
    "purpose": "Provides a cleaner and more user-friendly experience when no results are found."
  },
  "DFFlagCLI169073": {
    "mechanism": "Enables a specific command line interface feature for developers.",
    "purpose": "Improves tools for developers, which can lead to better games for players."
  },
  "FFlagCreateConnectionInternalEarlierServer": {
    "mechanism": "Establishes server connections earlier in the game loading process.",
    "purpose": "Reduces waiting time for players when joining games."
  },
  "DFIntAssetProviderCdnBytesThrottleHundrethsPercent2": {
    "mechanism": "Limits the amount of data sent from the asset provider to optimize performance.",
    "purpose": "Improves loading times and reduces lag for players."
  },
  "DFFlagAudioSpeechToTextRequireVoiceChat2": {
    "mechanism": "Requires players to use voice chat for audio-to-text features.",
    "purpose": "Enhances communication by allowing text transcription of spoken words."
  },
  "FFlagUseClientSettingAPI_IXP": {
    "mechanism": "Utilizes a new API for managing client settings more efficiently.",
    "purpose": "Provides a smoother and more customizable experience for players."
  },
  "FFlagVoiceAddWebrtClosedTransitionEnabled_Staged": {
    "mechanism": "Implements a new transition for voice features using WebRTC technology.",
    "purpose": "Improves the quality and reliability of voice communication in games."
  },
  "FFlagUpdateViewportOnUse3DPanelsChanged": {
    "mechanism": "Updates the game viewport when 3D panels are used.",
    "purpose": "Enhances visual experience and interaction with 3D elements in games."
  },
  "DFFlagEditableMeshFastClusterSkipLoD": {
    "mechanism": "Improves performance by skipping certain levels of detail for editable meshes.",
    "purpose": "Players experience smoother gameplay with less lag when using complex models."
  },
  "FFlagAddSwitchTabHintsToIEM2": {
    "mechanism": "Introduces visual hints for switching tabs in the interface.",
    "purpose": "Helps players navigate the interface more easily, enhancing user experience."
  },
  "FFlagAXAddOverlayFocusHandlerToPurchaseLookPrompt": {
    "mechanism": "Adds a focus handler for overlay prompts during purchases.",
    "purpose": "Ensures players can easily interact with purchase prompts without confusion."
  },
  "FFlagUKOSALegacyReportMenu": {
    "mechanism": "Reverts the reporting menu to an older version for compatibility.",
    "purpose": "Provides a familiar reporting experience for players who prefer the old layout."
  },
  "FFlagStudioUseUIThread_Staged": {
    "mechanism": "Utilizes the UI thread for smoother rendering in Studio.",
    "purpose": "Improves the development experience by making the interface more responsive."
  },
  "FFlagIncreaseEffectiveLightGridRadius": {
    "mechanism": "Increases the radius around each light source for better illumination.",
    "purpose": "Enhances the lighting in games, making environments look brighter and more realistic."
  },
  "FFlagLrMainMetrics_Staged": {
    "mechanism": "Implements a new system for tracking player engagement metrics.",
    "purpose": "Provides developers with better insights into player behavior, helping them improve game experiences."
  }
}