{
  "FFlagCallVoiceLeaveOnNetworkDisconnect2": {
    "mechanism": "Automatically ends voice calls when the network connection is lost.",
    "purpose": "Prevents players from being stuck in a voice call when they lose internet access."
  },
  "FFlagMicroprofilerBigButtons_Staged": {
    "mechanism": "Introduces larger buttons in the microprofiler tool for easier interaction.",
    "purpose": "Makes it simpler for developers to analyze performance data."
  },
  "FFlagAXUnifiedLoggingValidation1_Staged": {
    "mechanism": "Enhances the logging system to ensure data is correctly validated.",
    "purpose": "Improves the reliability of data collected for debugging and performance tracking."
  },
  "FFlagAXCatalogReactPerfIXPEnabledV3_Staged": {
    "mechanism": "Optimizes the catalog interface using React for better performance.",
    "purpose": "Provides a smoother and faster experience when browsing items in the catalog."
  },
  "FFlagStudioTasksFutureShareMutexes_Staged": {
    "mechanism": "Implements mutexes to manage concurrent tasks in Studio.",
    "purpose": "Enhances stability and performance when multiple tasks are running simultaneously in Roblox Studio."
  },
  "DFFlagVoiceSdpCompressionRemoteEventFieldReceivesUnexpectedValue_Staged": {
    "mechanism": "Adjusts how voice data is compressed and transmitted to prevent errors.",
    "purpose": "Improves voice chat reliability by reducing unexpected issues during communication."
  },
  "FFlagVoiceConnectionApiSendSdpParsingErrorTelemetry": {
    "mechanism": "Sends error reports related to voice connection parsing to help identify issues.",
    "purpose": "Enhances voice chat stability by tracking and fixing connection problems."
  },
  "FFlagStudioTasksFutureShareMutexes": {
    "mechanism": "Implements locks for shared resources in Studio to prevent conflicts.",
    "purpose": "Improves performance and stability in Roblox Studio when multiple tasks are running."
  },
  "FFlagFixDisplaySizeVR2_Staged": {
    "mechanism": "Corrects the way display sizes are calculated for VR experiences.",
    "purpose": "Ensures a better visual experience in virtual reality by accurately scaling graphics."
  },
  "FFlagFixToggleMenuIconForTheFive_Staged": {
    "mechanism": "Updates the icon for a specific menu toggle to ensure it displays correctly.",
    "purpose": "Enhances user interface clarity by fixing visual elements in the game menu."
  },
  "DFStringFlagRepoGitHashDynamicString": {
    "mechanism": "Stores a dynamic string that represents the current version of the codebase.",
    "purpose": "Helps developers track changes and ensure players are using the latest features."
  },
  "DFFlagVoiceSdpCompressionSendProtoParseErrorTelemetry_Staged": {
    "mechanism": "Collects data on errors related to voice communication setup.",
    "purpose": "Improves voice chat reliability by identifying and fixing issues."
  },
  "DFIntLoadTestStartTimeUnix_PlaceFilter": {
    "mechanism": "Records the start time of load tests for specific game places.",
    "purpose": "Allows for better performance analysis and optimization of games."
  },
  "FFlagMediaPlaybackStopsWhenJoiningExperience_Staged": {
    "mechanism": "Automatically pauses media playback when a player joins a game.",
    "purpose": "Enhances player experience by preventing distractions during loading."
  },
  "FFlagRemoveUpdatePromptChild": {
    "mechanism": "Disables a prompt that asks players to update the game.",
    "purpose": "Reduces interruptions for players, allowing for smoother gameplay."
  },
  "FFlagFixDisplaySizeEnum_Staged": {
    "mechanism": "Corrects the way display sizes are categorized in the system.",
    "purpose": "Ensures players see accurate display size options for better game experience."
  },
  "FStringFlipTimeStampFastString": {
    "mechanism": "Optimizes how timestamps are processed in strings for faster performance.",
    "purpose": "Improves game loading times and responsiveness for players."
  },
  "FFlagSlimServiceEnableUploadsInNonEditMode_Staged": {
    "mechanism": "Allows users to upload assets even when not in edit mode.",
    "purpose": "Gives players more flexibility to add content without needing to enter edit mode."
  },
  "FFlagStudioActionsMultiplePayloads": {
    "mechanism": "Enables multiple actions to be processed at once in the studio.",
    "purpose": "Streamlines the development process, making it easier for creators to manage their projects."
  },
  "DFFlagVoiceSdpCompressionRemoteEventFieldReceivesUnexpectedValue": {
    "mechanism": "Fixes issues with unexpected data in voice communication events.",
    "purpose": "Enhances voice chat reliability for players during gameplay."
  },
  "DFFlagVoiceSdpCompressionSendSizeTelemetry_Staged": {
    "mechanism": "Tracks the size of voice data sent for compression.",
    "purpose": "Improves voice chat quality by optimizing data usage."
  },
  "FFlagAXCatalogCategoryPillsIXP": {
    "mechanism": "Introduces a new layout for catalog categories using pills.",
    "purpose": "Enhances navigation in the catalog for easier item discovery."
  },
  "FFlagFixDisplaySizeEnum": {
    "mechanism": "Corrects the enumeration of display sizes for devices.",
    "purpose": "Ensures that games display correctly on various screen sizes."
  },
  "FFlagAXCategoryPillScrollToStart_Staged": {
    "mechanism": "Allows scrolling to the start of category pills in the UI.",
    "purpose": "Improves user experience by making it easier to access the beginning of categories."
  },
  "FFlagAXUnifiedLoggingValidation1": {
    "mechanism": "Implements a unified system for logging data validation.",
    "purpose": "Enhances tracking of data issues to improve game stability."
  },
  "FFlagEnableSocialSelfProfileViewExposureEvents": {
    "mechanism": "Tracks when players view their own profiles for analytics.",
    "purpose": "Helps improve social features by understanding how players interact with their profiles."
  },
  "FFlagMediaPlaybackStopsWhenJoiningExperience": {
    "mechanism": "Pauses media playback when a player enters a new game.",
    "purpose": "Ensures a smoother transition without audio interruptions when switching experiences."
  },
  "FFlagProfilePlatformEnableClickToCopyUsername": {
    "mechanism": "Adds a feature to copy usernames with a click.",
    "purpose": "Makes it easier for players to share their usernames with others."
  },
  "FFlagCallVoiceLeaveOnNetworkDisconnect2_Staged": {
    "mechanism": "Automatically disconnects voice chat when the network connection drops.",
    "purpose": "Improves voice chat reliability by preventing lingering connections during network issues."
  },
  "DFFlagVoiceSdpCompressionSendProtoParseErrorTelemetry": {
    "mechanism": "Collects data on errors related to voice data compression.",
    "purpose": "Helps developers fix issues with voice chat quality and performance."
  },
  "FFlagNativeDialogManager": {
    "mechanism": "Implements a new system for managing dialog boxes natively within the platform.",
    "purpose": "Improves the appearance and functionality of pop-up dialogs for a smoother user experience."
  },
  "FFlagAXCategoryPillScrollToStart": {
    "mechanism": "Enables automatic scrolling to the start of category pills in the user interface.",
    "purpose": "Makes it easier for players to navigate through categories without manual scrolling."
  },
  "FFlagAXCatalogCategoryPillsIXP_Staged": {
    "mechanism": "Introduces a new method for displaying catalog category pills with enhanced interaction.",
    "purpose": "Enhances the browsing experience in the catalog, allowing players to find items more efficiently."
  },
  "DFStringFlipTimeStampDynamicString": {
    "mechanism": "Updates the way dynamic strings handle timestamps for better performance.",
    "purpose": "Ensures that time-related information is displayed more accurately and responsively for players."
  },
  "FFlagSTM6819Enabled_Staged": {
    "mechanism": "Activates a new system for managing state transitions within the game.",
    "purpose": "Provides a more seamless and responsive gameplay experience by improving how game states are handled."
  },
  "FFlagRemoveUpdatePromptChild_Staged": {
    "mechanism": "Removes the child update prompt from the user interface.",
    "purpose": "Reduces interruptions for players by eliminating unnecessary update notifications."
  },
  "FFlagAXCatalogReactPerfIXPEnabledV3": {
    "mechanism": "Implements performance improvements in the catalog using React technology.",
    "purpose": "Enhances the speed and responsiveness of the catalog for a smoother browsing experience."
  },
  "DFIntLoadTestParticipationPerMillionUsers_PlaceFilter": {
    "mechanism": "Adjusts the number of users participating in load tests based on place filters.",
    "purpose": "Ensures better performance and stability by testing with a targeted group of players."
  },
  "FFlagFixDisplaySizeVR2": {
    "mechanism": "Corrects the display size settings for virtual reality.",
    "purpose": "Improves the visual experience for VR players by ensuring proper scaling."
  },
  "FFlagProfilePlatformEnableClickToCopyUsername_Staged": {
    "mechanism": "Enables a feature that allows users to click and copy usernames easily.",
    "purpose": "Makes it simpler for players to share usernames without typing them out."
  },
  "FFlagVoiceConnectionApiSendSdpParsingErrorTelemetry_Staged": {
    "mechanism": "Tracks errors in parsing SDP data during voice connections.",
    "purpose": "Helps improve voice chat reliability by identifying issues."
  },
  "FFlagSlimServiceEnableUploadsInNonEditMode": {
    "mechanism": "Allows file uploads even when not in editing mode.",
    "purpose": "Enables players to upload content more freely without needing to be in edit mode."
  },
  "FFlagEnableSocialSelfProfileViewExposureEvents_Staged": {
    "mechanism": "Records when players view their own social profiles.",
    "purpose": "Provides insights to improve social features by understanding player behavior."
  },
  "FFlagNativeDialogManager_Staged": {
    "mechanism": "Implements a new system for managing dialog boxes in the game.",
    "purpose": "Enhances user experience by making dialog interactions smoother and more intuitive."
  },
  "DFFlagVoiceSdpCompressionSendSizeTelemetry": {
    "mechanism": "Monitors the size of compressed SDP data sent during voice communication.",
    "purpose": "Aims to optimize voice chat performance by analyzing data usage."
  },
  "FFlagMicroprofilerBigButtons": {
    "mechanism": "Enlarges buttons in the microprofiler tool for better visibility.",
    "purpose": "Makes it easier for developers to interact with performance metrics."
  },
  "FFlagSTM6819Enabled": {
    "mechanism": "Activates a new system for managing game state more efficiently.",
    "purpose": "Improves game performance and stability for players."
  },
  "FFlagStudioActionsMultiplePayloads_Staged": {
    "mechanism": "Allows multiple actions to be processed at once in the studio.",
    "purpose": "Streamlines the development process, making it faster for creators to build games."
  },
  "FStringFlagRepoGitHashFastString": {
    "mechanism": "Uses a quick reference for the version of the codebase.",
    "purpose": "Ensures players benefit from the latest updates and fixes in games."
  }
}