{
  "FFlagLuaAppAddSortDataToSocialCarouselClicks": {
    "mechanism": "Adds sorting data to clicks in the social carousel feature.",
    "purpose": "Improves the organization of social interactions, making it easier for players to find friends and groups."
  },
  "DFFlagProductInfoBatchingEnabled2_PlaceFilter": {
    "mechanism": "Enables batching of product information requests with a filter for places.",
    "purpose": "Enhances the speed and efficiency of loading product details, providing a smoother shopping experience."
  },
  "FFlagEnableFAECancellationAnalytics": {
    "mechanism": "Activates analytics for tracking cancellations in the FAE (Feature Activation Experiment).",
    "purpose": "Helps developers understand player behavior regarding feature cancellations, leading to better game updates."
  },
  "FFlagEnableNoiseReductionForAudioDeviceInput": {
    "mechanism": "Implements noise reduction technology for audio input devices.",
    "purpose": "Improves voice chat quality by reducing background noise, making communication clearer for players."
  },
  "FStringFlipTimeStampFastString": {
    "mechanism": "Optimizes the way timestamps are handled in string formatting.",
    "purpose": "Increases performance and speed in displaying time-related information, enhancing user experience."
  },
  "DFFlagVideoWinHwEncoderDeleteIfNoPool_Staged": {
    "mechanism": "Removes hardware encoder if no video pool is available.",
    "purpose": "Improves video performance by freeing up resources."
  },
  "FFlagAXMarketplaceCategoryPillTooltip": {
    "mechanism": "Adds tooltips to category pills in the marketplace.",
    "purpose": "Helps players understand what each category represents."
  },
  "FFlagVideoEncoderScopedOutputBuffer_Staged": {
    "mechanism": "Uses a specific output buffer for video encoding.",
    "purpose": "Enhances video quality and reduces lag during playback."
  },
  "UseApplicationLifecycleCallbacks": {
    "mechanism": "N/A (invalid)",
    "purpose": "N/A (invalid)"
  },
  "FFlagReverbAbsorptionField": {
    "mechanism": "Implements a new audio absorption feature for reverb effects.",
    "purpose": "Creates a more immersive sound experience in games."
  },
  "FFlagUIEditorActionURI": {
    "mechanism": "Enables a new way to handle actions in the UI editor using specific URIs.",
    "purpose": "Improves the user experience for developers by making UI editing more efficient."
  },
  "FFlagCallVoiceLeaveOnNetworkDisconnect2": {
    "mechanism": "Automatically disconnects voice chat when the network connection is lost.",
    "purpose": "Prevents players from being stuck in voice chat during connection issues, enhancing gameplay continuity."
  },
  "FFlagRefactorIsTopBarFocused": {
    "mechanism": "Changes how the top bar's focus is managed in the user interface.",
    "purpose": "Improves navigation and usability for players by ensuring the top bar responds better to user input."
  },
  "FIntServerTriggeredModalTrafficPercent": {
    "mechanism": "Adjusts the percentage of server-triggered modals shown to players.",
    "purpose": "Allows for better control over notifications and pop-ups, improving player engagement without overwhelming them."
  },
  "FFlagVoiceChatEnableSdpCompressionMaster3_Staged": {
    "mechanism": "Implements compression for voice chat data to reduce bandwidth usage.",
    "purpose": "Enhances voice chat quality and performance, making communication clearer and more reliable for players."
  },
  "FFlagReconnectToSameServer": {
    "mechanism": "Allows players to reconnect to the same game server they were on before disconnecting.",
    "purpose": "Players can continue their game without losing progress or being moved to a different server."
  },
  "DFIntBadgeServiceMaximumBadgeGetCount_PlaceFilter": {
    "mechanism": "Sets a limit on the number of badges a player can receive based on specific game places.",
    "purpose": "Ensures players don't receive too many badges at once, making achievements feel more meaningful."
  },
  "FFlagLuauTypeCheckerVectorLerp_Staged": {
    "mechanism": "Implements a type-checking feature for the Vector Lerp function in the Luau programming language.",
    "purpose": "Helps developers write more reliable code, reducing errors and improving game performance."
  },
  "DFIntTextChatCommandClientSentThrottlePermyriad_Staged": {
    "mechanism": "Limits the number of chat commands a player can send in a short time to prevent spam.",
    "purpose": "Creates a better chat experience by reducing clutter and making conversations easier to follow."
  },
  "FFlagLuauCompileVectorLerp": {
    "mechanism": "Enables the compilation of the Vector Lerp function in the Luau language for better performance.",
    "purpose": "Improves the efficiency of games that use this function, leading to smoother gameplay."
  },
  "FFlagSelfieConsentDialogDontUsePortal": {
    "mechanism": "Disables the use of a portal for the selfie consent dialog.",
    "purpose": "Players will see the selfie consent dialog directly without being redirected, making the process smoother."
  },
  "FFlagIsrMainMetrics_Staged": {
    "mechanism": "Implements a new system for tracking main metrics in a staged environment.",
    "purpose": "Players benefit from improved performance and better insights into gameplay experiences."
  },
  "FFlagAXUseDefaultFocusHandlerInFocusedWidgetTopContent": {
    "mechanism": "Utilizes a default focus handler for the top content of focused widgets.",
    "purpose": "Enhances navigation and accessibility for players using focused widgets."
  },
  "FFlagLuaAppFocusFixTopBanner": {
    "mechanism": "Fixes focus issues related to the top banner in the Lua app.",
    "purpose": "Players will experience better interaction with the app's top banner, improving usability."
  },
  "DFFlagFixImageContentInvalid_Staged": {
    "mechanism": "Addresses issues with invalid image content in a staged environment.",
    "purpose": "Players will see properly displayed images, enhancing the visual quality of the game."
  },
  "FFlagStudioFixStandalonePluginUnloadingAsync3_Staged": {
    "mechanism": "Improves the unloading process of standalone plugins in the studio.",
    "purpose": "Ensures smoother operation and less crashing when using plugins."
  },
  "FFlagPlaceVersionHistoryMetadataRCC_Staged": {
    "mechanism": "Enhances the metadata associated with place version history.",
    "purpose": "Allows players to see more detailed information about past versions of a game."
  },
  "DFFlagProductInfoBatchingEnabled_PlaceFilter": {
    "mechanism": "Enables batching of product information requests with a filter for places.",
    "purpose": "Improves loading times and performance when accessing product details in games."
  },
  "DFFlagLoadTestingEnabled3_Staged": {
    "mechanism": "Activates advanced load testing features for developers.",
    "purpose": "Helps developers test how their games perform under heavy player loads."
  },
  "DFStringLoadTestArguments_PlaceFilter": {
    "mechanism": "Allows specific arguments to be passed for load testing with a place filter.",
    "purpose": "Gives developers more control over how they test their games' performance."
  },
  "DFFlagWriteFlagCacheAfterDynamicFetch_Staged": {
    "mechanism": "Stores flag data in a cache after fetching it dynamically.",
    "purpose": "Improves performance by reducing the need to fetch the same data repeatedly."
  },
  "FFlagLuaAppAddSchemaFieldsToGameClicks": {
    "mechanism": "Adds new fields to the data schema for game click events in Lua.",
    "purpose": "Enhances tracking and analytics for game interactions, helping developers understand player behavior better."
  },
  "FFlagVoiceAddWebrtClosedTransitionEnabled": {
    "mechanism": "Enables a smoother transition for voice chat using WebRTC when closing connections.",
    "purpose": "Provides a better user experience by reducing disruptions during voice chat sessions."
  },
  "FFlagNativeDialogManager_Staged": {
    "mechanism": "Implements a new system for managing native dialogs in the app.",
    "purpose": "Improves the way dialogs are presented to players, making interactions more seamless."
  },
  "FFlagEnableAppNavGamepadRemoval": {
    "mechanism": "Allows for the removal of gamepad navigation features in the app.",
    "purpose": "Gives players a more streamlined experience by simplifying navigation controls."
  },
  "FFlagLuaAppFixSearchTextBoxWidth": {
    "mechanism": "Adjusts the width of the search text box in Lua applications.",
    "purpose": "Improves user experience by ensuring the search box is appropriately sized for better visibility."
  },
  "FFlagUseClientSettingAPI_IXP": {
    "mechanism": "Utilizes a new API to manage client settings more efficiently.",
    "purpose": "Enhances performance and responsiveness of client settings for players."
  },
  "DFIntDataStoreFixedRequestLimit_PlaceFilter": {
    "mechanism": "Increases the request limit for data store operations with place filtering.",
    "purpose": "Allows for more efficient data handling, improving game performance and stability."
  },
  "FFlagEnableAutomaticGainControlForAudioDeviceInput": {
    "mechanism": "Enables automatic adjustment of audio input levels from devices.",
    "purpose": "Ensures clearer audio quality during gameplay, enhancing communication for players."
  },
  "FFlagReconnectToSameServer_Staged": {
    "mechanism": "Allows players to reconnect to the same game server after disconnection.",
    "purpose": "Minimizes disruption by keeping players in the same game session, improving continuity."
  },
  "FFlagAndroidTrimMemoryCounters": {
    "mechanism": "Tracks memory usage on Android devices to optimize performance.",
    "purpose": "Improves game stability and reduces crashes on Android devices."
  },
  "DFIntProductInfoBatchingMaxSize_PlaceFilter": {
    "mechanism": "Limits the size of product info requests to enhance data handling.",
    "purpose": "Speeds up the loading of game items, making it easier for players to browse."
  },
  "FFlagCorrectGuiStateMouseDownAndroid": {
    "mechanism": "Fixes mouse input handling for GUI elements on Android devices.",
    "purpose": "Ensures smoother interactions with menus and buttons for Android players."
  },
  "DFFlagRemoveTemporaryScreenshotFilePresave_Staged": {
    "mechanism": "Eliminates unnecessary temporary files created during screenshot saving.",
    "purpose": "Frees up storage space and improves performance when taking screenshots."
  },
  "FFlagAXFixManageOutfitPageFocusLostBehind": {
    "mechanism": "Addresses focus issues on the outfit management page when switching tabs.",
    "purpose": "Enhances user experience by preventing loss of focus while customizing outfits."
  },
  "FFlagSelfieConsentDontMountUnused": {
    "mechanism": "Prevents the selfie feature from being activated if not needed.",
    "purpose": "Ensures players' privacy by not using their camera unless they consent."
  },
  "FStringLuaOTATag_Staged": {
    "mechanism": "Introduces a new tag for Lua scripts that can be updated without full releases.",
    "purpose": "Allows for quicker updates and improvements to game scripts, enhancing gameplay experience."
  },
  "FFlagSlimServiceEnableUploadsInNonEditMode": {
    "mechanism": "Allows players to upload content even when not in edit mode.",
    "purpose": "Enables players to share their creations more easily, fostering creativity."
  },
  "DFFlagEnableGenerateRecommendationItemListFromRcc2": {
    "mechanism": "Utilizes a new system to generate item recommendations for players.",
    "purpose": "Provides personalized item suggestions, improving player engagement and experience."
  },
  "FFlagEnableProfilePlatformDualCta_v5_Staged": {
    "mechanism": "Implements dual call-to-action buttons on player profiles.",
    "purpose": "Enhances navigation and interaction on profiles, making it easier for players to connect."
  },
  "FFlagEnableAdOpportunityTracker4_PlaceFilter": {
    "mechanism": "Tracks ad opportunities based on specific place filters.",
    "purpose": "Helps developers optimize ad placements to increase revenue."
  },
  "FFlagSlimServiceEnableUploadsInNonEditMode_Staged": {
    "mechanism": "Allows uploads of assets even when not in edit mode.",
    "purpose": "Enables players to upload content more freely and conveniently."
  },
  "FFlagExtendLightRangeTo120HideRolloutPropertyAndEnable": {
    "mechanism": "Increases the range of light sources in the game engine.",
    "purpose": "Enhances visual quality by allowing better lighting effects in games."
  },
  "FFlagAXMigrateEmoteMenuFromRoactGamepad": {
    "mechanism": "Migrates the emote menu to a new framework for gamepad use.",
    "purpose": "Improves the experience of using emotes for players with game controllers."
  },
  "DFIntDataStoreOrderedSetFixedRequestLimit_PlaceFilter": {
    "mechanism": "Adjusts request limits for data storage operations.",
    "purpose": "Ensures smoother gameplay by managing data requests more effectively."
  },
  "DFFlagSolverV2CleanupPendingModelStreamingModeModels": {
    "mechanism": "Cleans up unused models in the streaming system to optimize performance.",
    "purpose": "Improves game loading times and reduces lag for players."
  },
  "DFIntVoiceChatHttpErrorsTelemetryThrottleHundredthsPercent_Staged": {
    "mechanism": "Monitors and limits the frequency of voice chat error reports to prevent spam.",
    "purpose": "Enhances the stability of voice chat by reducing unnecessary error notifications."
  },
  "FFlagInitializeAutocompleteOnlyIfEnabledV3": {
    "mechanism": "Activates the autocomplete feature only when it's explicitly turned on.",
    "purpose": "Ensures players only see autocomplete suggestions when they want them, improving user experience."
  },
  "FFlagInternalExportHandleMisnamedR15Bones": {
    "mechanism": "Fixes issues with incorrectly named bone structures in character models for better compatibility.",
    "purpose": "Ensures smoother animations and character movements for players using R15 models."
  },
  "FFlagAXCategoryPillScrollToStart": {
    "mechanism": "Adjusts the scrolling behavior of category pills in the UI to start at the beginning.",
    "purpose": "Provides a more intuitive navigation experience for players when browsing categories."
  },
  "FFlagLuaAppEdpBackendV2HydrateLegacyIxp4": {
    "mechanism": "Updates the backend system for Lua applications to improve data handling.",
    "purpose": "Enhances performance and stability for Lua-based experiences."
  },
  "FFlagAppChatConversationOverlayRefactor": {
    "mechanism": "Redesigns the chat overlay for better user interaction.",
    "purpose": "Provides a more user-friendly chat experience for players."
  },
  "DFIntDataStoreOrderedGetFixedRequestLimit_PlaceFilter": {
    "mechanism": "Adjusts the request limits for data storage queries with a place filter.",
    "purpose": "Improves the efficiency of data retrieval for specific game places."
  },
  "FFlagSduiComponentSkipParseLocalProps": {
    "mechanism": "Optimizes the processing of UI components by skipping unnecessary property parsing.",
    "purpose": "Increases the speed and responsiveness of the user interface."
  },
  "FFlagReCacheIconsOnThemeChange": {
    "mechanism": "Refreshes icon caches when the theme changes to ensure visual consistency.",
    "purpose": "Ensures that icons match the current theme for a cohesive look."
  },
  "FFlagNewBindToMessageError_Staged": {
    "mechanism": "Introduces a new way to handle message binding errors in the code.",
    "purpose": "Improves the reliability of in-game messaging, reducing errors for players."
  },
  "FFlagAXCategoryPillScrollToStart_Staged": {
    "mechanism": "Changes the scrolling behavior of category pills in the UI.",
    "purpose": "Enhances navigation for players by making it easier to access the start of category lists."
  },
  "FFlagEnableConfirmButtonIconOnPlaystation": {
    "mechanism": "Adds a confirmation button icon specifically for PlayStation controllers.",
    "purpose": "Provides clearer controls for PlayStation players, improving their gaming experience."
  },
  "FFlagAXCatalogReactPerfIXPEnabledV3_Staged": {
    "mechanism": "Optimizes performance for the catalog interface using React technology.",
    "purpose": "Makes browsing the catalog faster and smoother for players."
  },
  "FFlagAXMigrateItemOwnerShipPageToAutofocus": {
    "mechanism": "Switches the item ownership page to automatically focus on the main content.",
    "purpose": "Streamlines the user experience by allowing players to interact with items more quickly."
  },
  "FFlagAXMigrateCenteredModalViewToAutoFocus": {
    "mechanism": "Changes how modal views focus on input fields automatically.",
    "purpose": "Makes it easier for players to start typing in input fields without clicking."
  },
  "FFlagFCSkeletonIgnoreUnusedPartsCheckFaceControls": {
    "mechanism": "Adjusts the skeleton system to ignore certain unused parts when checking face controls.",
    "purpose": "Improves performance and responsiveness of character animations for players."
  },
  "FFlagFixLockCenterMouseClickAndScroll_Staged": {
    "mechanism": "Fixes issues with mouse click and scrolling behavior in the game.",
    "purpose": "Enhances player control and navigation, making it smoother and more intuitive."
  },
  "FFlagCommunicationsFixLastInputMode": {
    "mechanism": "Corrects how the last input mode is remembered during gameplay.",
    "purpose": "Ensures players can continue using their preferred input method without interruptions."
  },
  "FFlagRemoveLeaveShortcutFromLeaveConfirm": {
    "mechanism": "Removes the shortcut option to leave from the confirmation dialog.",
    "purpose": "Prevents accidental game exits, ensuring players stay in the game longer."
  },
  "FFlagCachelessPluginLoading2": {
    "mechanism": "Loads plugins without caching to ensure the latest version is always used.",
    "purpose": "Players get the most up-to-date features and fixes from plugins without delays."
  },
  "FFlagRemoveRespawnShortcutFromRespawnConfirmation": {
    "mechanism": "Disables the shortcut for respawning during confirmation prompts.",
    "purpose": "Prevents accidental respawns, giving players more control over their actions."
  },
  "DFFlagISRDoNotCrashCanSkipNewInstanceCheckIfPropNull": {
    "mechanism": "Allows skipping checks that could cause crashes if certain properties are null.",
    "purpose": "Improves game stability by reducing crashes related to missing properties."
  },
  "DFFlagEnableGameJoinChatTimeoutEvent": {
    "mechanism": "Introduces a timeout event for chat when joining a game.",
    "purpose": "Enhances the chat experience by managing messages better when players enter a game."
  },
  "FFlagRemoveUpdatePromptChild_Staged": {
    "mechanism": "Removes the child update prompt feature from the staging environment.",
    "purpose": "Streamlines the update process, making it less confusing for players."
  },
  "DFFlagVoiceSdpCompressionSendSizeTelemetry_Staged": {
    "mechanism": "Tracks the size of voice data sent for compression analysis.",
    "purpose": "Improves voice chat quality by optimizing data transmission."
  },
  "FFlagVoiceChatClientRewrite_OneFlagToRuleThemAll_Client2_IXP": {
    "mechanism": "Centralizes voice chat functionality into a single control flag.",
    "purpose": "Enhances voice chat performance and reliability for players."
  },
  "FFlagSolverV2RefactorReplicationStateUpdate": {
    "mechanism": "Updates how game state changes are replicated across clients.",
    "purpose": "Ensures smoother gameplay and more accurate game state synchronization."
  },
  "FFlagAXDisableCategoryPillsOnCatalogSearch": {
    "mechanism": "Removes category filters from the search interface in the catalog.",
    "purpose": "Simplifies the search experience for players looking for items."
  },
  "FFlagRemoveiOS13DeprecatedCode_Staged": {
    "mechanism": "Eliminates outdated code that is no longer supported on iOS 13.",
    "purpose": "Improves app performance and stability for iOS users."
  },
  "DFStringAllowedPublicFlags_Staged": {
    "mechanism": "Allows certain public flags to be defined as strings.",
    "purpose": "Enables more flexible configurations for features that players can use."
  },
  "DFFlagLoadTestingEnabled3_PlaceFilter": {
    "mechanism": "Activates a filter for places during load testing.",
    "purpose": "Improves the testing process to ensure better performance and stability for players."
  },
  "DFFlagSkipSavingEmptyCapture_Staged": {
    "mechanism": "Prevents saving data when no relevant information is captured.",
    "purpose": "Reduces unnecessary data storage, leading to faster game performance for players."
  },
  "FFlagAXEnableItemDetailsTryOnPage2": {
    "mechanism": "Enables a feature to view item details on the second page of the try-on interface.",
    "purpose": "Enhances the shopping experience by providing more information about items players want to try on."
  },
  "FFlagLuauNoConstraintGenRecursionLimitIce": {
    "mechanism": "Removes limits on recursion for generating constraints in the Luau scripting language.",
    "purpose": "Allows developers to create more complex and dynamic game mechanics, improving gameplay for players."
  },
  "FFlagProfilePlatformEnableClickToCopyUsername_Staged": {
    "mechanism": "Enables a feature that allows users to click on usernames to copy them to the clipboard.",
    "purpose": "Makes it easier for players to share usernames without typing them out."
  },
  "DFFlagMoveOctreeChecks": {
    "mechanism": "Changes how the game checks for object collisions and interactions using a more efficient method.",
    "purpose": "Improves game performance and reduces lag during gameplay."
  },
  "FFlagAXAddStyleToItemCardPriceLine": {
    "mechanism": "Adds new styling options to the price display on item cards in the marketplace.",
    "purpose": "Enhances the visual appeal of item listings, making it easier for players to see prices."
  },
  "FStringFlagRepoGitHashFastString": {
    "mechanism": "Utilizes a faster method for retrieving version information from the code repository.",
    "purpose": "Improves the speed of updates and ensures players have the latest features quickly."
  },
  "FFlagProfilePlatformEnableChipSocialRow_v6_IXP": {
    "mechanism": "Activates a new layout for displaying social connections on user profiles.",
    "purpose": "Provides a more organized and user-friendly way for players to see their friends and social interactions."
  },
  "DFFlagWriteFlagCacheAfterFlagFetch": {
    "mechanism": "Stores flag data in a cache after retrieving it to improve access speed.",
    "purpose": "Players experience faster loading times for game features that depend on these flags."
  },
  "FFlagFixBlurryImages": {
    "mechanism": "Improves image rendering quality to reduce blurriness.",
    "purpose": "Players see clearer and sharper images in games, enhancing visual quality."
  },
  "FFlagAXMIgrateItemDetailsModalToAutofocus": {
    "mechanism": "Changes the item details modal to automatically focus on the input field.",
    "purpose": "Players can quickly start typing when viewing item details, making it easier to interact."
  },
  "DFFlagAudioSpeechToTextRequireVoiceChat2": {
    "mechanism": "Requires players to use voice chat for audio-to-text features.",
    "purpose": "Players can communicate more effectively through text generated from their voice."
  },
  "FFlagFFlagIconHostSetZIndexToDefault": {
    "mechanism": "Resets the stacking order of icons to a default setting.",
    "purpose": "Players experience a more organized and visually appealing interface with icons."
  },
  "FFlagProfilePlatformEnableEditAvatar_IXP": {
    "mechanism": "Enables editing of avatars directly on the platform interface.",
    "purpose": "Allows players to customize their avatars more easily and quickly."
  },
  "FFlagVoiceChatClientRewrite_OneFlagToRuleThemAll_Client2_Staged": {
    "mechanism": "Implements a new system for handling voice chat features in the client.",
    "purpose": "Improves the reliability and performance of voice chat for players."
  },
  "FFlagVoiceAddWebrtClosedTransitionEnabled_Staged": {
    "mechanism": "Integrates a new transition method for voice chat using WebRTC technology.",
    "purpose": "Enhances the quality and stability of voice communication during gameplay."
  },
  "FFlagAXSendLegacyWidgetImpressions_Staged": {
    "mechanism": "Sends data about interactions with older widget designs.",
    "purpose": "Helps developers understand how players interact with legacy features."
  },
  "FFlagMicroprofilerBigButtons": {
    "mechanism": "Introduces larger buttons in the microprofiler tool for easier access.",
    "purpose": "Makes it simpler for developers to analyze performance metrics."
  },
  "DFIntVoiceChatHttpErrorsTelemetryThrottleHundredthsPercent": {
    "mechanism": "Limits the frequency of telemetry data sent for voice chat errors.",
    "purpose": "Improves performance by reducing unnecessary data transmission related to voice chat issues."
  },
  "FFlagAXEnableCategoryPills4_Staged": {
    "mechanism": "Introduces a new design for category navigation in the user interface.",
    "purpose": "Enhances user experience by making it easier to find and select categories."
  },
  "DFFlagEnableGenerateRecommendationItemListFromRcc2_Staged": {
    "mechanism": "Uses a new system to create item recommendations based on user behavior.",
    "purpose": "Provides personalized item suggestions to players, improving their shopping experience."
  },
  "FFlagLuauRefineDistributesOverUnions": {
    "mechanism": "Improves the way the Luau programming language handles type distributions.",
    "purpose": "Enhances code accuracy and reduces errors for developers using Luau."
  },
  "FFlagAddSwitchTabHintsToIEM2": {
    "mechanism": "Adds visual hints for switching between tabs in the interface.",
    "purpose": "Guides players on how to navigate the interface more effectively."
  },
  "FFlagAXCatalogCategoryPillsIXP": {
    "mechanism": "Enables a new design for category navigation in the catalog.",
    "purpose": "Improves user experience by making it easier to browse items."
  },
  "FFlagUnsyncBreakpointsInClonedScripts": {
    "mechanism": "Allows cloned scripts to have independent breakpoints.",
    "purpose": "Enhances debugging by letting players test scripts without interference."
  },
  "FFlagAddFriendsEmptyStateUpdate": {
    "mechanism": "Updates the interface when there are no friends added.",
    "purpose": "Encourages players to add friends by showing a friendly prompt."
  },
  "FFlagAXCategoryPillColorAnimationInstantOff": {
    "mechanism": "Changes how color animations behave for category pills.",
    "purpose": "Provides a smoother visual transition when selecting categories."
  },
  "FFlagLrMainMetrics_Staged": {
    "mechanism": "Collects and analyzes main metrics for performance tracking.",
    "purpose": "Helps improve game performance and player experience through data insights."
  },
  "DFFlagLoadTestingEnabled3": {
    "mechanism": "Enables a feature for developers to test game performance under load conditions.",
    "purpose": "Helps developers ensure their games run smoothly even when many players join at once."
  },
  "DFStringLoadTestingUniverseId_PlaceFilter": {
    "mechanism": "Filters which game places are included in load testing based on their universe ID.",
    "purpose": "Allows developers to focus testing on specific game areas, improving game stability."
  },
  "FFlagFixDisplaySizeEnum": {
    "mechanism": "Corrects how display sizes are categorized in the game settings.",
    "purpose": "Ensures players have accurate options for their screen sizes, enhancing gameplay experience."
  },
  "DFStringLoadTestingUniverseId_Staged": {
    "mechanism": "Identifies which universe ID is being used for staged load testing.",
    "purpose": "Helps developers test new features in a controlled environment before public release."
  },
  "FFlagEnableProfilePlatformDualCta_v5": {
    "mechanism": "Introduces a dual call-to-action button for player profiles on different platforms.",
    "purpose": "Improves user engagement by making it easier for players to interact with profiles across devices."
  },
  "FFlagSongbirdPopoverSubmenu2": {
    "mechanism": "Enables a new design for pop-up menus in the Songbird feature.",
    "purpose": "Improves user experience by making it easier to navigate options."
  },
  "FStringEngineVoiceSdpCompressionIxpLayer": {
    "mechanism": "Implements a compression method for voice data in the engine.",
    "purpose": "Reduces data usage and improves voice chat quality for players."
  },
  "FFlagProductInfoBatchingCoalescingEnabled": {
    "mechanism": "Groups multiple product information requests into a single call.",
    "purpose": "Speeds up loading times for product details in the game."
  },
  "FFlagAXCatalogCategoryPillsIXP_Staged": {
    "mechanism": "Introduces a new way to display category options in the catalog.",
    "purpose": "Makes it easier for players to find and browse items in the catalog."
  },
  "DFStringLoadTestName_PlaceFilter": {
    "mechanism": "Adds a filter for testing place names in load tests.",
    "purpose": "Helps developers ensure that place names are loaded correctly during testing."
  },
  "FFlagProductInfoBatchingCoalescingEnabled_PlaceFilter": {
    "mechanism": "Groups multiple product info requests to reduce server load.",
    "purpose": "Improves performance by speeding up the loading of product information in games."
  },
  "DFFlagSkipSavingEmptyCapture": {
    "mechanism": "Prevents saving data when there are no changes to save.",
    "purpose": "Reduces unnecessary data storage, making game saves faster and more efficient."
  },
  "DFFlagWriteTombstoneAfterDynamicFetch": {
    "mechanism": "Creates a placeholder for data that is being fetched dynamically.",
    "purpose": "Ensures smoother gameplay by managing data retrieval without causing delays."
  },
  "FFlagLrMainMetrics": {
    "mechanism": "Enables tracking of key performance metrics for games.",
    "purpose": "Helps developers understand game performance better, leading to improvements."
  },
  "FFlagExtendedLightRangesFixDirtyCrash": {
    "mechanism": "Fixes issues with light rendering that could cause crashes.",
    "purpose": "Enhances game stability and visual quality by preventing crashes related to lighting."
  },
  "FFlagLuaAppShowAgeRatingWithPlayButtonOnTileHoverWithHiddenMetadata": {
    "mechanism": "Displays age rating and play button on hover over game tiles in the app.",
    "purpose": "Helps players quickly see if a game is appropriate for their age before playing."
  },
  "FFlagAXSavePreviousPageFromQuickMenu": {
    "mechanism": "Saves the last page viewed in the quick menu for easier navigation.",
    "purpose": "Allows players to return to their last menu page quickly, improving user experience."
  },
  "DFFlagVoiceSdpCompressionRemoteEventFieldReceivesUnexpectedValue_Staged": {
    "mechanism": "Addresses issues with unexpected values in remote event fields related to voice data.",
    "purpose": "Ensures smoother voice communication by fixing potential errors in voice data transmission."
  },
  "FFlagChatIntegrationFixShortcut": {
    "mechanism": "Fixes keyboard shortcuts for chat integration in the game.",
    "purpose": "Enhances chat usability, making it easier for players to communicate during gameplay."
  },
  "FFlagEnableAudioSpeechToText_PlaceFilter": {
    "mechanism": "Enables a feature that converts spoken audio into text for filtering in places.",
    "purpose": "Improves accessibility by allowing players to use voice commands that are converted to text."
  },
  "FFlagVoiceConnectionApiSendSdpParsingErrorTelemetry": {
    "mechanism": "Sends data about errors in parsing connection information for voice chat.",
    "purpose": "Helps improve voice chat reliability by tracking and fixing issues."
  },
  "FIntOcclusionSolverInitialMaxSearchIterations": {
    "mechanism": "Sets a limit on how many times the system checks for hidden objects in a scene.",
    "purpose": "Improves game performance by optimizing how objects are rendered."
  },
  "FFlagFixDisplaySizeEnum_Staged": {
    "mechanism": "Corrects how display sizes are categorized in the system.",
    "purpose": "Ensures players see the correct display settings for their devices."
  },
  "DFIntLoadTestParticipationPerMillionUsers_PlaceFilter": {
    "mechanism": "Controls the number of users participating in load tests based on specific game filters.",
    "purpose": "Helps developers test game performance with a targeted audience."
  },
  "FFlagLuaAppsServerTriggeredModals": {
    "mechanism": "Enables pop-up messages triggered by server events in Lua applications.",
    "purpose": "Enhances user experience by providing timely information and alerts."
  },
  "FFlagLuauTypeCheckerVectorLerp": {
    "mechanism": "Enhances the type checker to better understand vector interpolation functions.",
    "purpose": "Improves code accuracy for developers, leading to fewer bugs and smoother gameplay experiences."
  },
  "FFlagNewBindToMessageError": {
    "mechanism": "Introduces a new error handling system for message binding in scripts.",
    "purpose": "Helps developers identify and fix issues more easily, resulting in more reliable game features."
  },
  "FFlagConvertVariantToCorrectType": {
    "mechanism": "Allows automatic conversion of data types to their correct forms in scripts.",
    "purpose": "Simplifies coding for developers, making it easier to create diverse game elements without errors."
  },
  "FFlagLuaAppAddSortDataToPymkCarouselClicks": {
    "mechanism": "Adds sorting functionality to the data collected from carousel interactions in the app.",
    "purpose": "Enhances user experience by organizing game recommendations based on player preferences."
  },
  "FFlagVideoGamePreviewSessionTracking_Staged": {
    "mechanism": "Implements tracking for video game preview sessions in a controlled environment.",
    "purpose": "Allows developers to analyze player engagement with previews, improving future game releases."
  },
  "FFlagFixKeyboardFocusInfiniteLoop_Staged": {
    "mechanism": "Fixes a bug where keyboard focus could get stuck in a loop.",
    "purpose": "Ensures players can type without interruptions or issues."
  },
  "FFlagAXMigrateItemDetailsFullToAutoFocus": {
    "mechanism": "Changes how item details are displayed to automatically focus on them.",
    "purpose": "Makes it easier for players to view and interact with item details quickly."
  },
  "DFFlagEnableCancelTouchesOnGameViewControllerDisappear_Staged": {
    "mechanism": "Allows touch inputs to be canceled when the game view is closed.",
    "purpose": "Prevents unwanted actions when players exit the game view."
  },
  "FFlagEnableFAECancellationAnalytics_Staged": {
    "mechanism": "Tracks when players cancel actions in the game for analysis.",
    "purpose": "Helps improve player experience by understanding cancellation reasons."
  },
  "FFlagAXMigrateCommunityAvatarEntryButtonToLocalRef": {
    "mechanism": "Updates the community avatar entry button to use a local reference.",
    "purpose": "Improves performance and reliability when accessing community avatars."
  },
  "FFlagEnableClientSettingAPIInProduction_IXP": {
    "mechanism": "Enables the client settings API to be used in live games.",
    "purpose": "Allows players to customize their game settings more easily."
  },
  "DFIntRobloxTelemetryLoadTestStartThrottleHundredthsPercent_PlaceFilter": {
    "mechanism": "Implements a throttle on telemetry data collection during load tests.",
    "purpose": "Improves game performance by managing data collection more efficiently."
  },
  "FFlagEnableSpatialUIScalingFix": {
    "mechanism": "Fixes issues with scaling user interface elements in 3D space.",
    "purpose": "Enhances the visual experience by ensuring UI elements appear correctly in the game world."
  },
  "FFlagSTM6819Enabled": {
    "mechanism": "Activates a specific feature related to the game's state management.",
    "purpose": "Improves game stability and performance for players."
  },
  "FFlagUITextureRendererUseNewRenderPath_Staged": {
    "mechanism": "Switches to a new method for rendering UI textures.",
    "purpose": "Provides better graphics quality and performance for user interfaces."
  },
  "DFFlagEnableUpdateClientFeatureTimeoutListener2": {
    "mechanism": "Enhances the client to listen for timeout updates more effectively.",
    "purpose": "Improves the responsiveness of features that rely on time-sensitive updates."
  },
  "FFlagAXCategoryPillAnimationsUserMotionSettings": {
    "mechanism": "Introduces animations for category pills based on user motion settings.",
    "purpose": "Makes the interface more dynamic and engaging when users interact with category options."
  },
  "FFlagAXExternalItemDetailsOverlay": {
    "mechanism": "Adds an overlay to display detailed information about external items.",
    "purpose": "Provides players with better insights and information about items they are interested in."
  },
  "DFStringFlagRepoGitHashDynamicString": {
    "mechanism": "Links the game to a dynamic string that reflects the current Git hash for versioning.",
    "purpose": "Ensures players are using the latest version of the game with up-to-date features and fixes."
  },
  "DFFlagEditableMeshFastClusterSkipLoD_Staged": {
    "mechanism": "Optimizes the rendering of editable meshes by skipping certain levels of detail.",
    "purpose": "Enhances performance and speeds up loading times for complex mesh objects in the game."
  },
  "FFlagLuaAppsServerTriggeredModals_Staged": {
    "mechanism": "Allows server to trigger pop-up windows in Lua applications.",
    "purpose": "Enables better user interactions by showing important messages or options."
  },
  "FFlagFixToggleMenuIconForTheFive_Staged": {
    "mechanism": "Corrects the icon display for a specific menu option.",
    "purpose": "Improves visual clarity and usability of the menu for players."
  },
  "DFFlagEnableContextForGenerateList": {
    "mechanism": "Adds context support when generating lists in the game.",
    "purpose": "Enhances functionality, allowing for more dynamic and relevant game content."
  },
  "FFlagFCDecrementVertexCount": {
    "mechanism": "Reduces the number of vertices in 3D models for performance.",
    "purpose": "Improves game performance and loading times, leading to smoother gameplay."
  },
  "DFFlagEnableGameJoinChatTimeoutEvent_Staged": {
    "mechanism": "Introduces a timeout event for chat when joining games.",
    "purpose": "Helps manage chat activity better, preventing spam during game loading."
  },
  "DFFlagRbxStorageRemoveOldCacheSkipEmpty": {
    "mechanism": "Removes outdated cached data from storage if it is empty.",
    "purpose": "Improves storage efficiency and speeds up data retrieval for players."
  },
  "FFlagEngineVoiceSdpCompressionIxpEnabled_Staged": {
    "mechanism": "Enables compression for voice data during transmission.",
    "purpose": "Enhances voice chat quality and reduces lag for players."
  },
  "FFlagProductInfoBatchingCoalescingEnabled_Staged": {
    "mechanism": "Groups multiple product information requests into a single batch.",
    "purpose": "Reduces loading times and improves performance when accessing product details."
  },
  "FFlagAXCategoryPillInstantFadeOut": {
    "mechanism": "Changes the visual effect of category pills to fade out instantly.",
    "purpose": "Provides a smoother and more visually appealing transition for players."
  },
  "FFlagEnableCVSUrlForOtaPatch_Staged": {
    "mechanism": "Allows the use of a specific URL for over-the-air updates.",
    "purpose": "Ensures players receive the latest updates more reliably and efficiently."
  },
  "FFlagFixKeyboardFocusInfiniteLoop": {
    "mechanism": "Fixes a bug where keyboard focus could get stuck in a loop, preventing input.",
    "purpose": "Ensures players can type and interact without interruptions."
  },
  "FFlagAXMigrateEmoteMenuFromRoactGamepad_Staged": {
    "mechanism": "Moves the emote menu to a new system for better performance on gamepads.",
    "purpose": "Improves the experience of using emotes for players using game controllers."
  },
  "FFlagProfilePlatformEnableClickToCopyUsername": {
    "mechanism": "Adds a feature that allows users to click on usernames to copy them easily.",
    "purpose": "Makes it simpler for players to share usernames with friends."
  },
  "FFlagCoreComponentManagerEmitAssetDMKeyTelemetry": {
    "mechanism": "Tracks data related to asset management for better performance analysis.",
    "purpose": "Helps improve the overall experience by optimizing asset loading and usage."
  },
  "FFlagAXFixBuyActionBarNotAppearing2": {
    "mechanism": "Fixes an issue where the buy action bar would not show up in certain situations.",
    "purpose": "Ensures players can access purchasing options when needed."
  },
  "FFlagPerformanceTelemetryHandleSpuriousWake": {
    "mechanism": "Improves how performance data is collected by filtering out unnecessary signals.",
    "purpose": "Provides players with more accurate performance metrics, leading to smoother gameplay."
  },
  "FFlagFixTexturePackLoadingRetries_Staged": {
    "mechanism": "Addresses issues with loading texture packs by retrying failed attempts more effectively.",
    "purpose": "Ensures players can load textures properly, enhancing visual quality in games."
  },
  "FFlagAXUnifiedLoggingValidation1_Staged": {
    "mechanism": "Standardizes logging processes to ensure data consistency and reliability.",
    "purpose": "Helps developers identify and fix issues faster, leading to a better gaming experience for players."
  },
  "FStringLuaOTATag": {
    "mechanism": "Introduces a tagging system for Lua scripts to manage updates.",
    "purpose": "Allows players to benefit from smoother updates and new features in games."
  },
  "FStringTextureTranscodeFidelityETC": {
    "mechanism": "Enhances the quality of texture conversion processes for better visual fidelity.",
    "purpose": "Improves the overall graphical quality of games, making them more visually appealing for players."
  },
  "FFlagStudioFixStandalonePluginUnloadingAsync3": {
    "mechanism": "Improves the process of unloading plugins in Studio asynchronously.",
    "purpose": "Reduces delays and improves performance when removing plugins."
  },
  "FFlagUpdateViewportOnUse3DPanelsChanged": {
    "mechanism": "Updates the viewport when 3D panels are used or changed.",
    "purpose": "Enhances the visual experience by ensuring the viewport reflects changes immediately."
  },
  "FFlagSduiSupportArrayParsing_Staged": {
    "mechanism": "Allows for parsing of arrays in the SDUI system.",
    "purpose": "Enables more complex UI elements and layouts for better user interfaces."
  },
  "AndroidAddActivityManagerMemoryClassifications": {
    "mechanism": "N/A (invalid)",
    "purpose": "N/A (invalid)"
  },
  "FFlagVoiceConnectionApiSendSdpParsingErrorTelemetry_Staged": {
    "mechanism": "Tracks errors in parsing SDP data for voice connections.",
    "purpose": "Improves voice chat reliability by identifying and fixing connection issues."
  },
  "DFFlagVideoSandboxPreviewVideos": {
    "mechanism": "Enables a separate environment for testing video previews without affecting live content.",
    "purpose": "Allows creators to preview their videos safely before publishing them."
  },
  "DFStringDataStoreRdbShadowTrafficRolloutConfig_PlaceFilter": {
    "mechanism": "Implements a filtering system for data storage based on specific game places.",
    "purpose": "Improves data management for developers by allowing them to target specific games."
  },
  "DFFlagEnableUpdateClientFeatureTimeoutListener2_Staged": {
    "mechanism": "Adds a timeout listener for client updates to manage performance.",
    "purpose": "Enhances game stability by preventing long waits during updates."
  },
  "FFlagAXCatalogReactPerfIXPEnabledV3": {
    "mechanism": "Optimizes the catalog interface using React for better performance.",
    "purpose": "Provides a smoother and faster browsing experience in the catalog."
  },
  "FFlagBuyActionBarShouldNotUnrenderInFullscreenMode": {
    "mechanism": "Keeps the buy action bar visible even when the game is in fullscreen mode.",
    "purpose": "Ensures players can easily access purchase options without interruptions."
  },
  "FFlagIncreaseEffectiveLightGridRadius": {
    "mechanism": "Increases the radius for light calculations in the game engine.",
    "purpose": "Improves lighting effects in games, making them look better and more realistic."
  },
  "DFFlagEnableCancelTouchesOnGameViewControllerDisappear": {
    "mechanism": "Allows touch inputs to be canceled when the game view is closed.",
    "purpose": "Prevents unintended actions when players exit the game view, enhancing user experience."
  },
  "FFlagAXEnableCategoryPills4": {
    "mechanism": "Activates a new design for category filters in the user interface.",
    "purpose": "Makes it easier for players to navigate and find content by visually categorizing options."
  },
  "FFlagEnableSocialSelfProfileViewExposureEvents_Staged": {
    "mechanism": "Tracks when players view their own profile in social features.",
    "purpose": "Helps improve social features by understanding how players interact with their profiles."
  },
  "DFIntRobloxTelemetryLoadTestEndThrottleHundredthsPercent_PlaceFilter": {
    "mechanism": "Adjusts the frequency of data collection for performance testing.",
    "purpose": "Ensures smoother gameplay by optimizing how performance data is gathered and analyzed."
  },
  "FFlagAXCategoryPillPadding": {
    "mechanism": "Adjusts the spacing around category pills in the UI.",
    "purpose": "Improves visual layout and readability of category options."
  },
  "DFFlagAndroidDebugHeapTelemetry": {
    "mechanism": "Enables detailed memory usage tracking on Android devices.",
    "purpose": "Helps developers identify and fix performance issues on Android."
  },
  "FFlagAXCategoryPillColorAnimation": {
    "mechanism": "Adds animations to the color changes of category pills.",
    "purpose": "Enhances user experience with smoother visual transitions."
  },
  "FStringEngineVoiceSdpCompressionIxpLayer_Staged": {
    "mechanism": "Implements compression for voice data in the engine.",
    "purpose": "Reduces data usage and improves voice chat quality."
  },
  "FixIsolatedGmaSdkCleanDisconnect": {
    "mechanism": "N/A (invalid)",
    "purpose": "N/A (invalid)"
  },
  "DFFlagVoiceSdpCompressionSendProtoParseErrorTelemetry_Staged": {
    "mechanism": "Tracks errors in parsing voice data for better debugging.",
    "purpose": "Improves voice chat reliability by identifying issues."
  },
  "DFStringAllowedPublicFlags": {
    "mechanism": "Defines which flags can be publicly accessed in scripts.",
    "purpose": "Enhances script flexibility by allowing developers to use specific features."
  },
  "DFFlagVoiceChatSendHttpErrorsTelemetry": {
    "mechanism": "Monitors HTTP errors related to voice chat functionality.",
    "purpose": "Helps improve voice chat by tracking and fixing errors."
  },
  "FFlagLuauVectorLerp_Staged": {
    "mechanism": "Introduces a smoother way to interpolate between vectors in scripts.",
    "purpose": "Provides developers with better tools for creating smooth movements."
  },
  "FFlagAXDisableGamepadPanning": {
    "mechanism": "Disables the automatic panning of the camera when using a gamepad.",
    "purpose": "Gives players more control over their camera movement while playing."
  },
  "FStringIxpNewLayersForRegistration": {
    "mechanism": "Introduces new layers in the registration process to improve data handling.",
    "purpose": "Makes it easier and faster for players to register and access their accounts."
  },
  "FFlagFixDisplaySizeVR2_Staged": {
    "mechanism": "Adjusts the display size settings specifically for VR devices in a controlled manner.",
    "purpose": "Enhances the visual experience for players using virtual reality headsets."
  },
  "FFlagUIBloxTruncateExperienceTileMetadataTextFooter": {
    "mechanism": "Shortens the text displayed in the footer of experience tiles to fit better.",
    "purpose": "Improves the visual layout and readability of game listings for players."
  },
  "DFFlagVoiceSdpCompressionSendProtoParseErrorTelemetry": {
    "mechanism": "Collects data on errors related to voice communication protocols.",
    "purpose": "Helps improve voice chat reliability for players by identifying and fixing issues."
  },
  "FFlagFixDisplaySizeVR2": {
    "mechanism": "Fixes issues with display size settings for VR devices.",
    "purpose": "Provides a better and more consistent visual experience for players in virtual reality."
  },
  "FFlagFixTexturePackLoadingRetries": {
    "mechanism": "Improves the process of retrying to load texture packs if they fail initially.",
    "purpose": "Ensures players can see textures correctly without repeated loading issues."
  },
  "FFlagEnableProfilePlatformDualCta_v5_IXP": {
    "mechanism": "Introduces a dual call-to-action button on player profiles for better navigation.",
    "purpose": "Makes it easier for players to interact with profiles and access features."
  },
  "FFlagISREarlyFilterAnimatedJoints": {
    "mechanism": "Adds early filtering for animated joints in character models.",
    "purpose": "Enhances performance and reduces glitches during character animations."
  },
  "FIntServerTriggeredModalTrafficPercent_Staged": {
    "mechanism": "Controls the percentage of players who see server-triggered modal pop-ups.",
    "purpose": "Helps test new features by gradually introducing them to players."
  },
  "FFlagAppChatIllustrationsUpdate": {
    "mechanism": "Updates the illustrations used in the app's chat feature.",
    "purpose": "Improves the visual appeal of chat, making conversations more engaging."
  },
  "FFlagFFlagFixLayeredSorting": {
    "mechanism": "Adjusts the rendering order of layered clothing items.",
    "purpose": "Ensures that clothing items appear in the correct order on avatars."
  },
  "DFIntJoinLimitWin32x64_Staged": {
    "mechanism": "Increases the maximum number of players that can join a game on Windows 64-bit.",
    "purpose": "Allows more players to join games simultaneously, enhancing multiplayer experiences."
  },
  "FFlagRbxthumbForAlbumArt": {
    "mechanism": "Enables the use of Roblox thumbnails for album art in games.",
    "purpose": "Improves the visual appeal of music and media in games by showcasing album covers."
  },
  "FFlagEnableSocialSelfProfileViewExposureEvents": {
    "mechanism": "Tracks when players view their own profiles in social features.",
    "purpose": "Helps developers understand player engagement with profiles and improve social features."
  },
  "DFIntISRInstanceBlockTimeoutWorldSteps": {
    "mechanism": "Sets a timeout for instance blocking during world steps in the game engine.",
    "purpose": "Improves game performance by managing how long instances can block actions."
  },
  "FFlagRemoveUpdatePromptChild": {
    "mechanism": "Removes a child element from the update prompt interface.",
    "purpose": "Simplifies the update notifications for players, making them less cluttered."
  },
  "FFlagCustomDspBaseSupportsSidechain": {
    "mechanism": "Enables advanced audio processing features for sound effects.",
    "purpose": "Improves the audio experience in games, allowing for better sound quality and effects."
  },
  "FFlagAddDismissTopBarFocus": {
    "mechanism": "Adds a feature to remove focus from the top bar interface.",
    "purpose": "Enhances user interaction by allowing players to easily dismiss the top bar, improving gameplay focus."
  },
  "FFlagAXAddOverlayFocusHandlerToPurchaseLookPrompt": {
    "mechanism": "Integrates a focus handler for purchase prompts in the overlay.",
    "purpose": "Improves navigation and accessibility when making purchases, making it easier for players to interact with prompts."
  },
  "FFlagFixLockCenterMouseClickAndScroll": {
    "mechanism": "Fixes issues with mouse click and scrolling behavior in the center of the screen.",
    "purpose": "Provides a smoother and more reliable control experience for players, especially during gameplay."
  },
  "FFlagFixEmoteWarningSize_Staged": {
    "mechanism": "Adjusts the size of warning messages for emotes.",
    "purpose": "Improves visibility and clarity of warnings when using emotes."
  },
  "FFlagShowSocialContextToastToAll_Staged": {
    "mechanism": "Displays social context notifications to all players.",
    "purpose": "Enhances player awareness of social interactions and events."
  },
  "FFlagAXDisableHiddenCatalogCategoryPills": {
    "mechanism": "Removes hidden category indicators from the catalog.",
    "purpose": "Simplifies the catalog interface for easier navigation."
  },
  "FFlagIsrMainMetrics": {
    "mechanism": "Tracks key performance metrics for the platform.",
    "purpose": "Helps improve the overall experience by monitoring system performance."
  },
  "FFlagAXMigrateResellersCardToAutofocus": {
    "mechanism": "Changes focus behavior for reseller cards in the UI.",
    "purpose": "Makes it easier for players to interact with reseller items."
  },
  "FFlagPerfDataOnTelemetryV2": {
    "mechanism": "Enables enhanced performance data collection for analysis.",
    "purpose": "Improves game performance by helping developers identify and fix issues."
  },
  "DFFlagWriteTombstoneAfterDynamicFetch_Staged": {
    "mechanism": "Creates a backup record after fetching dynamic content.",
    "purpose": "Ensures better stability and recovery of game data in case of errors."
  },
  "FFlagVideoEncoderScopedOutputBuffer": {
    "mechanism": "Optimizes video encoding by managing output buffers more effectively.",
    "purpose": "Enhances video quality and reduces lag during gameplay recordings."
  },
  "FFlagAXUnifiedLoggingValidation1": {
    "mechanism": "Standardizes logging processes for easier tracking and validation.",
    "purpose": "Helps developers monitor game performance and user interactions more effectively."
  },
  "DFFlagRemoveTemporaryScreenshotFilePresave": {
    "mechanism": "Eliminates the need for temporary screenshot files before saving.",
    "purpose": "Streamlines the screenshot process, making it faster and more efficient for players."
  },
  "FFlagLuauNoConstraintGenRecursionLimitIce_Staged": {
    "mechanism": "Removes the limit on recursive calls in constraint generation.",
    "purpose": "Allows for more complex and flexible designs in games without hitting recursion limits."
  },
  "FFlagMigrateEmptyResultsViewToFoundation": {
    "mechanism": "Updates the display for empty search results to a new framework.",
    "purpose": "Improves the user experience by providing a cleaner and more modern look when no results are found."
  },
  "FFlagAXBackgroundSceneManagerRevamp3_Staged": {
    "mechanism": "Enhances the management of background scenes for better performance.",
    "purpose": "Provides smoother transitions and improved visuals in games with multiple scenes."
  },
  "FFlagAppChatFixPaddingWhenScaling": {
    "mechanism": "Adjusts padding in the chat interface when the app is resized.",
    "purpose": "Ensures that chat messages are displayed neatly and are easy to read, regardless of screen size."
  },
  "FFlagLuauVectorLerp": {
    "mechanism": "Introduces a new method for smoothly interpolating between vector points.",
    "purpose": "Enables smoother movements and animations in games, enhancing the overall gameplay experience."
  },
  "FFlagStudioUseUIThread": {
    "mechanism": "Switches the user interface rendering to a dedicated thread for better performance.",
    "purpose": "Improves the responsiveness and smoothness of the Studio interface for developers."
  },
  "FFlagFixEmoteWarningSize": {
    "mechanism": "Adjusts the size of the warning message that appears when using emotes.",
    "purpose": "Ensures that the warning message is appropriately sized and easier to read for players."
  },
  "FFlagAddFriendsConsistentFocusActions": {
    "mechanism": "Standardizes how focus actions are handled in the friends list.",
    "purpose": "Makes it easier for players to navigate and manage their friends list consistently."
  },
  "DFFlagISRPerfPass": {
    "mechanism": "Implements performance improvements for the in-game rendering system.",
    "purpose": "Enhances overall game performance and reduces lag for players."
  },
  "FFlagAddTopBarScrim": {
    "mechanism": "Adds a visual overlay to the top bar of the interface.",
    "purpose": "Improves visibility and focus on the top bar elements for better user experience."
  },
  "FFlagUIBloxFixModalBottomSheetSelectable": {
    "mechanism": "Fixes the selection behavior of modal bottom sheets in the UI framework.",
    "purpose": "Improves user interaction with modal windows, making them easier to select and use."
  },
  "DFIntTextChatCommandClientSentThrottlePermyriad": {
    "mechanism": "Limits the number of chat commands sent by players to prevent spam.",
    "purpose": "Enhances chat experience by reducing clutter and ensuring important messages are seen."
  },
  "DFIntLoadTestStartTimeUnix_PlaceFilter": {
    "mechanism": "Sets a specific start time for load tests based on the place being tested.",
    "purpose": "Helps developers analyze performance data more accurately for different game environments."
  },
  "DFFlagVoiceSdpCompressionSendSizeTelemetry": {
    "mechanism": "Tracks the size of compressed audio data sent during voice communication.",
    "purpose": "Improves voice chat quality by optimizing data usage and performance."
  },
  "FFlagEnableCVSUrlForOtaPatch": {
    "mechanism": "Allows the use of a specific URL format for over-the-air updates.",
    "purpose": "Ensures smoother and more reliable updates for players' games and experiences."
  },
  "FFlagUITextureRendererUseNewRenderPath": {
    "mechanism": "Switches to a new method for rendering textures in the user interface.",
    "purpose": "Improves the visual quality and performance of UI elements for players."
  },
  "FFlagNetworkInterface_Staged": {
    "mechanism": "Introduces a staged approach to network communication between the client and server.",
    "purpose": "Enhances stability and reduces lag during gameplay for a smoother experience."
  },
  "FFlagCapturesAddSavePromptVideoLog": {
    "mechanism": "Adds a prompt to save video logs when capturing gameplay.",
    "purpose": "Allows players to easily save and review their gameplay recordings."
  },
  "FFlagCleanUpMouseWrapMode": {
    "mechanism": "Refines how the mouse wrap mode functions in the game.",
    "purpose": "Provides a more intuitive and responsive mouse control experience for players."
  },
  "FFlagFallbackGenericAbuseReporting": {
    "mechanism": "Implements a fallback system for reporting abuse when the primary method fails.",
    "purpose": "Ensures players can still report inappropriate behavior, enhancing community safety."
  },
  "DFIntTextChatMessageClientReceivedThrottlePermyriad": {
    "mechanism": "Limits the number of chat messages received by the client to reduce spam.",
    "purpose": "Improves chat experience by preventing overwhelming amounts of messages."
  },
  "FFlagVideoGamePreviewSessionTracking": {
    "mechanism": "Tracks player sessions during video game previews for better analytics.",
    "purpose": "Helps developers understand player engagement during game previews."
  },
  "DFIntJoinLimitWin32x64": {
    "mechanism": "Sets a limit on the number of players that can join a game on 64-bit Windows.",
    "purpose": "Ensures smoother gameplay by managing server load effectively."
  },
  "FFlagDisableEtcFallback": {
    "mechanism": "Disables fallback options for certain features when they fail.",
    "purpose": "Enhances reliability by ensuring only fully functional features are used."
  },
  "FFlagAXCatalogCategoryPillsShowAllCategory": {
    "mechanism": "Displays all categories in the catalog using pill-style navigation.",
    "purpose": "Makes it easier for players to browse and find items in the catalog."
  },
  "FFlagSTM6819Enabled_Staged": {
    "mechanism": "Enables a new system for managing game state more efficiently.",
    "purpose": "Improves game performance and responsiveness for players."
  },
  "FFlagSduiSupportArrayParsing": {
    "mechanism": "Allows the parsing of arrays in the new UI framework.",
    "purpose": "Enhances user interface flexibility and functionality in games."
  },
  "FFlagFlyweightTrackId_Staged": {
    "mechanism": "Optimizes how track IDs are handled in the game engine.",
    "purpose": "Reduces memory usage and improves loading times for players."
  },
  "DFFlagInferredCrashReportToBacktraceRegister": {
    "mechanism": "Automatically sends crash reports to a centralized system for analysis.",
    "purpose": "Helps developers fix bugs faster, leading to a smoother gaming experience."
  },
  "DFFlagEditableMeshFastClusterSkipLoD": {
    "mechanism": "Improves how editable meshes are processed by skipping certain detail levels.",
    "purpose": "Enhances rendering speed and visual quality in games."
  },
  "FFlagDisableGalleryStopGap": {
    "mechanism": "Removes a temporary measure that limits gallery loading.",
    "purpose": "Improves the speed and experience of browsing galleries."
  },
  "FFlagUKOSALegacyReportMenu": {
    "mechanism": "Enables an older version of the report menu for users in the UK.",
    "purpose": "Provides a familiar reporting interface for users accustomed to the previous design."
  },
  "FFlagSongbirdPopoverSubmenu2_Staged": {
    "mechanism": "Introduces a new submenu in the Songbird interface.",
    "purpose": "Enhances navigation and access to features within the Songbird tool."
  },
  "FFlagFCDecrementVertexCount_Staged": {
    "mechanism": "Reduces the number of vertices in certain 3D models.",
    "purpose": "Improves game performance by making models less resource-intensive."
  },
  "FFlagAXSendLegacyWidgetImpressions": {
    "mechanism": "Tracks interactions with older widget designs.",
    "purpose": "Helps developers understand how players engage with legacy features."
  },
  "DFFlagVideoSandboxPreviewVideos_Staged": {
    "mechanism": "Enables a preview feature for videos in a sandbox environment.",
    "purpose": "Allows developers to test video content before it goes live."
  },
  "DFFlagWriteFlagCacheAfterDynamicFetch": {
    "mechanism": "Stores fetched flag data in a cache for quicker access.",
    "purpose": "Improves performance by reducing load times for players."
  },
  "FFlagAXQuickButtonsFrameShouldAlwaysExist": {
    "mechanism": "Ensures that a specific UI frame for quick buttons is always present.",
    "purpose": "Provides a consistent and accessible interface for players to use quick actions."
  },
  "FFlagFixHapticWaveformReplication": {
    "mechanism": "Corrects the way haptic feedback is replicated across devices.",
    "purpose": "Enhances the tactile experience for players using compatible devices."
  },
  "FFlagCallVoiceLeaveOnNetworkDisconnect2_Staged": {
    "mechanism": "Automatically disconnects voice chat when a network issue occurs.",
    "purpose": "Improves communication experience by preventing confusion during connectivity problems."
  },
  "FFlagAXMigrateQuickButtonsToGlobalAutoFocus": {
    "mechanism": "Moves quick action buttons to a global focus system for easier access.",
    "purpose": "Makes it simpler for players to use quick buttons without needing to click around."
  },
  "FFlagPlaceVersionHistoryMetadataRCC": {
    "mechanism": "Enhances the metadata for place version history in the Roblox Cloud.",
    "purpose": "Allows players to see more detailed information about different versions of a game."
  },
  "DFFlagBacktraceAPIQueryParamFix": {
    "mechanism": "Fixes issues with how API queries handle backtrace parameters.",
    "purpose": "Improves the reliability of game data retrieval, leading to smoother gameplay."
  },
  "FFlagFoundationPseudoChildSelectors": {
    "mechanism": "Introduces new CSS-like selectors for better styling of UI elements.",
    "purpose": "Gives developers more control over how game interfaces look, enhancing player experience."
  },
  "FFlagMediaPlaybackStopsWhenJoiningExperience": {
    "mechanism": "Automatically pauses media playback when a player joins a game.",
    "purpose": "Prevents distractions from ongoing media, allowing players to focus on the game."
  },
  "DFIntAcousticSimulationForegroundCost": {
    "mechanism": "Adjusts the cost of acoustic simulations in the foreground processing.",
    "purpose": "Improves sound accuracy in games, enhancing the overall audio experience for players."
  },
  "FFlagMicroprofilerBigButtons_Staged": {
    "mechanism": "Enables larger buttons in the microprofiler tool for easier interaction.",
    "purpose": "Makes it simpler for developers to analyze performance, leading to smoother gameplay for players."
  },
  "FFlagAXOutlineSubcategoryPill": {
    "mechanism": "Introduces a new visual element for categorizing accessibility features.",
    "purpose": "Helps players easily find and use accessibility options, improving inclusivity in games."
  },
  "DFFlagISRBlockStaleCFrameImprovements": {
    "mechanism": "Enhances the handling of stale CFrame data in the game engine.",
    "purpose": "Reduces glitches and improves the stability of character movements, leading to a better gaming experience."
  },
  "DFFlagVoiceSdpCompressionRemoteEventFieldReceivesUnexpectedValue": {
    "mechanism": "Fixes issues with unexpected values in voice communication data.",
    "purpose": "Ensures clearer and more reliable voice chat, enhancing communication between players."
  },
  "FFlagStudioTasksFutureShareMutexes_Staged": {
    "mechanism": "Implements a new way to manage shared resources in Studio tasks.",
    "purpose": "Improves performance and stability when multiple tasks are running simultaneously."
  },
  "FFlagAXCategoryPillColorAnimationInstantOff_Staged": {
    "mechanism": "Changes the animation behavior for category pills to disable instantly.",
    "purpose": "Provides a smoother user experience by making category changes immediate."
  },
  "FFlagRemoveiOS13DeprecatedCode": {
    "mechanism": "Removes outdated code that is no longer supported in iOS 13.",
    "purpose": "Ensures better compatibility and performance on newer iOS devices."
  },
  "FStringEngineVoiceSdpCompressionIxpLayer_IXP": {
    "mechanism": "Enhances voice data compression in the engine for better transmission.",
    "purpose": "Improves voice chat quality and reduces lag during gameplay."
  },
  "FFlagVideoWinEncodeSampleTracking": {
    "mechanism": "Tracks video encoding samples on Windows for better analytics.",
    "purpose": "Helps improve video quality and performance by analyzing encoding processes."
  },
  "FFlagCreateConnectionInternalEarlierServer": {
    "mechanism": "Allows connections to be established with the server sooner in the process.",
    "purpose": "Reduces waiting time for players to join games."
  },
  "FFlagEngineVoiceChatClientRewriteIxpEnabled_IXP": {
    "mechanism": "Implements a new system for handling voice chat on the client side.",
    "purpose": "Improves the quality and reliability of voice chat for players."
  },
  "FFlagLuaAppSupportEmptyStringFooterMetadata": {
    "mechanism": "Enables support for metadata in Lua applications, even when the footer is empty.",
    "purpose": "Allows developers to provide more information in their apps, enhancing player experience."
  },
  "DFFlagCLI169073": {
    "mechanism": "Activates a specific command-line interface feature for developers.",
    "purpose": "Streamlines development processes, leading to faster updates and fixes for players."
  },
  "DFIntAssetProviderCdnBytesThrottleHundrethsPercent2": {
    "mechanism": "Adjusts the data transfer rate for asset delivery from the content delivery network.",
    "purpose": "Optimizes loading times for players by managing bandwidth usage."
  },
  "DFStringFlipTimeStampDynamicString": {
    "mechanism": "Changes how timestamps are formatted in dynamic strings.",
    "purpose": "Improves the display of time-related information for players."
  },
  "FFlagFixIsrDeferredPropResize": {
    "mechanism": "Fixes issues with resizing properties in the game engine.",
    "purpose": "Ensures smoother gameplay and better performance for players."
  },
  "FFlagNetworkInterface": {
    "mechanism": "Introduces a new way for the game to handle network connections.",
    "purpose": "Enhances stability and speed of online interactions for players."
  },
  "DFFlagAndroidOomScoreTelemetry": {
    "mechanism": "Collects data on memory usage for Android devices.",
    "purpose": "Helps improve game performance on Android for a better player experience."
  },
  "FFlagStudioTasksFutureShareMutexes": {
    "mechanism": "Implements a system for managing tasks in the game development environment.",
    "purpose": "Allows developers to work more efficiently, leading to better games for players."
  },
  "DFFlagUseVisBugChecks_PlaceFilter": {
    "mechanism": "Enables checks for visibility bugs when filtering places.",
    "purpose": "Helps ensure players see the correct places without visual errors."
  },
  "DFFlagEnableContextForGenerateList_Staged": {
    "mechanism": "Introduces context options when generating lists in the system.",
    "purpose": "Improves user experience by providing more relevant options when creating lists."
  },
  "DFFlagVideoWinHwEncoderDeleteIfNoPool": {
    "mechanism": "Removes hardware encoder settings if no resource pool is available.",
    "purpose": "Prevents errors and improves video processing reliability for players."
  },
  "FFlagStudioUseUIThread_Staged": {
    "mechanism": "Switches certain operations to run on the UI thread for better performance.",
    "purpose": "Enhances the responsiveness and smoothness of the Roblox Studio interface."
  },
  "FFlagLuauOccursCheckInCommit": {
    "mechanism": "Adds checks for Luau code during the commit process.",
    "purpose": "Ensures better code quality and fewer errors for developers when saving their work."
  },
  "FFlagShowSocialContextToastToAll": {
    "mechanism": "Displays a notification to all players when someone interacts socially.",
    "purpose": "Keeps players informed about social interactions in the game."
  },
  "FFlagPassTextAlignmentRelevancyInfo": {
    "mechanism": "Improves how text alignment information is processed and displayed.",
    "purpose": "Enhances the readability and layout of text for players."
  },
  "FFlagRbxthumbForAlbumArt_Staged": {
    "mechanism": "Uses a new method to display album art thumbnails.",
    "purpose": "Provides better visuals for album art in the game."
  },
  "FFlagAXCategoryPillPositionAnimation": {
    "mechanism": "Animates the position of category indicators in the user interface.",
    "purpose": "Creates a smoother and more engaging experience when navigating categories."
  },
  "FFlagVoiceChatEnableSdpCompressionMaster3_IXP": {
    "mechanism": "Implements advanced compression for voice chat data.",
    "purpose": "Improves voice chat quality and reduces lag for players."
  },
  "FStringTutorialUpsellPlaceId": {
    "mechanism": "Stores the Place ID for tutorial upsell prompts.",
    "purpose": "Helps new players discover tutorials relevant to the game they are in."
  },
  "DFFlagFixImageContentInvalid": {
    "mechanism": "Addresses issues with loading invalid image content.",
    "purpose": "Ensures players see the correct images without errors, improving visual experience."
  },
  "FFlagVoiceChatClientRewrite_OneFlagToRuleThemAll_Client2": {
    "mechanism": "Centralizes voice chat functionality for better performance.",
    "purpose": "Enhances voice chat reliability and quality for players."
  },
  "FFlagColorPickerUseGridLayout": {
    "mechanism": "Changes the layout of the color picker to a grid format.",
    "purpose": "Makes it easier for players to select colors quickly and intuitively."
  },
  "FFlagNativeDialogManager": {
    "mechanism": "Implements a new system for managing dialog boxes natively.",
    "purpose": "Improves the way notifications and prompts are displayed to players, making interactions smoother."
  },
  "DFFlagISRAdjustMtu": {
    "mechanism": "Adjusts the maximum transmission unit size for data packets.",
    "purpose": "Improves network performance and reduces lag during gameplay."
  },
  "FFlagStudioActionsMultiplePayloads_Staged": {
    "mechanism": "Allows multiple actions to be sent in one request within the studio.",
    "purpose": "Enhances efficiency for developers, making it easier to manage changes."
  },
  "FFlagLuaAppFocusFixTopBanner_Staged": {
    "mechanism": "Fixes focus issues with the top banner in Lua applications.",
    "purpose": "Ensures better user interaction and visibility for important notifications."
  },
  "FFlagFCSkeletonIgnoreUnusedPartsCheckFaceControls_Staged": {
    "mechanism": "Skips checks for unused parts in face control systems.",
    "purpose": "Streamlines character animations, improving performance and responsiveness."
  },
  "FFlagOnlyVisibleFramesAllowModal": {
    "mechanism": "Restricts modal dialogs to only visible frames.",
    "purpose": "Prevents confusion by ensuring modals only appear in relevant areas of the screen."
  },
  "FFlagLuaAppRecommendedGamesCollectionCarousel": {
    "mechanism": "Enables a carousel display for recommended games in the Lua app.",
    "purpose": "Players can easily browse through recommended games in a visually appealing way."
  },
  "DFFlagVoiceChatSendHttpErrorsTelemetry_Staged": {
    "mechanism": "Tracks and sends data about voice chat errors to improve the system.",
    "purpose": "Helps ensure a smoother voice chat experience by identifying and fixing issues."
  },
  "FFlagStudioActionsMultiplePayloads": {
    "mechanism": "Allows multiple actions to be processed at once in Roblox Studio.",
    "purpose": "Streamlines the development process for creators, making it faster to implement changes."
  },
  "FFlagUKOSALegacyReportMenu_Staged": {
    "mechanism": "Reintroduces an older version of the report menu for users in the UK.",
    "purpose": "Provides a familiar and potentially more user-friendly way to report issues."
  },
  "FFlagEnableAppChatFocusableFixes2": {
    "mechanism": "Implements fixes to improve focus and usability in the chat feature of the app.",
    "purpose": "Enhances the chat experience for players, making it easier to communicate."
  },
  "FFlagAppChatEnableHandheldScalingFixes": {
    "mechanism": "Adjusts chat interface scaling for handheld devices.",
    "purpose": "Improves readability and usability of chat on mobile devices."
  },
  "DFIntProductIdProductInfoCacheLifetimeSeconds_PlaceFilter": {
    "mechanism": "Sets the time product information is stored before refreshing.",
    "purpose": "Enhances performance by reducing load times for product info in places."
  },
  "FFlagAXRemoveTryOnManagerAvatarScreen": {
    "mechanism": "Disables a feature that manages avatar try-on options.",
    "purpose": "Simplifies the avatar customization process for users."
  },
  "FFlagAppChatEnableHandheldScalingFixes_Staged": {
    "mechanism": "Implements experimental scaling fixes for chat on mobile.",
    "purpose": "Tests improvements to chat usability on handheld devices."
  },
  "FFlagAXFixFocusNavigationShiftingWidgetList": {
    "mechanism": "Corrects navigation issues in widget lists for accessibility.",
    "purpose": "Ensures smoother navigation for players using assistive technologies."
  },
  "FFlagMediaPlaybackStopsWhenJoiningExperience_Staged": {
    "mechanism": "Stops any media playback when a player joins a game.",
    "purpose": "Prevents audio or video from playing unexpectedly when entering a new experience."
  },
  "FFlagReverbAbsorptionFieldFileFormat": {
    "mechanism": "Changes how sound reverb effects are stored and processed.",
    "purpose": "Improves the quality of sound effects in games, making them more immersive."
  },
  "FFlagEngineVoiceSdpCompressionIxpEnabled_IXP": {
    "mechanism": "Enables a more efficient way to compress voice chat data.",
    "purpose": "Enhances voice chat quality and reduces lag during conversations."
  },
  "FFlagPassTextAlignmentRelevancyInfo_Staged": {
    "mechanism": "Updates how text alignment information is handled in the game engine.",
    "purpose": "Allows for better text formatting, improving readability for players."
  },
  "FFlagPurchasePromptPriceShouldUseProductInfoPrice2": {
    "mechanism": "Changes the way purchase prices are retrieved and displayed.",
    "purpose": "Ensures that players see the correct price for items, reducing confusion during purchases."
  },
  "DFStringLoadTestingUniverseId": {
    "mechanism": "Stores a unique identifier for testing environments.",
    "purpose": "Allows developers to test their games in specific scenarios without affecting live games."
  },
  "FFlagFlyweightTrackId": {
    "mechanism": "Optimizes memory usage by reusing track identifiers.",
    "purpose": "Improves game performance and reduces lag for players."
  },
  "FFlagAppChatFixPaddingWhenScaling_Staged": {
    "mechanism": "Adjusts chat interface padding dynamically when the app is resized.",
    "purpose": "Ensures a better chat experience by preventing text from being cut off or misaligned."
  },
  "DFIntTextChatMessageClientReceivedThrottlePermyriad_Staged": {
    "mechanism": "Limits the rate at which chat messages are processed on the client side.",
    "purpose": "Reduces spam and improves chat readability for players."
  },
  "FFlagLuauCompileVectorLerp_Staged": {
    "mechanism": "Enhances the way vector calculations are compiled in the Luau scripting language.",
    "purpose": "Enables smoother animations and movements in games for a better player experience."
  },
  "FFlagDisableRejoinGroupIdDoubleRead": {
    "mechanism": "Prevents the system from checking the group ID twice when a player rejoins a game.",
    "purpose": "Reduces delays and improves performance when players rejoin games, making the experience smoother."
  }
}